{
  "traditionName": "Conservative (Masorti)",
  "serviceOrder": [
    {
      "id": "candle_lighting",
      "name_en": "Candle Lighting",
      "name_he": "הַדְלָקַת נֵרוֹת",
      "summary": "Formal beginning of Shabbat, often done at home but sometimes included congregationally.",
      "details": {
        "background": "Observance follows traditional practice. When done in the synagogue, it sets the stage for the service.",
        "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר שֶׁל שַׁבָּת.",
        "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu l'hadlik ner shel Shabbat.",
        "full_text_en_translate": "Blessed are You, LORD our God, King of the universe, Who has sanctified us with His commandments and commanded us to kindle the light of Shabbat.",
        "notes": ""
      }
    },
    {
      "id": "kabbalat_shabbat_psalms",
      "name_en": "Kabbalat Shabbat Psalms",
      "name_he": "מִזְמוֹרֵי קַבָּלַת שַׁבָּת",
      "summary": "Typically includes Psalms 95-99 and 29, welcoming Shabbat.",
      "details": {
        "background": "Conservative services generally retain the traditional sequence of six Psalms corresponding to the days of creation, recited or sung to welcome Shabbat.",
        "full_text_he": "(Psalms 95, 96, 97, 98, 99, 29)",
        "notes": "Musical settings vary widely."
      }
    },
    {
      "id": "lecha_dodi",
      "name_en": "Lecha Dodi",
      "name_he": "לְכָה דוֹדִי",
      "summary": "Mystical poem greeting Shabbat as a Bride/Queen.",
      "details": {
        "background": "A central and beloved part of Kabbalat Shabbat, sung communally. Custom of rising and turning to the entrance for the last stanza is common.",
        "full_text_he": "לְכָה דוֹדִי לִקְרַאת כַּלָּה, פְּנֵי שַׁבָּת נְקַבְּלָה...",
        "full_text_en_translit": "Lecha Dodi likrat kallah, p'nei Shabbat n'kab'lah...",
        "full_text_en_translate": "Come, my Beloved, to greet the Bride; let us welcome the presence of Shabbat...",
        "notes": "Multiple melodies exist."
      }
    },
    {
      "id": "psalm_92_93",
      "name_en": "Psalm 92/93",
      "name_he": "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת",
      "summary": "Psalm for the Sabbath Day (and sometimes Ps 93), formally concluding Kabbalat Shabbat.",
      "details": {
        "background": "Psalm 92 is explicitly designated for Shabbat. Some communities add Psalm 93.",
        "full_text_he": "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת...",
        "notes": ""
      }
    },
    {
      "id": "barchu",
      "name_en": "Call to Prayer (Bar'chu)",
      "name_he": "בָּרְכוּ",
      "summary": "Formal call initiating the Ma'ariv (Evening) service.",
      "details": {
        "background": "Standard liturgical practice, requires a Minyan (defined inclusively).",
        "full_text_he": "(Leader:) בָּרְכוּ אֶת יְיָ הַמְּבֹרָךְ.\n(Cong:) בָּרוּךְ יְיָ הַמְּבֹרָךְ לְעוֹלָם וָעֶד.",
        "full_text_en_translit": "(Leader:) Bor'chu et Adonai ha'm'vorach.\n(Cong:) Baruch Adonai ha'm'vorach l'olam va'ed.",
        "full_text_en_translate": "(Leader:) Bless the LORD who is to be blessed.\n(Cong:) Blessed is the LORD who is to be blessed forever and ever.",
        "notes": ""
      }
    },
    {
      "id": "shema_blessings_before",
      "name_en": "Blessings Before Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Two blessings: praising God for creation/time (Ma'ariv Aravim) and for revelation/love (Ahavat Olam).",
      "details": {
        "background": "Follows the traditional structure and Hebrew text, focusing on God's role in nature and the gift of Torah through love.",
        "full_text_he": "מַעֲרִיב עֲרָבִים: בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר בִּדְבָרוֹ מַעֲרִיב עֲרָבִים, בְּחָכְמָה פּוֹתֵחַ שְׁעָרִים, וּבִתְבוּנָה מְשַׁנֶּה עִתִּים וּמַחֲלִיף אֶת הַזְּמַנִּים, וּמְסַדֵּר אֶת הַכּוֹכָבִים בְּמִשְׁמְרוֹתֵיהֶם בָּרָקִיעַ כִּרְצוֹנוֹ. בּוֹרֵא יוֹם וָלַיְלָה, גּוֹלֵל אוֹר מִפְּנֵי חֹשֶׁךְ וְחֹשֶׁךְ מִפְּנֵי אוֹר, וּמַעֲבִיר יוֹם וּמֵבִיא לַיְלָה, וּמַבְדִּיל בֵּין יוֹם וּבֵין לַיְלָה, יְיָ צְבָאוֹת שְׁמוֹ. אֵל חַי וְקַיָּם, תָּמִיד יִמְלֹךְ עָלֵינוּ לְעוֹלָם וָעֶד. בָּרוּךְ אַתָּה יְיָ, הַמַּעֲרִיב עֲרָבִים.\nאַהֲבַת עוֹלָם: אַהֲבַת עוֹלָם בֵּית יִשְׂרָאֵל עַמְּךָ אָהַבְתָּ, תּוֹרָה וּמִצְוֹת חֻקִּים וּמִשְׁפָּטִים אוֹתָנוּ לִמַּדְתָּ. עַל כֵּן יְיָ אֱלֹהֵינוּ בְּשָׁכְבֵנוּ וּבְקוּמֵנוּ נָשִׂיחַ בְּחֻקֶּיךָ, וְנִשְׂמַח בְּדִבְרֵי תוֹרָתֶךָ וּבְמִצְוֹתֶיךָ לְעוֹלָם וָעֶד. כִּי הֵם חַיֵּינוּ וְאֹרֶךְ יָמֵינוּ, וּבָהֶם נֶהְגֶּה יוֹמָם וָלַיְלָה. וְאַהֲבָתְךָ אַל תָּסִיר מִמֶּנּוּ לְעוֹלָמִים. בָּרוּךְ אַתָּה יְיָ, אוֹהֵב עַמּוֹ יִשְׂרָאֵל.",
        "full_text_en_translit": "Ma'ariv Aravim: Baruch atah Adonai Eloheinu Melech ha'olam, asher bidvaro ma'ariv aravim, b'chochmah potei'ach she'arim, uvit'vunah m'shaneh itim umachalif et hazmanim, um'sadeir et hakochavim b'mishm'roteihem baraki'a kirtzono. Borei yom valaila, goleil or mipnei choshech v'choshech mipnei or, uma'avir yom umeivi laila, umavdil bein yom uvein laila, Adonai Tzeva'ot sh'mo. El chai v'kayam, tamid yimloch aleinu l'olam va'ed. Baruch atah Adonai, ha...",
        "notes": "May include occasional responsive readings or English explanations."
      }
    },
    {
      "id": "shema",
      "name_en": "Shema",
      "name_he": "שְׁמַע",
      "summary": "Core declaration of faith including all three traditional paragraphs.",
      "details": {
        "background": "Recited fully, adhering to traditional practice (covering eyes for first line, etc.). Considered a central mitzvah.",
        "full_text_he": "שְׁמַע יִשְׂרָאֵל... (Deut 6:4-9)\nוְהָיָה אִם שָׁמֹעַ... (Deut 11:13-21)\nוַיֹּאמֶר... (Num 15:37-41)",
        "full_text_en_translit": "Sh'ma Yisrael...\nV'haya im shamoa...\nVayomer...",
        "full_text_en_translate": "Hear, O Israel...\nAnd it shall come to pass, if you listen diligently...\nThe LORD spoke...",
        "notes": ""
      }
    },
    {
      "id": "shema_blessings_after",
      "name_en": "Blessings After Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Two blessings: affirming God's redemption (Emet V'Emunah) and seeking protection (Hashkiveinu).",
      "details": {
        "background": "Traditional Hebrew texts are used, affirming the reliability of God's promise of redemption and praying for peaceful rest under divine protection.",
        "full_text_he": "[Full traditional Hebrew texts for Emet V'Emunah and Hashkiveinu]",
        "notes": ""
      }
    },
    {
      "id": "amidah",
      "name_en": "Amidah (Shemoneh Esrei)",
      "name_he": "עֲמִידָה (שְׁמוֹנֶה עֶשְׂרֵה)",
      "summary": "Central standing prayer (7 blessings for Shabbat), recited silently then potentially repeated by leader.",
      "details": {
        "background": "Follows the traditional structure. Silent recitation is primary. Conservative siddurim typically offer options for including the Matriarchs (Imahot) alongside the Patriarchs (Avot) in the first blessing. The leader's repetition (Chazarat HaShatz) may include Kedusha.",
        "full_text_he": "[Standard 7 blessings: Avot (often with Imahot option), Gevurot, Kedushat Hashem, Kedushat Hayom, Avodah, Hoda'ah, Sim Shalom/Shalom Rav]",
        "full_text_en_translit": "[Standard 7 blessings]",
        "full_text_en_translate": "[Standard 7 blessings]",
        "notes": "Inclusion of Matriarchs common. Some variation in concluding peace blessing (Sim Shalom/Shalom Rav)."
      }
    },
    {
      "id": "aleinu",
      "name_en": "Aleinu",
      "name_he": "עָלֵינוּ",
      "summary": "Concluding prayer praising God and looking towards universal redemption.",
      "details": {
        "background": "Standard concluding prayer, recited with traditional text.",
        "full_text_he": "עָלֵינוּ לְשַׁבֵּחַ...",
        "full_text_en_translit": "Aleinu l'shabei'ach...",
        "full_text_en_translate": "It is our duty to praise...",
        "notes": ""
      }
    },
    {
      "id": "kaddish",
      "name_en": "Mourner's Kaddish",
      "name_he": "קַדִּישׁ יָתוֹם",
      "summary": "Prayer of praise recited by mourners.",
      "details": {
        "background": "Recited near the end if mourners are present and a Minyan exists.",
        "full_text_he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא...",
        "full_text_en_translit": "Yitgadal v'yitkadash sh'mei raba...",
        "full_text_en_translate": "Magnified and sanctified may God's great Name be...",
        "notes": ""
      }
    },
    {
      "id": "closing_hymn_kiddush",
      "name_en": "Closing Hymn / Kiddush",
      "name_he": "שִׁיר סִיּוּם / קִדּוּשׁ",
      "summary": "Often concludes with Adon Olam or Yigdal. Kiddush typically follows the service.",
      "details": {
        "background": "Traditional hymns like Adon Olam or Yigdal are common closings. Kiddush over wine is usually recited after the service concludes, leading into fellowship (Oneg Shabbat).",
        "full_text_he": "(E.g., אֲדוֹן עוֹלָם or יִגְדָּל)",
        "notes": ""
      }
    }
  ]
}
