{
  "traditionName": "Conservative (Masorti)",
  "serviceOrder": [
    {
      "id": "candle_lighting",
      "name_en": "Candle Lighting",
      "name_he": "הַדְלָקַת נֵרוֹת",
      "summary": "Formal beginning of Shabbat, often done at home but sometimes included congregationally.",
      "details": {
        "background": "Observance follows traditional practice. When done in the synagogue, it sets the stage for the service.",
        "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר שֶׁל שַׁבָּת.",
        "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu l'hadlik ner shel Shabbat.",
        "full_text_en_translate": "Blessed are You, LORD our God, King of the universe, Who has sanctified us with His commandments and commanded us to kindle the light of Shabbat.",
        "notes": "In congregational settings, this may be led by a rabbi or lay leader, often with a communal response."
      }
    },
    {
      "id": "kabbalat_shabbat_psalms",
      "name_en": "Kabbalat Shabbat Psalms",
      "name_he": "מִזְמוֹרֵי קַבָּלַת שַׁבָּת",
      "summary": "Typically includes Psalms 95-99 and 29, welcoming Shabbat.",
      "details": {
        "background": "Conservative services generally retain the traditional sequence of six Psalms corresponding to the days of creation, recited or sung to welcome Shabbat.",
        "full_text_he": "(Psalms 95, 96, 97, 98, 99, 29)",
        "full_text_en_translit": "(Tehillim 95-99, 29)",
        "full_text_en_translate": "(Psalms 95-99, 29)",
        "notes": "Musical settings vary widely. Some congregations may abbreviate or chant responsively."
      }
    },
    {
      "id": "lecha_dodi",
      "name_en": "Lecha Dodi",
      "name_he": "לְכָה דוֹדִי",
      "summary": "Mystical poem greeting Shabbat as a Bride/Queen.",
      "details": {
        "background": "A central and beloved part of Kabbalat Shabbat, sung communally. Custom of rising and turning to the entrance for the last stanza is common.",
        "full_text_he": "לְכָה דוֹדִי לִקְרַאת כַּלָּה, פְּנֵי שַׁבָּת נְקַבְּלָה...",
        "full_text_en_translit": "Lecha Dodi likrat kallah, p'nei Shabbat n'kab'lah...",
        "full_text_en_translate": "Come, my Beloved, to greet the Bride; let us welcome the presence of Shabbat...",
        "notes": "Multiple melodies exist. Often sung with congregational participation."
      }
    },
    {
      "id": "psalm_92_93",
      "name_en": "Psalm 92/93",
      "name_he": "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת",
      "summary": "Psalm for the Sabbath Day (and sometimes Ps 93), formally concluding Kabbalat Shabbat.",
      "details": {
        "background": "Psalm 92 is explicitly designated for Shabbat. Some communities add Psalm 93.",
        "full_text_he": "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת...",
        "full_text_en_translit": "Mizmor shir l'yom HaShabbat...",
        "full_text_en_translate": "A psalm, a song for the Sabbath day...",
        "notes": "Often chanted in a traditional melody."
      }
    },
    {
      "id": "barchu",
      "name_en": "Call to Prayer (Bar'chu)",
      "name_he": "בָּרְכוּ",
      "summary": "Formal call initiating the Ma'ariv (Evening) service.",
      "details": {
        "background": "Standard liturgical practice, requires a Minyan (defined inclusively).",
        "full_text_he": "(Leader:) בָּרְכוּ אֶת יְיָ הַמְּבֹרָךְ.\n(Cong:) בָּרוּךְ יְיָ הַמְּבֹרָךְ לְעוֹלָם וָעֶד.",
        "full_text_en_translit": "(Leader:) Bor'chu et Adonai ha'm'vorach.\n(Cong:) Baruch Adonai ha'm'vorach l'olam va'ed.",
        "full_text_en_translate": "(Leader:) Bless the LORD who is to be blessed.\n(Cong:) Blessed is the LORD who is to be blessed forever and ever.",
        "notes": "Congregants traditionally bow slightly when reciting 'Baruch'."
      }
    },
    {
      "id": "shema_blessings_before",
      "name_en": "Blessings Before Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Two blessings: praising God for creation/time (Ma'ariv Aravim) and for revelation/love (Ahavat Olam).",
      "details": {
        "background": "Follows the traditional structure and Hebrew text, focusing on God's role in nature and the gift of Torah through love.",
        "full_text_he": "מַעֲרִיב עֲרָבִים: בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר בִּדְבָרוֹ מַעֲרִיב עֲרָבִים, בְּחָכְמָה פּוֹתֵחַ שְׁעָרִים, וּבִתְבוּנָה מְשַׁנֶּה עִתִּים וּמַחֲלִיף אֶת הַזְּמַנִּים, וּמְסַדֵּר אֶת הַכּוֹכָבִים בְּמִשְׁמְרוֹתֵיהֶם בָּרָקִיעַ כִּרְצוֹנוֹ. בּוֹרֵא יוֹם וָלַיְלָה, גּוֹלֵל אוֹר מִפְּנֵי חֹשֶׁךְ וְחֹשֶׁךְ מִפְּנֵי אוֹר, וּמַעֲבִיר יוֹם וּמֵבִיא לַיְלָה, וּמַבְדִּיל בֵּין יוֹם וּבֵין לַיְלָה, יְיָ צְבָאוֹת שְׁמוֹ. אֵל חַי וְקַיָּם, תָּמִיד יִמְלֹךְ עָלֵינוּ לְעוֹלָם וָעֶד. בָּרוּךְ אַתָּה יְיָ, הַמַּעֲרִיב עֲרָבִים.\nאַהֲבַת עוֹלָם: אַהֲבַת עוֹלָם בֵּית יִשְׂרָאֵל עַמְּךָ אָהַבְתָּ, תּוֹרָה וּמִצְוֹת חֻקִּים וּמִשְׁפָּטִים אוֹתָנוּ לִמַּדְתָּ. עַל כֵּן יְיָ אֱלֹהֵינוּ בְּשָׁכְבֵנוּ וּבְקוּמֵנוּ נָשִׂיחַ בְּחֻקֶּיךָ, וְנִשְׂמַח בְּדִבְרֵי תוֹרָתֶךָ וּבְמִצְוֹתֶיךָ לְעוֹלָם וָעֶד. כִּי הֵם חַיֵּינוּ וְאֹרֶךְ יָמֵינוּ, וּבָהֶם נֶהְגֶּה יוֹמָם וָלַיְלָה. וְאַהֲבָתְךָ אַל תָּסִיר מִמֶּנּוּ לְעוֹלָמִים. בָּרוּךְ אַתָּה יְיָ, אוֹהֵב עַמּוֹ יִשְׂרָאֵל.",
        "full_text_en_translit": "Ma'ariv Aravim: Baruch atah Adonai Eloheinu Melech ha'olam, asher bidvaro ma'ariv aravim, b'chochmah potei'ach she'arim, uvit'vunah m'shaneh itim umachalif et hazmanim, um'sadeir et hakochavim b'mishm'roteihem baraki'a kirtzono. Borei yom valaila, goleil or mipnei choshech v'choshech mipnei or, uma'avir yom umeivi laila, umavdil bein yom ubein laila, Adonai Tzeva'ot sh'mo. El chai v'kayam, tamid yimloch aleinu l'olam va'ed. Baruch atah Adonai, ha'ma'ariv aravim.\nAhavat Olam: Ahavat olam beit Yisrael am'cha ahavta, Torah u'mitzvot chukim u'mishpatim otanu limad'ta. Al kein Adonai Eloheinu b'shachbeinu uv'kumeinu nasi'ach b'chukecha, v'nismach b'divrei Toratecha u'v'mitzvotecha l'olam va'ed. Ki heim chayeinu v'orech yameinu, u'vahem nehgeh yomam va'laila. V'ahavatecha al tasir mimenu l'olamim. Baruch atah Adonai, oheiv amo Yisrael.",
        "full_text_en_translate": "Ma'ariv Aravim: Blessed are You, LORD our God, King of the universe, Who by His word brings on the evening twilight, with wisdom opens the gates [of day and night], with understanding changes the times and varies the seasons, and arranges the stars in their watches in the sky according to His will. He creates day and night, rolling away light before darkness and darkness before light, causing day to pass and bringing night, and distinguishing between day and night—the LORD of hosts is His name. A living and enduring God, may He always rule over us forever and ever. Blessed are You, LORD, Who brings on the evening twilight.\nAhavat Olam: With everlasting love You have loved the house of Israel, Your people; Torah and commandments, statutes and judgments You have taught us. Therefore, LORD our God, when we lie down and when we rise up we will speak of Your statutes and rejoice in the words of Your Torah and in Your commandments forever, for they are our life and the length of our days, and we will meditate on them day and night. May Your love never depart from us. Blessed are You, LORD, Who loves His people Israel.",
        "notes": "May include occasional responsive readings or English explanations."
      }
    },
    {
      "id": "shema",
      "name_en": "Shema",
      "name_he": "שְׁמַע",
      "summary": "Core declaration of faith including all three traditional paragraphs.",
      "details": {
        "background": "Recited fully, adhering to traditional practice (covering eyes for first line, etc.). Considered a central mitzvah.",
        "full_text_he": "שְׁמַע יִשְׂרָאֵל יְיָ אֱלֹהֵינוּ יְיָ אֶחָד. וְאָהַבְתָּ אֵת יְיָ אֱלֹהֶיךָ בְּכָל לְבָבְךָ וּבְכָל נַפְשְׁךָ וּבְכָל מְאֹדֶךָ. וְהָיוּ הַדְּבָרִים הָאֵלֶּה אֲשֶׁר אָנֹכִי מְצַוְּךָ הַיּוֹם עַל לְבָבֶךָ. וְשִׁנַּנְתָּם לְבָנֶיךָ וְדִבַּרְתָּ בָּם בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ. וּקְשַׁרְתָּם לְאוֹת עַל יָדֶךָ וְהָיוּ לְטֹטָפֹת בֵּין עֵינֶיךָ. וּכְתַבְתָּם עַל מְזוּזֹת בֵּיתֶךָ וּבִשְׁעָרֶיךָ.\nוְהָיָה אִם שָׁמֹעַ תִּשְׁמְעוּ אֶל מִצְוֹתַי אֲשֶׁר אָנֹכִי מְצַוֶּה אֶתְכֶם הַיּוֹם לְאַהֲבָה אֶת יְיָ אֱלֹהֵיכֶם וּלְעָבְדוֹ בְּכָל לְבַבְכֶם וּבְכָל נַפְשְׁכֶם. וְנָתַתִּי מְטַר אַרְצְכֶם בְּעִתּוֹ יוֹרֶה וּמַלְקוֹשׁ וְאָסַפְתָּ דְגָנֶךָ וְתִירֹשְׁךָ וְיִצְהָרֶךָ. וְנָתַתִּי עֵשֶׂב בְּשָׂדְךָ לִבְהֶמְתֶּךָ וְאָכַלְתָּ וְשָׂבָעְתָּ. הִשָּׁמְרוּ לָכֶם פֶּן יִפְתֶּה לְבַבְכֶם וְסַרְתֶּם וַעֲבַדְתֶּם אֱלֹהִים אֲחֵרִים וְהִשְׁתַּחֲוִיתֶם לָהֶם. וְחָרָה אַף יְיָ בָּכֶם וְעָצַר אֶת הַשָּׁמַיִם וְלֹא יִהְיֶה מָטָר וְהָאֲדָמָה לֹא תִתֵּן אֶת יְבוּלָהּ. וַאֲבַדְתֶּם מְהֵרָה מֵעַל הָאָרֶץ הַטֹּבָה אֲשֶׁר יְיָ נֹתֵן לָכֶם. וְשַׂמְתֶּם אֶת דְּבָרַי אֵלֶּה עַל לְבַבְכֶם וְעַל נַפְשְׁכֶם וּקְשַׁרְתֶּם אֹתָם לְאוֹת עַל יֶדְכֶם וְהָיוּ לְטוֹטָפֹת בֵּין עֵינֵיכֶם. וְלִמַּדְתֶּם אֹתָם אֶת בְּנֵיכֶם לְדַבֵּר בָּם בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ. וּכְתַבְתָּם עַל מְזוּזוֹת בֵּיתֶךָ וּבִשְׁעָרֶיךָ. לְמַעַן יִרְבּוּ יְמֵיכֶם וִימֵי בְנֵיכֶם עַל הָאֲדָמָה אֲשֶׁר נִשְׁבַּע יְיָ לַאֲבֹתֵיכֶם לָתֵת לָהֶם כִּימֵי הַשָּׁמַיִם עַל הָאָרֶץ.\nוַיֹּאמֶר יְיָ אֶל מֹשֶׁה לֵּאמֹר. דַּבֵּר אֶל בְּנֵי יִשְׂרָאֵל וְאָמַרְתָּ אֲלֵהֶם וְעָשׂוּ לָהֶם צִיצִת עַל כַּנְפֵי בִגְדֵיהֶם לְדֹרֹתָם וְנָתְנוּ עַל צִיצִת הַכָּנָף פְּתִיל תְּכֵלֶת. וְהָיָה לָכֶם לְצִיצִת וּרְאִיתֶם אֹתוֹ וּזְכַרְתֶּם אֶת כָּל מִצְוֹת יְיָ וַעֲשִׂיתֶם אֹתָם וְלֹא תָתוּרוּ אַחֲרֵי לְבַבְכֶם וְאַחֲרֵי עֵינֵיכֶם אֲשֶׁר אַתֶּם זֹנִים אַחֲרֵיהֶם. לְמַעַן תִּזְכְּרוּ וַעֲשִׂיתֶם אֶת כָּל מִצְוֹתָי וִהְיִיתֶם קְדֹשִׁים לֵאלֹהֵיכֶם. אֲנִי יְיָ אֱלֹהֵיכֶם אֲשֶׁר הוֹצֵאתִי אֶתְכֶם מֵאֶרֶץ מִצְרַיִם לִהְיוֹת לָכֶם לֵאלֹהִים אֲנִי יְיָ אֱלֹהֵיכֶם.",
        "full_text_en_translit": "Sh'ma Yisrael Adonai Eloheinu Adonai Echad. V'ahavta et Adonai Elohecha b'chol l'vavcha uv'chol nafsh'cha uv'chol m'odecha. V'hayu had'varim ha'eileh asher anochi m'tzav'cha hayom al l'vavecha. V'shinantam l'vanecha v'dibarta bam b'shivt'cha b'veitecha uv'lecht'cha vaderech uv'shachb'cha uv'kumecha. Uk'shartam l'ot al yadecha v'hayu l'totafot bein einecha. Uchtavtam al m'zuzot beitecha uvisharecha.\nV'haya im shamo'a tishm'u el mitzvotai asher anochi m'tzaveh etchem hayom l'ahavah et Adonai Elohechem ul'avdo b'chol l'vavchem uv'chol nafsh'chem. V'natati m'tar artz'chem b'ito yoreh umalkosh v'asafta d'ganecha v'tirosh'cha v'yitzharecha. V'natati eisev b'sadcha livhemtecha v'achalta v'savata. Hishamru lachem pen yifteh l'vavchem v'sartem va'avadtem elohim acheirim v'hishtachavitem lahem. V'charah af Adonai bachem v'atzar et hashamayim v'lo yihyeh matar v'ha'adamah lo titein et y'vulah. Va'avadtem m'heirah mei'al ha'aretz hatovah asher Adonai notein lachem. V'samtem et d'varai eileh al l'vavchem v'al nafsh'chem uk'shartem otam l'ot al yedchem v'hayu l'totafot bein eineichem. V'limad'tem otam et b'neichem l'dabeir bam b'shivt'cha b'veitecha uv'lecht'cha vaderech uv'shachb'cha uv'kumecha. Uchtavtam al m'zuzot beitecha uvisharecha. L'maan yirbu y'meichem viymei v'neichem al ha'adamah asher nishba Adonai la'avoteichem latet lahem kiymei hashamayim al ha'aretz.\nVayomer Adonai el Moshe leimor. Dabeir el b'nei Yisrael v'amarta aleihem v'asu lahem tzitzit al kanfei vigdeihem l'dorotam v'natnu al tzitzit hakanaf p'til t'cheilet. V'haya lachem l'tzitzit ur'item oto uz'chartem et kol mitzvot Adonai va'asitem otam v'lo taturu acharei l'vavchem v'acharei eineichem asher atem zonim achareihem. L'maan tizk'ru va'asitem et kol mitzvotai vih'yitem k'doshim l'Eloheichem. Ani Adonai Eloheichem asher hotzeiti etchem mei'eretz Mitzrayim lih'yot lachem l'Elohim ani Adonai Eloheichem.",
        "full_text_en_translate": "Hear, O Israel: the LORD our God, the LORD is One. You shall love the LORD your God with all your heart, with all your soul, and with all your might. And these words which I command you today shall be upon your heart. You shall teach them diligently to your children, and shall speak of them when you sit in your house, when you walk by the way, when you lie down, and when you rise up. You shall bind them as a sign upon your hand, and they shall be as frontlets between your eyes. You shall write them on the doorposts of your house and on your gates.\nAnd it shall come to pass, if you listen diligently to My commandments which I command you today, to love the LORD your God and to serve Him with all your heart and with all your soul, that I will give the rain of your land in its season, the early rain and the late rain, that you may gather in your grain, your wine, and your oil. And I will give grass in your fields for your cattle, and you shall eat and be satisfied. Take heed lest your heart be deceived, and you turn aside and serve other gods and worship them. Then the anger of the LORD will be kindled against you, and He will shut up the heavens so that there will be no rain, and the land will not yield its fruit, and you will perish quickly from off the good land which the LORD gives you. Therefore you shall lay up these words of Mine in your heart and in your soul, and you shall bind them as a sign upon your hand, and they shall be as frontlets between your eyes. You shall teach them to your children, speaking of them when you sit in your house, when you walk by the way, when you lie down, and when you rise up. And you shall write them upon the doorposts of your house and upon your gates, that your days and the days of your children may be multiplied upon the land which the LORD swore to your fathers to give them, as long as the heavens are above the earth.\nThe LORD said to Moses, saying: Speak to the children of Israel, and bid them that they make fringes on the corners of their garments throughout their generations, and that they put upon the fringe of each corner a thread of blue. And it shall be to you for a fringe, that you may look upon it and remember all the commandments of the LORD and do them, and that you not follow after your own heart and your own eyes, after which you are inclined to go astray. So that you may remember and do all My commandments, and be holy to your God. I am the LORD your God, who brought you out of the land of Egypt to be your God: I am the LORD your God.",
        "notes": "Congregants traditionally cover their eyes during the first verse (Deut. 6:4)."
      }
    },
    {
      "id": "shema_blessings_after",
      "name_en": "Blessings After Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Two blessings: affirming God's redemption (Emet V'Emunah) and seeking protection (Hashkiveinu).",
      "details": {
        "background": "Traditional Hebrew texts are used, affirming the reliability of God's promise of redemption and praying for peaceful rest under divine protection.",
        "full_text_he": "אֱמֶת וְאֱמוּנָה: אֱמֶת וְיַצִּיב וְנָכוֹן וְקַיָּם וְיָשָׁר וְנֶאֱמָן וְטוֹב וְיָפֶה הַדָּבָר הַזֶּה עָלֵינוּ לְעוֹלָם וָעֶד. אֱמֶת, אֱלֹהֵי עוֹלָם מַלְכֵּנוּ, צוּר יַעֲקֹב מָגֵן יִשְׁעֵנוּ, לְדֹר וָדֹר הוּא קַיָּם וּשְׁמוֹ קַיָּם וְכִסְאוֹ נָכוֹן, וּמַלְכוּתוֹ וֶאֱמוּנָתוֹ לָעַד קַיָּמֶת. וּדְבָרָיו חָיִים וְקַיָּמִים, נֶאֱמָנִים וְנֶחֱמָדִים לָעַד וּלְעוֹלְמֵי עוֹלָמִים. עַל אֲבוֹתֵינוּ וְעָלֵינוּ, עַל בָּנֵינוּ וְעַל דּוֹרוֹתֵינוּ, וְעַל כָּל דּוֹרוֹת זֶרַע יִשְׂרָאֵל עֲבָדֶיךָ. עַל הָרִאשׁוֹנִים וְעַל הָאַחֲרוֹנִים, דָּבָר טוֹב וְקַיָּם לְעוֹלָם וָעֶד, אֱמֶת וֶאֱמוּנָה, חֹק וְלֹא יַעֲבֹר. אֱמֶת, שָׁאַתָּה הוּא יְיָ אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, מַלְכֵּנוּ מֶלֶךְ אֲבוֹתֵינוּ, גּוֹאֲלֵנוּ גּוֹאֵל אֲבוֹתֵינוּ, יוֹצְרֵנוּ צוּר יְשׁוּעָתֵנוּ, פּוֹדֵנוּ וּמַצִּילֵנוּ מֵעוֹלָם שְׁמֶךָ, אֵין אֱלֹהִים זוּלָתֶךָ.\nהַשְׁכִּיבֵנוּ: הַשְׁכִּיבֵנוּ יְיָ אֱלֹהֵינוּ לְשָׁלוֹם, וְהַעֲמִידֵנוּ מַלְכֵּנוּ לְחַיִּים, וּפְרוֹשׂ עָלֵינוּ סֻכַּת שְׁלוֹמֶךָ, וְתַקְּנֵנוּ בְּעֵצָה טוֹבָה מִלְּפָנֶיךָ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ. וְהָגֵן בַּעֲדֵנוּ, וְהָסֵר מֵעָלֵינוּ אוֹיֵב, דֶּבֶר וְחֶרֶב וְרָעָב וְיָגוֹן, וְהָסֵר שָׂטָן מִלְּפָנֵינוּ וּמֵאַחֲרֵינוּ, וּבְצֵל כְּנָפֶיךָ תַּסְתִּירֵנוּ, כִּי אֵל שׁוֹמְרֵנוּ וּמַצִּילֵנוּ אָתָּה, כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם אָתָּה. וּשְׁמוֹר צֵאתֵנוּ וּבוֹאֵנוּ לְחַיִּים וּלְשָׁלוֹם מֵעַתָּה וְעַד עוֹלָם. בָּרוּךְ אַתָּה יְיָ, שׁוֹמֵר עַמּוֹ יִשְׂרָאֵל לָעַד.",
        "full_text_en_translit": "Emet V'Emunah: Emet v'yatziv v'nachon v'kayam v'yashar v'ne'eman v'tov v'yafeh hadavar hazeh aleinu l'olam va'ed. Emet, Elohei olam Malkeinu, Tzur Yaakov magen yisheinu, l'dor vador hu kayam ushmo kayam v'chiso nachon, umalchuto v'emunato la'ad kayamet. Udvarav chayim v'kayamim, ne'emanim v'nechmadim la'ad ul'olmei olamim. Al avoteinu v'aleinu, al baneinu v'al doroteinu, v'al kol dorot zera Yisrael avadecha. Al harishonim v'al ha'acharonim, davar tov v'kayam l'olam va'ed, emet v'emunah, chok v'lo ya'avor. Emet, she'atah hu Adonai Eloheinu v'Elohei avoteinu, Malkeinu melech avoteinu, goaleinu goel avoteinu, yotzeinu tzur yisheinu, podeinu umatzileinu mei'olam shimcha, ein Elohim zulatecha.\nHashkiveinu: Hashkiveinu Adonai Eloheinu l'shalom, v'ha'amideinu Malkeinu l'chayim, ufros aleinu sukat sh'lomecha, v'takneinu b'eitzah tovah mil'fanecha, v'hoshieinu l'maan shimcha. V'hagein ba'adeinu, v'haseir mei'aleinu oyeiv, dever v'cherev v'ra'av v'yagon, v'haseir satan mil'faneinu umei'achareinu, uv'tzeil k'nafecha tastireinu, ki El shomreinu umatzileinu atah, ki El melech chanun v'rachum atah. Ushmor tzeiteinu uvo'einu l'chayim ul'shalom mei'atah v'ad olam. Baruch atah Adonai, shomeir amo Yisrael la'ad.",
        "full_text_en_translate": "Emet V'Emunah: True and certain, established and enduring, right and trustworthy, good and beautiful is this word for us forever and ever. True, the eternal God is our King, the Rock of Jacob, the Shield of our salvation, from generation to generation He endures and His Name endures, His throne is established, and His kingship and faithfulness endure forever. His words are living and enduring, faithful and precious forever and for all eternity. For our ancestors and for us, for our children and for our generations, and for all the generations of the seed of Israel Your servants. For the first and for the last, a good and enduring word forever and ever, true and faithful, a statute that will not pass. True, that You are the LORD our God and the God of our ancestors, our King, the King of our ancestors, our Redeemer, the Redeemer of our ancestors, our Creator, the Rock of our salvation, our Deliverer and Rescuer from eternity is Your Name; there is no God besides You.\nHashkiveinu: Cause us to lie down, LORD our God, in peace, and raise us up, our King, to life. Spread over us the shelter of Your peace, guide us with Your good counsel, and save us for Your Name's sake. Shield us, and remove from us enemy, pestilence, sword, famine, and sorrow. Remove the adversary from before us and from behind us, and shelter us in the shadow of Your wings, for You are God, our Guardian and Deliverer; You are God, a gracious and merciful King. Guard our going out and our coming in for life and for peace from now and forever. Blessed are You, LORD, who guards His people Israel forever.",
        "notes": "Hashkiveinu includes a prayer for protection during the night."
      }
    },
    {
      "id": "amidah",
      "name_en": "Amidah (Shemoneh Esrei)",
      "name_he": "עֲמִידָה (שְׁמוֹנֶה עֶשְׂרֵה)",
      "summary": "Central standing prayer (7 blessings for Shabbat), recited silently then potentially repeated by leader.",
      "details": {
        "background": "Follows the traditional structure. Silent recitation is primary. Conservative siddurim typically offer options for including the Matriarchs (Imahot) alongside the Patriarchs (Avot) in the first blessing. The leader's repetition (Chazarat HaShatz) may include Kedusha.",
        "full_text_he": "אֱלֹהֵי אַבְרָהָם, אֱלֹהֵי יִצְחָק, וֵאלֹהֵי יַעֲקֹב, אֱלֹהֵי שָׂרָה, אֱלֹהֵי רִבְקָה, אֱלֹהֵי רָחֵל, וֵאלֹהֵי לֵאָה. הָאֵל הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא, אֵל עֶלְיוֹן, גּוֹמֵל חֲסָדִים טוֹבִים, וְקוֹנֵה הַכֹּל, וְזוֹכֵר חַסְדֵי אָבוֹת, וּמֵבִיא גוֹאֵל לִבְנֵי בְנֵיהֶם לְמַעַן שְׁמוֹ בְּאַהֲבָה. מֶלֶךְ עוֹזֵר וּמוֹשִׁיעַ וּמָגֵן. בָּרוּךְ אַתָּה יְיָ, מָגֵן אַבְרָהָם וְעֶזְרַת שָׂרָה.\nאַתָּה גִּבּוֹר לְעוֹלָם יְיָ, מְחַיֵּה מֵתִים אַתָּה, רַב לְהוֹשִׁיעַ. מוֹרִיד הַטָּל. מְכַלְכֵּל חַיִּים בְּחֶסֶד, מְחַיֵּה מֵתִים בְּרַחֲמִים רַבִּים, סוֹמֵךְ נוֹפְלִים, וְרוֹפֵא חוֹלִים, וּמַתִּיר אֲסוּרִים, וּמְקַיֵּם אֱמוּנָתוֹ לִישֵׁנֵי עָפָר. מִי כָמוֹךָ בַּעַל גְּבוּרוֹת, וּמִי דוֹמֶה לָּךְ, מֶלֶךְ מֵמִית וּמְחַיֶּה וּמַצְמִיחַ יְשׁוּעָה. וְנֶאֱמָן אַתָּה לְהַחֲיוֹת מֵתִים. בָּרוּךְ אַתָּה יְיָ, מְחַיֵּה הַמֵּתִים.\nאַתָּה קָדוֹשׁ וְשִׁמְךָ קָדוֹשׁ, וּקְדוֹשִׁים בְּכָל יוֹם יְהַלְלוּךָ סֶּלָה. בָּרוּךְ אַתָּה יְיָ, הָאֵל הַקָּדוֹשׁ.\nאַתָּה בְחַרְתָּנוּ מִכָּל הָעַמִּים, אָהַבְתָּ אוֹתָנוּ וְרָצִיתָ בָּנוּ, וְרוֹמַמְתָּנוּ מִכָּל הַלְּשׁוֹנוֹת, וְקִדַּשְׁתָּנוּ בְּמִצְוֹתֶיךָ, וְקֵרַבְתָּנוּ מַלְכֵּנוּ לַעֲבוֹדָתֶךָ, וְשִׁמְךָ הַגָּדוֹל וְהַקָּדוֹשׁ עָלֵינוּ קָרָאתָ. וַתִּתֶּן לָנוּ יְיָ אֱלֹהֵינוּ בְּאַהֲבָה אֶת יוֹם הַשַּׁבָּת הַזֶּה, וְאֶת יוֹם טוֹב מִקְרָא קֹדֶשׁ הַזֶּה, זִכְרוֹן לְמַעֲשֵׂה בְרֵאשִׁית. כִּי הוּא יוֹם תְּחִלָּה לְמִקְרָאֵי קֹדֶשׁ, זֵכֶר לִיצִיאַת מִצְרָיִם. כִּי בָנוּ בָחַרְתָּ וְאוֹתָנוּ קִדַּשְׁתָּ מִכָּל הָעַמִּים, וְשַׁבַּת קָדְשְׁךָ בְּאַהֲבָה וּבְרָצוֹן הִנְחַלְתָּנוּ. בָּרוּךְ אַתָּה יְיָ, מְקַדֵּשׁ הַשַּׁבָּת.\nרְצֵה יְיָ אֱלֹהֵינוּ בְּעַמְּךָ יִשְׂרָאֵל, וְלִתְפִלָּתָם שְׁעֵה, וְהָשֵׁב אֶת הָעֲבוֹדָה לִדְבִיר בֵּיתֶךָ, וְאִשֵּׁי יִשְׂרָאֵל וּתְפִלָּתָם בְּאַהֲבָה תְקַבֵּל בְּרָצוֹן, וּתְהִי לְרָצוֹן תָּמִיד עֲבוֹדַת יִשְׂרָאֵל עַמֶּךָ. וְתֶחֱזֶינָה עֵינֵינוּ בְּשׁוּבְךָ לְצִיּוֹן בְּרַחֲמִים. בָּרוּךְ אַתָּה יְיָ, הַמַּחֲזִיר שְׁכִינָתוֹ לְצִיּוֹן.\nמוֹדִים אֲנַחְנוּ לָךְ, שָׁאַתָּה הוּא יְיָ אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ לְעוֹלָם וָעֶד. צוּר חַיֵּינוּ, מָגֵן יִשְׁעֵנוּ אַתָּה הוּא לְדֹר וָדֹר. נוֹדֶה לְּךָ וּנְסַפֵּר תְּהִלָּתֶךָ, עַל חַיֵּינוּ הַמְּסוּרִים בְּיָדֶיךָ, וְעַל נִשְׁמוֹתֵינוּ הַפְּקוּדוֹת לָךְ, וְעַל נִסֶּיךָ שֶׁבְּכָל יוֹם עִמָּנוּ, וְעַל נִפְלְאוֹתֶיךָ וְטוֹבוֹתֶיךָ שֶׁבְּכָל עֵת, עֶרֶב וָבֹקֶר וְצָהֳרָיִם. הַטּוֹב כִּי לֹא כָלוּ רַחֲמֶיךָ, וְהַמְרַחֵם כִּי לֹא תַמּוּ חֲסָדֶיךָ, כִּי מֵעוֹלָם קִוִּינוּ לָךְ. וְעַל כֻּלָּם יִתְבָּרַךְ וְיִתְרוֹמַם שִׁמְךָ מַלְכֵּנוּ תָּמִיד לְעוֹלָם וָעֶד. וְכֹל הַחַיִּים יוֹדוּךָ סֶּלָה, וִיהַלְלוּ אֶת שִׁמְךָ בֶּאֱמֶת, הָאֵל יְשׁוּעָתֵנוּ וְעֶזְרָתֵנוּ סֶלָה. בָּרוּךְ אַתָּה יְיָ, הַטּוֹב שִׁמְךָ וּלְךָ נָאֶה לְהוֹדוֹת.\nשִׂים שָׁלוֹם, טוֹבָה וּבְרָכָה, חֵן וָחֶסֶד וְרַחֲמִים, עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל עַמֶּךָ. בָּרְכֵנוּ אָבִינוּ כֻּלָּנוּ כְּאֶחָד בְּאוֹר פָּנֶיךָ, כִּי בְאוֹר פָּנֶיךָ נָתַתָּ לָּנוּ יְיָ אֱלֹהֵינוּ תּוֹרַת חַיִּים וְאַהֲבַת חֶסֶד, וּצְדָקָה וּבְרָכָה וְרַחֲמִים וְחַיִּים וְשָׁלוֹם. וְטוֹב בְּעֵינֶיךָ לְבָרֵךְ אֶת עַמְּךָ יִשְׂרָאֵל בְּכָל עֵת וּבְכָל שָׁעָה בִּשְׁלוֹמֶךָ. בָּרוּךְ אַתָּה יְיָ, הַמְבָרֵךְ אֶת עַמּוֹ יִשְׂרָאֵל בַּשָּׁלוֹם.",
        "full_text_en_translit": "Avot (with Imahot option): Elohei Avraham, Elohei Yitzchak, v'Elohei Yaakov, Elohei Sarah, Elohei Rivkah, Elohei Rachel, v'Elohei Leah. Ha'el hagadol hagibor v'hanora, El elyon, gomeil chasadim tovim, v'koneh hakol, v'zocheir chasdei avot, umeivi goel livnei veneihem l'maan shmo b'ahavah. Melech ozeir umoshia umagein. Baruch atah Adonai, magein Avraham v'ezrat Sarah.\nGevurot: Atah gibor l'olam Adonai, m'chayei meitim atah, rav l'hoshi'a. Morid hatal. M'chalkeil chayim b'chesed, m'chayei meitim b'rachamim rabim, someich noflim, v'rofei cholim, umatir asurim, um'kayem emunato liyshnei afar. Mi chamocha ba'al g'vurot, umi domeh lach, melech meimit um'chayeh umatzmi'ach yeshu'ah. V'ne'eman atah l'hachayot meitim. Baruch atah Adonai, m'chayei hameitim.\nKedushat Hashem: Atah kadosh v'shimcha kadosh, uk'doshim b'chol yom y'hal'lucha selah. Baruch atah Adonai, ha'el hakadosh.\nKedushat Hayom: Atah bachar'tanu mikol ha'amim, ahavta otanu v'ratzita banu, v'romam'tanu mikol l'shonot, v'kidash'tanu b'mitzvotecha, v'kerav'tanu Malkeinu la'avodatecha, v'shimcha hagadol v'hakadosh aleinu karata. Vatiten lanu Adonai Eloheinu b'ahavah et yom HaShabbat hazeh, v'et yom tov mikra kodesh hazeh, zikaron l'ma'aseih v'reishit. Ki hu yom t'chilah l'mikra'ei kodesh, zeicher litziat Mitzrayim. Ki vanu vacharta v'otanu kidashta mikol ha'amim, v'Shabbat kodsh'cha b'ahavah uv'ratzon hinchaltanu. Baruch atah Adonai, m'kadeish HaShabbat.\nAvodah: R'tzei Adonai Eloheinu b'amcha Yisrael, v'litfilatam sh'ei, v'hasheiv et ha'avodah lidvir beitecha, v'ishei Yisrael ut'filatam b'ahavah t'kabeil b'ratzon, ut'hi l'ratzon tamid avodat Yisrael amecha. V'techazeina eineinu b'shuv'cha l'Tziyon b'rachamim. Baruch atah Adonai, hamachazir sh'chinato l'Tziyon.\nHoda'ah: Modim anachnu lach, she'atah hu Adonai Eloheinu v'Elohei avoteinu l'olam va'ed. Tzur chayeinu, magein yisheinu atah hu l'dor vador. Nodeh l'cha un'sapeir t'hilatecha, al chayeinu ham'surim b'yadecha, v'al nishmoteinu hap'kudot lach, v'al nisecha sheb'chol yom imanu, v'al nifl'otecha v'tovotecha sheb'chol et, erev vavoker v'tzaharayim. Hatov ki lo chalu rachamecha, v'ham'racheim ki lo tamu chasadecha, ki mei'olam kivinu lach. V'al kulam yitbarach v'yitromam shimcha Malkeinu tamid l'olam va'ed. V'chol hachayim yoducha selah, v'y'hal'lu et shimcha b'emet, ha'El y'shuateinu v'ezrateinu selah. Baruch atah Adonai, hatov shimcha ul'cha na'eh l'hodot.\nSim Shalom: Sim shalom, tovah uv'rachah, chein vachesed v'rachamim, aleinu v'al kol Yisrael amecha. Barcheinu Avinu kulanu k'echad b'or panecha, ki b'or panecha natata lanu Adonai Eloheinu Torat chayim v'ahavat chesed, utz'dakah uv'rachah v'rachamim v'chayim v'shalom. V'tov b'einecha l'vareich et amcha Yisrael b'chol et uv'chol sha'ah bish'lomecha. Baruch atah Adonai, ham'vareich et amo Yisrael bashalom.",
        "full_text_en_translate": "Avot (with Imahot option): God of Abraham, God of Isaac, and God of Jacob, God of Sarah, God of Rebecca, God of Rachel, and God of Leah. The great, mighty, and awesome God, supreme God, who bestows lovingkindness, Creator of all, who remembers the loving deeds of the ancestors, and who brings a redeemer to their children's children for the sake of His Name, with love. Sovereign, Helper, Savior, and Shield. Blessed are You, LORD, Shield of Abraham and Helper of Sarah.\nGevurot: You are eternally mighty, LORD, You revive the dead, You are powerful to save. You make the dew fall. You sustain the living with lovingkindness, revive the dead with great mercy, support the falling, heal the sick, release the bound, and keep faith with those who sleep in the dust. Who is like You, Master of mighty deeds, and who resembles You, O King who causes death and restores life and makes salvation flourish? You are faithful to revive the dead. Blessed are You, LORD, who revives the dead.\nKedushat Hashem: You are holy and Your Name is holy, and holy beings praise You daily. Blessed are You, LORD, the holy God.\nKedushat Hayom: You have chosen us from all peoples, You have loved us and desired us, and exalted us above all tongues, and sanctified us with Your commandments, and brought us near, our King, to Your service, and called us by Your great and holy Name. And You have given us, LORD our God, with love this Sabbath day and this holy convocation, a remembrance of the work of creation. For it is the first among the holy convocations, a remembrance of the exodus from Egypt. For You have chosen us and sanctified us from all peoples, and have given us Your holy Sabbath with love and favor as an inheritance. Blessed are You, LORD, who sanctifies the Sabbath.\nAvodah: Be favorable, LORD our God, toward Your people Israel and their prayer, and restore the service to the inner sanctuary of Your House. Accept with love and favor the fire-offerings of Israel and their prayer, and may the service of Israel Your people always be favorable to You. And may our eyes behold Your return to Zion in mercy. Blessed are You, LORD, who restores His Presence to Zion.\nHoda'ah: We gratefully thank You, for You are the LORD our God and the God of our ancestors forever and ever. You are the Rock of our lives, the Shield of our salvation in every generation. We will thank You and recount Your praise for our lives which are committed into Your hand, for our souls which are entrusted to You, for Your miracles which are with us every day, and for Your wonders and favors at all times—evening, morning, and noon. The Beneficent One, for Your mercies never cease; the Merciful One, for Your lovingkindnesses never fail. Forever do we put our hope in You. For all these may Your Name be blessed and exalted, our King, continually forever and ever. Let every living being thank You and praise Your Name sincerely, O God, our salvation and help. Blessed are You, LORD, whose Name is Beneficent, and to whom it is fitting to give thanks.\nSim Shalom: Grant peace, goodness and blessing, grace, lovingkindness, and mercy to us and to all Israel Your people. Bless us, our Father, all of us as one, with the light of Your countenance, for by the light of Your countenance You have given us, LORD our God, the Torah of life and love of kindness, righteousness, blessing, mercy, life, and peace. May it be favorable in Your eyes to bless Your people Israel at all times and at every hour with Your peace. Blessed are You, LORD, who blesses His people Israel with peace.",
        "notes": "Inclusion of Matriarchs common. Some variation in concluding peace blessing (Sim Shalom/Shalom Rav). The leader's repetition may include the Kedusha (sanctification) if a minyan is present."
      }
    },
    {
      "id": "aleinu",
      "name_en": "Aleinu",
      "name_he": "עָלֵינוּ",
      "summary": "Concluding prayer praising God and looking towards universal redemption.",
      "details": {
        "background": "Standard concluding prayer, recited with traditional text.",
        "full_text_he": "עָלֵינוּ לְשַׁבֵּחַ לַאֲדוֹן הַכֹּל, לָתֵת גְּדֻלָּה לְיוֹצֵר בְּרֵאשִׁית, שֶׁלֹּא עָשָׂנוּ כְּגוֹיֵי הָאֲרָצוֹת, וְלֹא שָׂמָנוּ כְּמִשְׁפְּחוֹת הָאֲדָמָה, שֶׁלֹּא שָׂם חֶלְקֵנוּ כָּהֶם, וְגוֹרָלֵנוּ כְּכָל הֲמוֹנָם, שֶׁהֵם מִשְׁתַּחֲוִים לְהֶבֶל וָרִיק, וּמִתְפַּלְּלִים אֶל אֵל לֹא יוֹשִׁיעַ. וַאֲנַחְנוּ כּוֹרְעִים וּמִשְׁתַּחֲוִים וּמוֹדִים לִפְנֵי מֶלֶךְ מַלְכֵי הַמְּלָכִים הַקָּדוֹשׁ בָּרוּךְ הוּא, שֶׁהוּא נוֹטֶה שָׁמַיִם וְיֹסֵד אָרֶץ, וּמוֹשַׁב יְקָרוֹ בַּשָּׁמַיִם מִמַּעַל, וּשְׁכִינַת עֻזּוֹ בְּגָבְהֵי מְרוֹמִים. הוּא אֱלֹהֵינוּ, אֵין עוֹד, אֱמֶת מַלְכֵּנוּ, אֶפֶס זוּלָתוֹ. כַּכָּתוּב בְּתוֹרָתוֹ: וְיָדַעְתָּ הַיּוֹם וַהֲשֵׁבֹתָ אֶל לְבָבֶךָ, כִּי יְיָ הוּא הָאֱלֹהִים בַּשָּׁמַיִם מִמַּעַל וְעַל הָאָרֶץ מִתָּחַת, אֵין עוֹד. עַל כֵּן נְקַוֶּה לְךָ יְיָ אֱלֹהֵינוּ, לִרְאוֹת מְהֵרָה בְּתִפְאֶרֶת עֻזֶּךָ, לְהַעֲבִיר גִּלּוּלִים מִן הָאָרֶץ, וְהָאֱלִילִים כָּרוֹת יִכָּרֵתוּן, לְתַקֵּן עוֹלָם בְּמַלְכוּת שַׁדַּי, וְכָל בְּנֵי בָשָׂר יִקְרְאוּ בִשְׁמֶךָ, לְהַפְנוֹת אֵלֶיךָ כָּל רִשְׁעֵי אָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל יוֹשְׁבֵי תֵבֵל, כִּי לְךָ תִּכְרַע כָּל בֶּרֶךְ, תִּשָּׁבַע כָּל לָשׁוֹן. לְפָנֶיךָ יְיָ אֱלֹהֵינוּ יִכְרְעוּ וְיִפֹּלוּ, וְלִכְבוֹד שִׁמְךָ יְקָר יִתֵּנוּ, וְיִקְבְּלוּ כֻלָּם אֶת עֹל מַלְכוּתֶךָ, וְתִמְלֹךְ עֲלֵיהֶם מְהֵרָה לְעוֹלָם וָעֶד. כִּי הַמַּלְכוּת שֶׁלְּךָ הִיא, וּלְעוֹלְמֵי עַד תִּמְלֹךְ בְּכָבוֹד. כַּכָּתוּב בְּתוֹרָתֶךָ: יְיָ יִמְלֹךְ לְעוֹלָם וָעֶד. וְנֶאֱמַר: וְהָיָה יְיָ לְמֶלֶךְ עַל כָּל הָאָרֶץ, בַּיּוֹם הַהוּא יִהְיֶה יְיָ אֶחָד וּשְׁמוֹ אֶחָד.",
        "full_text_en_translit": "Aleinu l'shabei'ach la'Adon hakol, lateit g'dulah l'yotzeir b'reishit, shelo asanu k'goyei ha'aratzot, v'lo samanu k'mishp'chot ha'adamah, shelo sam chelkeinu kahem, v'goraleinu k'chol hamonam, shehem mishtachavim lahevel varik, umitpal'lim el el lo yoshia. Va'anachnu kor'im umishtachavim umodim lifnei Melech malchei ham'lachim hakadosh baruch Hu, shehu noteh shamayim v'yoseid aretz, umoshav y'karo bashamayim mim'al, ush'chinat uzo b'gavhei m'romim. Hu Eloheinu, ein od, emet Malkenu, efes zulato. Kakatuv b'Torato: V'yada'ta hayom vahasheivota el l'vavecha, ki Adonai Hu HaElohim bashamayim mim'al v'al ha'aretz mitachat, ein od. Al kein n'kaveh l'cha Adonai Eloheinu, lir'ot m'heirah b'tif'eret uzecha, l'ha'avir gilulim min ha'aretz, v'ha'elilim karot yikareitun, l'takein olam b'malchut Shaddai, v'chol b'nei basar yikr'u vishmecha, l'hafnot eilecha kol rish'ei aretz. Yakiru v'yed'u kol yoshvei teiveil, ki l'cha tichra kol bereich, tishava kol lashon. Lifanecha Adonai Eloheinu yichr'u v'yipolu, v'lichvod shimcha yekar yiteinu, v'yikb'lu kulam et ol malchutecha, v'timloch aleihem m'heirah l'olam va'ed. Ki hamalchut shel'cha hi, ul'olmei ad timloch b'chavod. Kakatuv b'Toratecha: Adonai yimloch l'olam va'ed. V'ne'emar: V'hayah Adonai l'Melech al kol ha'aretz, bayom hahu yih'yeh Adonai echad ushmo echad.",
        "full_text_en_translate": "It is our duty to praise the Master of all, to ascribe greatness to the Creator of the universe, for He has not made us like the nations of the lands, nor placed us like the families of the earth; for He has not assigned our portion like theirs, nor our lot like all their multitudes. For they bow to vanity and emptiness, and pray to a god who cannot save. But we bend the knee and bow and acknowledge before the supreme King of kings, the Holy One, blessed be He, who stretches out the heavens and establishes the earth, the seat of whose glory is in the heavens above, and the abode of whose might is in the loftiest heights. He is our God; there is none else. In truth, our King, there is nothing besides Him. As it is written in His Torah: You shall know this day and take to heart that the LORD is God in heaven above and on earth below; there is no other. Therefore we put our hope in You, LORD our God, that we may soon see Your mighty splendor, to remove detestable idolatry from the earth, and false gods will be utterly cut off, to perfect the world under the sovereignty of the Almighty. Then all humanity will call upon Your Name, to turn all the wicked of the earth to You. All the inhabitants of the world will recognize and know that to You every knee must bend, every tongue must swear. Before You, LORD our God, they will bend every knee and cast themselves down, and to the glory of Your Name they will render homage, and they will all accept upon themselves the yoke of Your kingdom, and You will reign over them speedily forever and ever. For the kingdom is Yours, and to all eternity You will reign in glory. As it is written in Your Torah: The LORD will reign forever and ever. And it is said: The LORD will be King over all the earth; on that day the LORD will be One and His Name One.",
        "notes": "Traditionally recited while bowing slightly at certain phrases."
      }
    },
    {
      "id": "kaddish",
      "name_en": "Mourner's Kaddish",
      "name_he": "קַדִּישׁ יָתוֹם",
      "summary": "Prayer of praise recited by mourners.",
      "details": {
        "background": "Recited near the end if mourners are present and a Minyan exists.",
        "full_text_he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. בְּעָלְמָא דִּי בְרָא כִרְעוּתֵהּ, וְיַמְלִיךְ מַלְכוּתֵהּ, וְיַצְמַח פּוּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן.\nיְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא.\nיִתְבָּרַךְ וְיִשְׁתַּבַּח, וְיִתְפָּאַר וְיִתְרוֹמַם, וְיִתְנַשֵּׂא וְיִתְהַדָּר, וְיִתְעַלֶּה וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא בְּרִיךְ הוּא. לְעֵלָּא מִן כָּל בִּרְכָתָא וְשִׁירָתָא, תֻּשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן.\nיְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא, וְחַיִּים, עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל, וְאִמְרוּ אָמֵן.\nעוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו, הוּא יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל, וְאִמְרוּ אָמֵן.",
        "full_text_en_translit": "Yitgadal v'yitkadash sh'mei raba. B'alma di v'ra chirutei, v'yamlich malchutei, v'yatzmach purkanei, vikareiv M'shichei. B'chayeichon uv'yomeichon uv'chayei d'chol beit Yisrael, ba'agala uvizman kariv, v'imru amen.\nY'hei sh'mei raba m'varach l'alam ul'almei almaya.\nYitbarach v'yishtabach, v'yitpa'ar v'yitromam, v'yitnasei v'yithadar, v'yit'aleh v'yithalal sh'mei d'kudsha b'rich Hu. L'eila min kol birchata v'shirata, tushb'chata v'nechemata, da'amiran b'alma, v'imru amen.\nY'hei shlama raba min sh'maya, v'chayim, aleinu v'al kol Yisrael, v'imru amen.\nOseh shalom bimromav, hu ya'aseh shalom aleinu v'al kol Yisrael, v'imru amen.",
        "full_text_en_translate": "Magnified and sanctified may His great Name be, in the world that He created according to His will. May He establish His kingdom, may He cause His salvation to sprout, and may He bring near His Messiah. In your lifetimes and in your days and in the lifetimes of all the House of Israel, speedily and soon, and say: Amen.\nMay His great Name be blessed forever and ever.\nBlessed and praised, glorified and exalted, extolled and honored, magnified and lauded be the Name of the Holy One, blessed be He. Beyond all the blessings and hymns, praises and consolations that are uttered in the world, and say: Amen.\nMay there be abundant peace from heaven, and life, for us and for all Israel, and say: Amen.\nHe who makes peace in His heights, may He make peace for us and for all Israel, and say: Amen.",
        "notes": "Traditionally recited by mourners and those observing a yahrzeit. Requires a minyan."
      }
    },
    {
      "id": "closing_hymn_kiddush",
      "name_en": "Closing Hymn / Kiddush",
      "name_he": "שִׁיר סִיּוּם / קִדּוּשׁ",
      "summary": "Often concludes with Adon Olam or Yigdal. Kiddush typically follows the service.",
      "details": {
        "background": "Traditional hymns like Adon Olam or Yigdal are common closings. Kiddush over wine is usually recited after the service concludes, leading into fellowship (Oneg Shabbat).",
        "full_text_he": "אֲדוֹן עוֹלָם אֲשֶׁר מָלַךְ, בְּטֶרֶם כָּל יְצִיר נִבְרָא. לְעֵת נַעֲשָׂה בְחֶפְצוֹ כֹּל, אֲזַי מֶלֶךְ שְׁמוֹ נִקְרָא. וְאַחֲרֵי כִּכְלוֹת הַכֹּל, לְבַדּוֹ יִמְלוֹךְ נוֹרָא. וְהוּא הָיָה וְהוּא הֹוֶה, וְהוּא יִהְיֶה בְּתִפְאָרָה.\n(Or יִגְדַּל אֱלֹהִים חַי וְיִשְׁתַּבַּח, נִמְצָא וְאֵין עֵת אֶל מְצִיאוּתוֹ...)\n\nקִדּוּשׁ: בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הַגָּפֶן...",
        "full_text_en_translit": "Adon Olam asher malach, b'terem kol y'tzir nivra. L'eit na'asah b'cheftzo kol, azai Melech sh'mo nikra. V'acharei kichlot hakol, l'vado yimloch nora. V'hu haya v'hu hoveh, v'hu yih'yeh b'tif'arah.\n(Or Yigdal Elohim chai v'yishtabach, nimtza v'ein eit el m'tziuto...)\n\nKiddush: Baruch atah Adonai Eloheinu Melech ha'olam, borei p'ri hagafen...",
        "full_text_en_translate": "Master of the universe who reigned before any creature was created. When all was made by His will, then was His name proclaimed as King. And after all has ceased to be, the Awesome One alone shall reign. He was, He is, and He shall be in glory.\n(Or: Exalted be the living God and praised, He exists beyond all time...)\n\nKiddush: Blessed are You, LORD our God, King of the universe, who creates the fruit of the vine...",
        "notes": "Adon Olam or Yigdal melodies vary. Kiddush is often recited communally if the service is followed by an Oneg Shabbat."
      }
    }
  ]
}