{
  "traditionName": "Temple Emanuel (Apr 4, 2025)",
  "serviceOrder": [
    {
      "id": "opening_music",
      "name_en": "Opening Music & Song",
      "name_he": "",
      "timestamp": "00:14",
      "summary": "Service begins with introductory music and congregational singing.",
      "details": {
        "background": "Setting the spiritual tone and unifying the congregation through shared song before formal prayers begin.",
        "transcript_notes": "Features the theme 'When we sing, we pray twice... when we sing, we are one.'",
        "notes": "Music plays a prominent role throughout this specific service."
      }
    },
    {
      "id": "welcome_intro_announce",
      "name_en": "Welcome, Introductions & Announcements",
      "name_he": "בְּרוּכִים הַבָּאִים",
      "timestamp": "02:15",
      "summary": "Clergy welcome the congregation, introduce themselves and special guests/musicians, honor Rabbi Black's upcoming retirement, and provide housekeeping announcements.",
      "details": {
        "background": "Standard service opening to orient attendees, acknowledge special occasions, and provide logistical information.",
        "transcript_notes": "Led by Rabbi Joe Black, Rabbi Emily Hyatt, Cantor Liz Sacks, Steve Brodsky. Mentions High Holy Day choir members, accompanist Ken Murvine, string section (Angie, Sandre), Chris (drums), Michael (bass). Special welcome to guest Beth Schaefer. Announcements cover phones, restrooms (including accessible/all-gender), emergency exits, and acknowledging online viewers.",
        "notes": "Emphasis on honoring Rabbi Black sets a theme for the evening."
      }
    },
    {
      "id": "intro_to_singing_and_lights",
      "name_en": "Introduction to Singing & Candle Lighting",
      "name_he": "",
      "timestamp": "05:02",
      "summary": "Connecting music and prayer as the central theme for honoring Rabbi Black's legacy, leading into the candle lighting.",
      "details": {
        "background": "Transitioning from welcome to the first ritual act, linking the evening's theme to the lighting.",
        "transcript_notes": "Rabbi Hyatt quotes Talmud: 'Where there is music, there is prayer.' Introduces Brea Bates (Bat Mitzvah candidate) and her family for candle lighting."
      }
    },
    {
      "id": "candle_lighting",
      "name_en": "Shabbat Candle Lighting",
      "name_he": "הַדְלָקַת נֵרוֹת",
      "timestamp": "06:00",
      "summary": "Kindling the Shabbat lights, accompanied by music and the traditional blessing.",
      "details": {
        "background": "The ritual act marking the formal beginning of Shabbat.",
        "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר שֶׁל שַׁבָּת.",
        "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu l'hadlik ner shel Shabbat.",
        "full_text_en_translate": "Blessed are You, LORD our God, King of the universe, Who has sanctified us with His commandments and commanded us to kindle the light of Shabbat.",
        "transcript_notes": "Performed by Brea Bates and family. Includes musical accompaniment before and after the blessing (approx 06:21 - 08:15)."
      }
    },
     {
      "id": "board_installation_intro",
      "name_en": "Introduction to Board Installation",
      "name_he": "",
      "timestamp": "08:30",
      "summary": "Transition to installing the new Board of Trustees, highlighting lay leadership.",
      "details": {
        "background": "Specific to this synagogue's annual meeting cycle, integrating governance transition into the Shabbat service.",
        "transcript_notes": "Led by Rabbi Hyatt, introducing Board President Wendy Nekritz."
      }
    },
     {
      "id": "board_installation_ceremony",
      "name_en": "Board of Trustees Installation",
      "name_he": "הַתקָנַת הַוַעַד",
      "timestamp": "09:05",
      "summary": "Formal installation ceremony for the 2025 Board of Trustees, including responsive readings and blessings.",
      "details": {
        "background": "A ritual recognizing and empowering lay leaders for their communal responsibilities.",
        "transcript_notes": "Wendy Nekritz welcomes attendees and speaks on the transition and Rabbi Black's legacy. Board members invited up. Responsive readings emphasize community history, vision, partnership. Blessing includes themes of light/inspiration from Shabbat candles. Concludes with Priestly Blessing melody/themes (approx 13:01 - 14:50) and 'Mazel Tov'."
      }
    },
     {
      "id": "transition_to_kabbalat_shabbat",
      "name_en": "Transition to Kabbalat Shabbat",
      "name_he": "",
      "timestamp": "15:20",
      "summary": "Transitioning into the formal Kabbalat Shabbat prayers and welcoming the day of rest.",
      "details": {
        "transcript_notes": "Brief remarks inviting congregants to take a deep breath and prepare to sing."
      }
    },
    {
      "id": "kabbalat_shabbat_music",
      "name_en": "Kabbalat Shabbat Music",
      "name_he": "מוּסִיקָה - קַבָּלַת שַׁבָּת",
      "timestamp": "15:55",
      "summary": "Musical introduction to the Kabbalat Shabbat prayers.",
      "details": {
        "background": "Setting the mood for welcoming Shabbat with instrumental or vocal music.",
        "transcript_notes": "Instrumental and vocal music leading into Lecha Dodi (approx 15:55 - 18:16)."
      }
    },
    {
      "id": "lecha_dodi_ritual",
      "name_en": "Lecha Dodi Ritual",
      "name_he": "לְכָה דוֹדִי",
      "timestamp": "18:16",
      "summary": "Congregation rises and turns to welcome the Shabbat spirit, often accompanied by singing Lecha Dodi.",
      "details": {
        "background": "The traditional ritual of physically turning to greet Shabbat, personified as a bride or queen.",
        "transcript_notes": "Instruction to rise and face the entrance. Musical accompaniment and likely singing of Lecha Dodi (approx 18:16 - 19:23)."
      }
    },
     {
      "id": "barchu",
      "name_en": "Call to Prayer (Bar'chu)",
      "name_he": "בָּרְכוּ",
      "timestamp": "19:50",
      "summary": "The formal call to prayer initiating the Ma'ariv (Evening) service.",
      "details": {
        "background": "Standard liturgical element requiring a Minyan.",
        "full_text_he": "(Leader:) בָּרְכוּ אֶת יְיָ הַמְּבֹרָךְ.\n(Cong & Leader:) בָּרוּךְ יְיָ הַמְּבֹרָךְ לְעוֹלָם וָעֶד.",
        "full_text_en_translit": "(Leader:) Bor'chu et Adonai ha'm'vorach.\n(Cong & Leader:) Baruch Adonai ha'm'vorach l'olam va'ed.",
        "full_text_en_translate": "(Leader:) Bless the LORD who is to be blessed.\n(Cong & Leader:) Blessed is the LORD who is to be blessed forever and ever.",
         "transcript_notes": "Preceded and followed by musical elements (approx 19:23 - 21:48)."
      }
    },
    {
        "id": "shema_and_blessings",
        "name_en": "Shema and its Blessings",
        "name_he": "קְרִיאַת שְׁמַע וּבִרְכוֹתֶיהָ",
        "timestamp": "21:48",
        "summary": "Includes introductory song, blessings before Shema, the Shema itself, and blessings after.",
        "details": {
            "background": "The core declaration of faith framed by blessings about creation, revelation, and redemption.",
            "transcript_notes": "Begins with song 'Open up our eyes...' (21:48). Likely includes Ma'ariv Aravim/Ahavat Olam (themes before Shema). Shema recited (22:54). Followed by themes of Emet V'Emunah/Hashkiveinu (themes after Shema, leading into redemption song approx 25:15).",
             "full_text_he": "(Shema:) שְׁמַע יִשְׂרָאֵל, יְיָ אֱלֹהֵינוּ, יְיָ אֶחָד.",
             "full_text_en_translit": "(Shema:) Sh'ma Yisrael, Adonai Eloheinu, Adonai Echad.",
             "full_text_en_translate": "(Shema:) Hear, O Israel: the LORD is our God, the LORD is One."
        }
    },
    {
        "id": "redemption_reading_song",
        "name_en": "Redemption Reading & Song",
        "name_he": "",
        "timestamp": "25:28",
        "summary": "A reading about collective action followed by the song 'The River is Wide'.",
        "details": {
            "background": "Often themes of redemption (Mi Chamocha) are expressed through readings or songs following the Shema.",
            "transcript_notes": "Reading: 'Standing on the parted shores... no way to get from here to there except by joining hands...' Leads into song 'The River is Wide' (about overcoming fear/division). (Approx 25:28 - 29:49)."
        }
    },
     {
        "id": "amidah_intro",
        "name_en": "Introduction to Amidah",
        "name_he": "",
        "timestamp": "29:49",
        "summary": "Instruction to rise for the Tefillah/Amidah.",
        "details": {
            "transcript_notes": "Reading: 'Pray as if everything depended on God. Act as if everything depended on you.' Instruction to rise."
        }
    },
    {
        "id": "amidah",
        "name_en": "Amidah / Tefillah",
        "name_he": "עֲמִידָה / תְּפִלָּה",
        "timestamp": "30:05",
        "summary": "The Standing Prayer, likely including communal singing of traditional sections.",
        "details": {
            "background": "The central prayer of the service. On Shabbat, focuses on the day's sanctity.",
            "transcript_notes": "Begins with chanting 'Adonai S'fatai Tiftach' (Open my lips). Likely includes communal singing/chanting of Avot (Ancestors), Gevurot (God's Might), and Kedushah (Holiness) sections (approx 30:05 - 33:50)."
        }
    },
     {
        "id": "prayers_for_needs_intro",
        "name_en": "Introduction to Prayers for Needs",
        "name_he": "",
        "timestamp": "33:50",
        "summary": "Transition explaining the turn towards prayers for the imperfect world, country, Israel, and healing.",
        "details": {
            "background": "Acknowledging communal and global concerns within the prayer service.",
            "transcript_notes": "Rabbi Hyatt speaks on praying for hope and healing in a 'cracked and broken' world."
        }
    },
     {
        "id": "prayer_for_usa",
        "name_en": "Prayer for the USA",
        "name_he": "",
        "timestamp": "35:01",
        "summary": "Communal prayer for the well-being of the United States and its leaders.",
        "details": {
            "background": "A common practice in American synagogues.",
             "transcript_notes": "Includes text 'Bless the United States of America... may all our disagreements be for the greater good...'"
        }
    },
    {
        "id": "prayer_for_israel",
        "name_en": "Prayer for the State of Israel",
        "name_he": "תְּפִלָּה לִשְׁלוֹם הַמְּדִינָה",
        "timestamp": "35:35",
        "summary": "Communal prayer for the peace and security of the State of Israel.",
        "details": {
            "background": "Expressing connection and concern for the State of Israel.",
            "transcript_notes": "Includes text 'Bless the state of Israel... Shield it beneath the wings of your love... Establish peace in the land...'"
        }
    },
    {
        "id": "hostage_prayer_song",
        "name_en": "Prayer/Song for Hostages",
        "name_he": "",
        "timestamp": "36:30",
        "summary": "A specific musical prayer focusing on those held captive in Gaza.",
        "details": {
            "background": "Reflecting immediate communal concerns regarding the situation in Israel/Gaza.",
            "transcript_notes": "Introduced as a special prayer sung since hostages were taken. Song lyrics include 'Lift me and carry me... Redeem me... I cry from the depths...' (approx 37:01 - 38:14)."
        }
    },
    {
        "id": "healing_prayer",
        "name_en": "Mi Sheberach (Prayer for Healing)",
        "name_he": "מִי שֶׁבֵּרַךְ",
        "timestamp": "38:14",
        "summary": "Singing the Mi Sheberach prayer, with names of those needing healing read between verses.",
        "details": {
            "background": "A traditional prayer invoking God's blessing for physical and spiritual healing.",
            "transcript_notes": "Standard Mi Sheberach melody/text structure ('May the source of strength...'). Includes a lengthy list of specific names read aloud (approx 39:10 - 40:02), including 5 hostages by name. Concludes with standard ending praising God as source of healing (approx 41:09)."
        }
    },
    {
        "id": "silent_prayer",
        "name_en": "Silent Prayer",
        "name_he": "תְּפִלָּה שֶׁקֶטָה",
        "timestamp": "42:14",
        "summary": "A period for individual, silent reflection and prayer.",
        "details": {
            "background": "Providing personal space within the communal service to connect with God.",
            "transcript_notes": "Followed by Oseh Shalom."
        }
    },
    {
        "id": "oseh_shalom_song",
        "name_en": "Oseh Shalom (Song for Peace)",
        "name_he": "עֹשֶׂה שָׁלוֹם",
        "timestamp": "43:51",
        "summary": "Congregational singing of Oseh Shalom, a prayer for peace.",
        "details": {
            "background": "A common musical setting concluding the Amidah section or following silent prayer.",
            "transcript_notes": "Sung communally (approx 43:51 - 46:45)."
        }
    },
    {
        "id": "member_honoring_50yr",
        "name_en": "Honoring 50-Year Members",
        "name_he": "",
        "timestamp": "46:45",
        "summary": "Rabbi Foster honors long-standing members of the congregation.",
        "details": {
            "background": "A special recognition ceremony specific to this synagogue's traditions.",
            "transcript_notes": "Rabbi Foster speaks on the significance of long-term membership ('living the values'). Calls up specific members: Jane Mandro, Glenda Kaufman, Dr. Stanley Ginsburg, Bev Ruo. Mentions others not present. Ceremony includes presentation of certificates (with a minor mix-up noted). Concludes with song 'L'dor Vador' (From Generation to Generation) (approx 54:00)."
        }
    },
    {
        "id": "tributes_intro",
        "name_en": "Introduction to Tributes for Rabbi Black",
        "name_he": "",
        "timestamp": "55:06",
        "summary": "Rabbi Hyatt introduces guest speakers who will pay tribute to Rabbi Black.",
        "details": {
            "background": "Part of the special focus of this service honoring Rabbi Black's retirement.",
            "transcript_notes": "Highlights Rabbi Black's impact beyond the congregation. Introduces Shara Smith, Rabbi Brian Emerman, and Rabbi Foster."
        }
    },
    {
        "id": "tribute_interfaith",
        "name_en": "Tribute: Shara Smith (Interfaith Alliance)",
        "name_he": "",
        "timestamp": "57:00",
        "summary": "Shara Smith shares reflections on partnering with Rabbi Black in interfaith and justice work.",
        "details": {
            "transcript_notes": "Tells an anecdote about witnessing exclusion and contrasts it with Rabbi Black's consistent 'showing up' for justice, partnership, and support against ignorance and hatred. Expresses deep gratitude."
        }
    },
    {
        "id": "tribute_emerman",
        "name_en": "Tribute: Rabbi Brian Emerman",
        "name_he": "",
        "timestamp": "1:02:40",
        "summary": "Rabbi Emerman, a former colleague/mentee, speaks about Rabbi Black's impact as a rabbi, mentor, and friend.",
        "details": {
            "transcript_notes": "Expresses gratitude for the Temple Emanuel community. Uses the metaphor of blessing a tree to ask how to bless Rabbi Black. Highlights Rabbi Black's presence at personal life events, wisdom, listening skills, and emphasis on 'telling the truth' (citing Frederick Buechner). Leads the congregation in standing to honor Rabbi Black as their teacher. Concludes with the idea that the community represents the 'forest' Rabbi Black has planted."
        }
    },
    {
        "id": "tribute_foster",
        "name_en": "Tribute: Rabbi Foster",
        "name_he": "",
        "timestamp": "1:12:20",
        "summary": "Rabbi Foster offers personal reflections and advice to Rabbi Black.",
        "details": {
            "transcript_notes": "Quotes Rabbi Israel Salanter on disagreement and fearlessness. Expresses 'jealousy' of Rabbi Black's musical talent and meaningful integration of music. References Snoopy/Charlie Brown on living each day. Encourages Rabbi Black to continue doing important work in retirement. Offers 'Mazel Tov'."
        }
    },
    {
        "id": "rabbi_black_response",
        "name_en": "Response: Rabbi Joe Black",
        "name_he": "",
        "timestamp": "1:17:00",
        "summary": "Rabbi Black responds to the tributes, offering thanks and reflections.",
        "details": {
            "transcript_notes": "Connects to the week's Torah portion (Vayikra) about God's call. Speaks about influences (Rabbi Polish, teachers, congregants). Thanks colleagues (Hyatt, Sacks, Brodsky, Stark), visiting rabbis/friends (Emerman, Finn, Rosenberg, Wishner, Danziger). Thanks Shara Smith. Expresses deep love and gratitude to his family (sister Nina, children, grandson Ezie, wife Sue - mentioning their 36th anniversary). Reflects on Jacob's prayer ('I am unworthy') and expresses gratitude for the privilege of being their rabbi. Connects the number 151 (synagogue year) to Mikvah (transition)."
        }
    },
    {
        "id": "communal_blessing",
        "name_en": "Communal Blessing for Rabbi Black",
        "name_he": "בְּרָכָה קְהִילָתִית",
        "timestamp": "1:26:06",
        "summary": "Family, clergy, and guests gather to offer a collective blessing to Rabbi Black, using words set to his own music.",
        "details": {
            "background": "A powerful ritual moment combining traditional blessing structures with personal elements.",
            "transcript_notes": "Led by Rabbi Foster, inviting family and clergy. Blessing uses words from Torah rendered into music by Rabbi Black ('May you live to see your world fulfilled...'). Incorporates Priestly Blessing themes ('May God bless you and keep you...'). Includes poignant verses about legacy, teaching, and the future ('May your face reflect the brightness...', 'May you never have to pay...')."
        }
    },
    {
        "id": "alenu",
        "name_en": "Aleinu",
        "name_he": "עָלֵינוּ",
        "timestamp": "1:33:21",
        "summary": "Concluding prayer praising God and looking towards universal redemption.",
        "details": {
            "background": "Standard concluding prayer.",
            "transcript_notes": "Congregation remains standing initially, then seated (approx 1:33:21 - 1:34:34)."
        }
    },
    {
        "id": "memorial_intro",
        "name_en": "Introduction to Memorial Prayers",
        "name_he": "",
        "timestamp": "1:34:34",
        "summary": "Transition to remembering loved ones who have passed away.",
        "details": {
            "background": "Connecting moments of communal joy with remembrance of those who came before.",
            "transcript_notes": "Rabbi Hyatt speaks about gratitude for those no longer with us."
        }
    },
    {
        "id": "memorial_list",
        "name_en": "Reading of Names (Yahrzeits & Recent Losses)",
        "name_he": "",
        "timestamp": "1:35:26",
        "summary": "Recitation of names of those recently deceased and those whose Yahrzeit (anniversary of death) is observed.",
        "details": {
            "background": "A way to honor individual memories within the community context.",
            "transcript_notes": "Includes names lost in the past week, past 30 days, and a long list of Yahrzeits, plus names from Colleen, CO (Finer Chapel dedication)."
        }
    },
     {
        "id": "invitation_to_rise",
        "name_en": "Invitation for Mourners to Rise",
        "name_he": "",
        "timestamp": "1:38:25",
        "summary": "Inviting those in specific periods of mourning or observing Yahrzeit to stand.",
        "details": {
            "background": "Recognizing and supporting those actively in mourning.",
            "transcript_notes": "Invites those in first 30 days, first year, or marking Yahrzeit to rise before Kaddish."
        }
    },
    {
        "id": "kaddish",
        "name_en": "Mourner's Kaddish",
        "name_he": "קַדִּישׁ יָתוֹם",
        "timestamp": "1:38:55",
        "summary": "Congregational recitation of the Mourner's Kaddish.",
        "details": {
            "background": "Traditional Aramaic prayer praising God, recited by mourners and congregation.",
            "full_text_he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא...",
            "full_text_en_translit": "Yitgadal v'yitkadash sh'mei raba...",
            "full_text_en_translate": "Magnified and sanctified may God's great Name be...",
            "notes": "Followed by Oseh Shalom prayer and English reading 'We Remember Them'."
        }
    },
    {
        "id": "announcements",
        "name_en": "Announcements",
        "name_he": "הוֹדָעוֹת",
        "timestamp": "1:40:40",
        "summary": "Brief announcements about upcoming services, events, and community notices.",
        "details": {
            "background": "Sharing important information with the congregation.",
            "transcript_notes": "Announcements for tomorrow's B'nai Mitzvah, Torah Study, Shabbat Community Service. Reminders about Passover Seder registration, community survey. Instructions for dinner following the service, including table assignment for Rabbi Black's team. Mention of website for congratulatory messages."
        }
    },
    {
        "id": "kiddush",
        "name_en": "Kiddush",
        "name_he": "קִדּוּשׁ",
        "timestamp": "1:43:45",
        "summary": "Congregational Kiddush (blessing over wine/grape juice).",
        "details": {
            "background": "Sanctifying Shabbat with the blessing over wine.",
            "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הַגָּפֶן.",
            "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, borei p'ri hagafen.",
            "full_text_en_translate": "Blessed are You, LORD our God, King of the universe, Creator of the fruit of the vine.",
             "transcript_notes": "Congregation rises. Led by clergy."
        }
    },
    {
        "id": "closing_dayenu",
        "name_en": "Closing Song: Dayenu",
        "name_he": "דַּיֵּנוּ",
        "timestamp": "1:45:15",
        "summary": "Energetic closing song 'Dayenu' (It Would Have Been Enough), connecting to Passover themes.",
        "details": {
            "background": "A joyous and familiar song often associated with Passover, used here as a concluding hymn of gratitude.",
            "transcript_notes": "Led with high energy, referencing miracles of Exodus and applying the 'Dayenu' concept to Rabbi Black's attributes ('If he had only...'). Includes congregational singing. Ends with 'Shabbat Shalom'."
        }
    }
  ]
}