{
  "incomeBrackets": [
    { "income": 20000, "label": "Working Poor", "description": "It's a grind. Every dollar is stretched. Instant noodles are practically a currency." },
    { "income": 30000, "label": "Low Income", "description": "Budgeting is an art form. A night out for pizza is a rare, celebrated event." },
    { "income": 50000, "label": "Lower Middle Class", "description": "Essentials are covered, maybe a concert ticket. Saving is tough but not impossible." },
    { "income": 75000, "label": "Middle Class", "description": "Comfortable, but mindful of spending. Starting to build that nest egg and a 401k." },
    { "income": 100000, "label": "Upper Middle Class", "description": "Life's pretty good! More treats, less stress. Investments are growing." },
    { "income": 150000, "label": "Affluent", "description": "Enjoying the finer things. Weekend getaways and nice dinners are regular occurrences." },
    { "income": 200000, "label": "High Income", "description": "Luxury choices become normal. Shopping at upscale department stores without wincing!" },
    { "income": 300000, "label": "Wealthy", "description": "Premium experiences are the standard. Your financial advisor is a good friend." },
    { "income": 500000, "label": "Very Wealthy", "description": "Elite living. 'Fly commercial or private?' is a genuine dilemma." },
    { "income": 750000, "label": "Ultra High Net Worth", "description": "Exclusive access. Your hobbies sound like movie plots." },
    { "income": 1000000, "label": "Millionaire", "description": "Congrats, you made it! Now, the fun part: smart allocation and enjoying the fruits." },
    { "income": 2000000, "label": "Multi-Millionaire", "description": "Private jet for a quick European city break? Sure, why not." },
    { "income": 5000000, "label": "Ultra Wealthy", "description": "The world is your playground. You might own the company that makes the playground equipment." },
    { "income": 10000000, "label": "Ultra Elite", "description": "Your biggest worry? Which continent for the summer. Philanthropy becomes a significant focus." },
    { "income": 25000000, "label": "Billionaire Class", "description": "Price tags are suggestions. Next stop: influencing global change (or funding space exploration)." }
  ],
  "lifestyleData": {
    "dining": [
      { "min": 0, "items": [
          { "title": "Home Cook Hero (by necessity!)", "desc": "Pasta, rice, beans are staples. Supermarket generic brands are gold. A rare splurge: a $5 pizza from Little Caesars or Domino's.", "itemIcon": "bi-cart4", "financialNote": "Savings are aspirational." },
          { "title": "Grocery Ninja", "desc": "$150-200/month. Couponing isn't just a hobby, it's a survival skill. Eating out is a distant dream.", "itemIcon": "bi-scissors" }
      ]},
      { "min": 2, "items": [
          { "title": "Casual Eats & Local Diners", "desc": "Hitting up a local diner or a casual chain like Applebee's or Chili's a few times a month. You know the happy hour specials.", "itemIcon": "bi-cup-straw"},
          { "title": "Smart Grocery Runs", "desc": "$400/month at a standard supermarket (e.g., Kroger, Albertsons). Maybe some organic produce if it's on sale.", "itemIcon": "bi-basket3-fill", "financialNote": "Slowly building an emergency fund."}
      ]},
      { "min": 4, "items": [
          { "title": "Foodie Adventures", "desc": "Weekly dinners at popular local restaurants or trendy food halls. Craft beers at a local microbrewery.", "itemIcon": "bi-emoji-sunglasses-fill"},
          { "title": "Premium Pantry Stocking", "desc": "$600+/month. Regular trips to Whole Foods Market or a similar premium grocer. You invest in the good olive oil and artisanal bread.", "itemIcon": "bi-shop", "financialNote": "Maxing out that 401k feels good." }
      ]},
      { "min": 7, "items": [
          { "title": "Fine Dining Connoisseur", "desc": "Regular reservations at Michelin-starred or equivalent top-rated local restaurants. Wine pairings are non-negotiable.", "itemIcon": "bi-award"},
          { "title": "Gourmet Home Experience", "desc": "$1500+/month on food & wine. Shopping at specialty food stores (e.g., Eataly if in a major city, or local equivalents). Perhaps a high-end La Cornue or Wolf range.", "itemIcon": "bi-gem", "financialNote": "Diversified investments managed by a pro."}
      ]},
      { "min": 10, "items": [
          { "title": "Private Chef & Exclusive Tables", "desc": "Personal chef for special occasions or weekly meal prep. Access to private dining rooms at globally renowned establishments like Noma or The French Laundry (by reservation months in advance).", "itemIcon": "bi-person-badge", "luxury": true},
          { "title": "Curated Wine Cellar", "desc": "Investing in rare and fine wines (e.g., Bordeaux First Growths, Grand Cru Burgundy), possibly with a consultant. Trips to Napa, Tuscany, or Bordeaux for 'research'.", "itemIcon": "bi-slack", "luxury": true, "financialNote": "Estate planning and philanthropic strategies are key."}
      ]}
    ],
    "housing": [
      { "min": 0, "items": [
          { "title": "Roommate Shuffle", "desc": "Renting a room in an older building in a less central part of town. Fingers crossed for compatible roommates!", "itemIcon": "bi-person-plus-fill" },
          { "title": "Furniture Finds", "desc": "Mostly thrift store treasures or generous hand-me-downs. You're a DIY wizard with YouTube tutorials.", "itemIcon": "bi-magic", "financialNote": "Rent eats up a significant portion of income." }
      ]},
      { "min": 2, "items": [
          { "title": "Your Own Cozy Corner", "desc": "Studio or 1BR apartment in a decent, accessible neighborhood. Small, but all yours!", "itemIcon": "bi-key-fill" },
          { "title": "IKEA & Target Style", "desc": "Assembling flat-pack furniture is a rite of passage. That IKEA KALLAX shelf is a global icon for a reason.", "itemIcon": "bi-box-seam", "financialNote": "A down payment seems like a distant mountain." }
      ]},
      { "min": 4, "items": [
          { "title": "Homeownership Horizons", "desc": "Eyeing a modest starter home or townhome in a family-friendly suburb or an up-and-coming city neighborhood.", "itemIcon": "bi-house-add-fill" },
          { "title": "West Elm & CB2 Aspirations", "desc": "Upgrading furniture. Maybe a brand-new couch from a mid-range store like West Elm, CB2, or Pottery Barn.", "itemIcon": "bi-display", "financialNote": "Mortgage, property taxes, and possibly HOA fees are now real." }
      ]},
      { "min": 7, "items": [
          { "title": "Luxury Living", "desc": "A spacious, well-appointed home in a desirable neighborhood, or a luxury condo with amenities in the city center. Heated bathroom floors are a nice touch.", "itemIcon": "bi-house-heart-fill" },
          { "title": "Designer Touches & Renovations", "desc": "Working with an interior designer. Custom cabinetry from brands like Poggenpohl or Smallbone, and art investments. That dream kitchen with Sub-Zero and Wolf appliances is happening.", "itemIcon": "bi-palette2", "financialNote": "Real estate as a significant asset class."}
      ]},
      { "min": 10, "items": [
          { "title": "Multiple Luxury Properties", "desc": "Primary residence in an exclusive enclave, a ski chalet in Aspen or St. Moritz, maybe a beach house in the Hamptons or Malibu.", "itemIcon": "bi-houses-fill", "luxury": true},
          { "title": "Custom Architecture & Staff", "desc": "Commissioning a renowned architect for a bespoke home. Full-time household staff including a house manager, chef, and security.", "itemIcon": "bi-people-fill", "ultraLuxury": true, "financialNote": "Complex property management and international tax considerations."}
      ]}
    ],
    "transportation": [
      { "min": 0, "items": [
          { "title": "Public Transit Pro", "desc": "You've mastered the local bus and subway/tram system. Walking and a trusty (if rusty) bike are your companions.", "itemIcon": "bi-bus-front-fill" },
          { "title": "The 'Character' Car", "desc": "If you own a car, it's an older, high-mileage model that cost very little and has its own unique quirks. You're a YouTube-certified mechanic.", "itemIcon": "bi-cone", "financialNote": "Gas and insurance are major budget items." }
      ]},
      { "min": 2, "items": [
          { "title": "Reliable Used Wheels", "desc": "A dependable used Honda Civic, Toyota Corolla, or perhaps an older Subaru or similar AWD for tougher climates.", "itemIcon": "bi-car-front" },
          { "title": "Ride-Share Regular", "desc": "Using Uber/Lyft for those nights out when parking is a nightmare or after a few drinks.", "itemIcon": "bi-phone-fill", "financialNote": "Car payments are a line item, but manageable." }
      ]},
      { "min": 4, "items": [
          { "title": "That New(ish) Car Scent", "desc": "A new, practical car like a Subaru Outback/Forester, Honda CR-V, Toyota RAV4, or a stylish Mazda CX-5.", "itemIcon": "bi-stars" },
          { "title": "Worry-Free Maintenance", "desc": "Regular dealer services, comprehensive insurance. That check engine light causes less panic.", "itemIcon": "bi-shield-lock-fill", "financialNote": "Leasing vs. buying is a dinner table debate." }
      ]},
      { "min": 7, "items": [
          { "title": "Luxury Commuting", "desc": "Driving a Tesla Model Y/S, BMW X5, Audi Q7, Mercedes-Benz GLE, or a Porsche Macan.", "itemIcon": "bi-speedometer" },
          { "title": "The Two-Car (or more) Household", "desc": "A practical daily driver plus a 'fun' weekend car – perhaps a Porsche Boxster, a Ford Mustang convertible, or a classic sports car.", "itemIcon": "bi-ev-station-fill", "luxury": true, "financialNote": "Vehicle depreciation is factored into financial planning."}
      ]},
      { "min": 10, "items": [
          { "title": "Exotic Car Collection", "desc": "Ferraris, Lamborghinis, McLarens. Maybe a bespoke Rolls-Royce Phantom or Bentley Continental GT for comfortable cruising.", "itemIcon": "bi-trophy-fill", "ultraLuxury": true},
          { "title": "Private Driver / Chauffeur", "desc": "Full-time chauffeur for daily transport and errands in a luxury sedan like a Mercedes S-Class or BMW 7 Series. Never worry about parking again.", "itemIcon": "bi-person-vcard", "ultraLuxury": true, "financialNote": "Managing a fleet and staff requires expertise."}
      ]}
    ],
    "travel": [
      { "min": 0, "items": [
          { "title": "Staycation Pro", "desc": "Exploring local parks, free museum days, and nearby nature trails. Camping in state parks is the annual big adventure.", "itemIcon": "bi-geo-alt-fill" },
          { "title": "Roadtrip Co-Pilot", "desc": "Chipping in for gas if a friend with a car is heading to a nearby city or natural attraction. You bring the snacks!", "itemIcon": "bi-pin-map-fill", "financialNote": "A 'vacation fund' is more like a 'maybe someday' jar." }
      ]},
      { "min": 2, "items": [
          { "title": "Budget Domestic Explorer", "desc": "Annual flight on a budget airline like Spirit, Ryanair, or EasyJet. Weekend trips to nearby cities. Staying in budget hotels or hostels.", "itemIcon": "bi-airplane-engines-fill" },
          { "title": "Regional Escapes", "desc": "Driving to nearby attractions or smaller cities for a weekend. Camping is still a favorite and cost-effective option.", "itemIcon": "bi-image-alt", "financialNote": "Saving for trips involves careful planning."}
      ]},
      { "min": 4, "items": [
          { "title": "International Adventures Begin", "desc": "First trips to popular international destinations like Mexico, Canada, or a well-planned week in a major European city (e.g., Paris, Rome, London), likely staying in Airbnbs or mid-range hotels.", "itemIcon": "bi-globe-americas"},
          { "title": "Comfortable Domestic Travel", "desc": "Flying major airlines (e.g., Delta, United, British Airways - not basic economy!), staying in reputable mid-tier hotels like Hilton or Marriott. Maybe a ski trip or beach vacation.", "itemIcon": "bi-suitcase-lg-fill", "financialNote": "Dedicated travel savings account." }
      ]},
      { "min": 7, "items": [
          { "title": "Business Class & Luxury Resorts", "desc": "Flying business class internationally (e.g., Emirates, Singapore Airlines). Staying at 5-star resorts (e.g., Four Seasons, St. Regis) in destinations like Hawaii, the Caribbean, or the Mediterranean. Maybe a luxury cruise line like Seabourn or Silversea.", "itemIcon": "bi-passport-fill", "luxury": true},
          { "title": "Adventure & Experiential Travel", desc: "Safaris in Africa, exploring Patagonia, a cultural immersion trip to Japan, or diving in the Maldives. Unique, curated experiences are prioritized.", "itemIcon": "bi-compass-fill", "luxury": true, "financialNote": "Travel agent or concierge service for planning."}
      ]},
      { "min": 10, "items": [
          { "title": "First Class & Private Aviation", "desc": "Flying first class suites on premier airlines (e.g., Etihad The Residence, Singapore Suites). Fractional ownership of a private jet (NetJets, Flexjet) or chartering for convenience.", "itemIcon": "bi-send-check-fill", "ultraLuxury": true},
          { "title": "World-Circling Itineraries", desc: "Extended trips to multiple continents, perhaps on a private jet world tour. Owning multiple vacation homes in places like Lake Como, St. Barts, or a private island. Access to exclusive, remote destinations.", "itemIcon": "bi-globe-europe-africa", "ultraLuxury": true, "financialNote": "Global travel logistics, currency management, and security considerations."}
      ]}
    ],
    "entertainment": [
      { "min": 0, "items": [
          { "title": "Free Fun Seeker", "desc": "Public library for books, movies, and music. Free local concerts in the park. Hiking local trails. Streaming services via a 'borrowed' account?", "itemIcon": "bi-headphones" },
          { "title": "DIY Entertainment", "desc": "Drawing, writing, learning an instrument from YouTube tutorials. Imagination and free online resources are your biggest budget items.", "itemIcon": "bi-brush-fill", "financialNote": "Cable TV is a forgotten luxury." }
      ]},
      { "min": 2, "items": [
          { "title": "Local Gigs & Movies", "desc": "Catching a band at a local music club or pub. A movie at the multiplex (matinee prices!). A couple of streaming services like Netflix or Hulu.", "itemIcon": "bi-ticket-detailed-fill" },
          { "title": "Social Outings", "desc": "Meeting friends for drinks and apps at a casual bar or restaurant. You're a connoisseur of happy hour deals.", "itemIcon": "bi-megaphone-fill", "financialNote": "Entertainment budget: $100-$200/month."}
      ]},
      { "min": 4, "items": [
          { "title": "Major Concerts & Sporting Events", "desc": "Scoring tickets to see major touring artists at an arena or stadium. Attending professional sports games. Maybe a season pass for a local ski resort if applicable.", "itemIcon": "bi-boombox-fill"},
          { "title": "Quality Home Entertainment", "desc": "A good TV and sound system (e.g., Sonos). A new gaming console (PlayStation 5/Xbox Series X). Subscribing to multiple streaming services (Netflix, Disney+, HBO Max).", "itemIcon": "bi-controller", "financialNote": "Hobbies start getting dedicated budget lines." }
      ]},
      { "min": 7, "items": [
          { "title": "VIP & Season Tickets", "desc": "VIP packages for concerts and festivals. Season tickets for your favorite professional sports team. Maybe a membership at a private social or country club.", "itemIcon": "bi-patch-check-fill", "luxury": true},
          { "title": "High-End Hobbies", "desc": "Collecting art, fine wines, or vintage guitars. Golf memberships at exclusive clubs. Attending prestigious events like the Monaco Grand Prix or Wimbledon.", "itemIcon": "bi-easel3-fill", "luxury": true, "financialNote": "Discretionary spending is significant."}
      ]},
      { "min": 10, "items": [
          { "title": "Courtside & Backstage Access", "desc": "Courtside seats at NBA games. Backstage passes to meet your favorite artists. Attending exclusive events like the Oscars, Cannes Film Festival, or Fashion Week in Paris/Milan.", "itemIcon": "bi-star-fill", "ultraLuxury": true},
          { "title": "Funding the Arts / Owning a Team", "desc": "Becoming a significant patron of a major museum, opera, or ballet company. Investing in Broadway shows or film production. Maybe even part-ownership of a professional sports franchise.", "itemIcon": "bi-film", "ultraLuxury": true, "financialNote": "Legacy building through cultural contributions and investments."}
      ]}
    ],
    "education": [
      { "min": 0, "items": [
          { "title": "Public Library University", "desc": "The local public library is your campus. Free online courses from platforms like Coursera, edX for skill-building. Khan Academy is your go-to tutor.", "itemIcon": "bi-lightbulb-fill"},
          { "title": "Self-Taught & Resourceful", "desc": "Learning through podcasts, documentaries, and extensive internet research. Mentorship from experienced friends or colleagues.", "itemIcon": "bi-search-heart", "financialNote": "Formal education costs are prohibitive."}
      ]},
      { "min": 2, "items": [
          { "title": "Community College / In-State Public University", "desc": "Attending a local community college for affordable degrees/certificates. In-state tuition at a public state university, likely with student loans.", "itemIcon": "bi-mortarboard-fill"},
          { "title": "Trade Schools & Certifications", "desc": "Focusing on practical skills for specific careers through vocational programs or online certifications (e.g., Google Career Certificates, CompTIA).", "itemIcon": "bi-tools", "financialNote": "Managing student loan debt is a priority."}
      ]},
      { "min": 4, "items": [
          { "title": "Choice of Public or Private University", "desc": "Attending a well-regarded private university or a flagship state university (possibly out-of-state) with scholarships/loans. Options like an MBA from a state school.", "itemIcon": "bi-building-fill-check"},
          { "title": "Continuing Education & Workshops", "desc": "Investing in professional development courses, industry conferences (e.g., INBOUND, CES), and specialized workshops to advance career. Online platforms like LinkedIn Learning.", "itemIcon": "bi-graph-up-arrow", "financialNote": "Paying down student loans aggressively."}
      ]},
      { "min": 7, "items": [
          { "title": "Elite Universities & Grad School", "desc": "Attending Ivy League or other top-tier universities (e.g., Stanford, MIT, Oxbridge) for undergrad or graduate programs (MBA from Harvard/Wharton, Law, Medicine) without crippling debt.", "itemIcon": "bi-bank2", "luxury": true},
          { "title": "Private Tutors & Specialized Coaching", "desc": "Hiring tutors for children's challenging subjects or SAT/ACT prep. Executive coaching for career advancement. Language immersion programs abroad.", "itemIcon": "bi-person-video3", "luxury": true, "financialNote": "Setting up 529 plans or equivalent for children's education."}
      ]},
      { "min": 10, "items": [
          { "title": "Global Education & Bespoke Learning", "desc": "Sending children to elite international boarding schools (e.g., Le Rosey in Switzerland, Eton College in the UK). Custom-designed educational programs and world-schooling experiences.", "itemIcon": "bi-globe2", "ultraLuxury": true},
          { "title": "University Donations & Endowments", "desc": "Significant philanthropic contributions to alma mater or other prestigious institutions, potentially leading to named buildings or programs. Funding cutting-edge research.", "itemIcon": "bi-capslock-fill", "ultraLuxury": true, "financialNote": "Establishing educational foundations or trusts for generations."}
      ]}
    ],
    "services": [
      { "min": 0, "items": [
          { "title": "The Ultimate DIY-er", "desc": "You cut your own hair (YouTube tutorials are a lifesaver!), clean your own home, and are a pro at assembling IKEA furniture solo. Basic car maintenance via online guides.", "itemIcon": "bi-wrench-adjustable-circle-fill"},
          { "title": "Community Support System", "desc": "Relying on friends and family for help with moves or pet-sitting. Bartering skills with neighbors (e.g., tech help for gardening).", "itemIcon": "bi-people", "financialNote": "Paid personal services are a rare luxury."}
      ]},
      { "min": 2, "items": [
          { "title": "Basic Maintenance Services", "desc": "Haircuts at budget chains like Great Clips or Supercuts. Maybe a TaskRabbit for help with a heavy lifting job once a year.", "itemIcon": "bi-scissors"},
          { "title": "Occasional House Cleaner", "desc": "Treating yourself to a house cleaning service (e.g., Merry Maids, local independent cleaners) before a big party or a few times a year.", "itemIcon": "bi-bucket-fill", "financialNote": "Budgeting for small service conveniences."}
      ]},
      { "min": 4, "items": [
          { "title": "Regular Pampering & Assistance", "desc": "Monthly haircuts at a decent mid-range salon. Bi-weekly house cleaning. Lawn care service during summer. Using services like DoorDash or Uber Eats more regularly.", "itemIcon": "bi-person-arms-up"},
          { "title": "Personal Trainer & Wellness", "desc": "Gym membership at a nicer gym (e.g., Equinox on the higher end of this, or a good local studio). Maybe a ClassPass subscription for variety. Regular massages.", "itemIcon": "bi-heart-pulse-fill", "financialNote": "Investing in personal well-being and convenience."}
      ]},
      { "min": 7, "items": [
          { "title": "Concierge Lifestyle", "desc": "Personal assistant (part-time) for errands, scheduling, and travel planning. Premium spa treatments at luxury hotel spas or high-end day spas. Personal shopper for wardrobe updates (e.g., Nordstrom stylist).", "itemIcon": "bi-person-rolodex", "luxury": true},
          { "title": "Household Support Staff", "desc": "Full-time nanny if you have children. Regular professional landscaping and pool maintenance. Dog walker and mobile pet groomer.", "itemIcon": "bi-house-gear-fill", "luxury": true, "financialNote": "Managing payroll and benefits for domestic staff."}
      ]},
      { "min": 10, "items": [
          { "title": "Full Estate Management", "desc": "Butler, private chef (e.g., a Le Cordon Bleu graduate), full-time housekeeping staff, groundskeepers, personal security detail. A dedicated estate manager oversees all household operations.", "itemIcon": "bi-shield-shaded", "ultraLuxury": true},
          { "title": "Bespoke Global Services", "desc": "Access to world-class service professionals on demand, anywhere in the world (e.g., Quintessentially or similar concierge services). 24/7 support for any request imaginable, from chartering a yacht to sourcing rare items.", "itemIcon": "bi-headset", "ultraLuxury": true, "financialNote": "Services budget is a significant portion of overall expenses, often involving international contracts."}
      ]}
    ]
  }
}