{
  "incomeBrackets": [
    { "income": 20000, "label": "Working Poor", "description": "It's a grind. Every dollar is stretched. Instant noodles are practically a currency." },
    { "income": 30000, "label": "Low Income", "description": "Budgeting is an art form. A night out for pizza is a rare, celebrated event." },
    { "income": 50000, "label": "Lower Middle Class", "description": "Essentials are covered, maybe a concert ticket. Saving is tough but not impossible." },
    { "income": 75000, "label": "Middle Class", "description": "Comfortable, but mindful of spending. Starting to build that nest egg and a 401k." },
    { "income": 100000, "label": "Upper Middle Class", "description": "Life's pretty good! More treats, less stress. Investments are growing." },
    { "income": 150000, "label": "Affluent", "description": "Enjoying the finer things. Weekend getaways and nice dinners are regular occurrences." },
    { "income": 200000, "label": "High Income", "description": "Luxury choices become normal. Shopping at upscale department stores without wincing!" },
    { "income": 300000, "label": "Wealthy", "description": "Premium experiences are the standard. Your financial advisor is a good friend." },
    { "income": 500000, "label": "Very Wealthy", "description": "Elite living. 'Fly commercial or private?' is a genuine dilemma." },
    { "income": 750000, "label": "Ultra High Net Worth", "description": "Exclusive access. Your hobbies sound like movie plots." },
    { "income": 1000000, "label": "Millionaire", "description": "Congrats, you made it! Now, the fun part: smart allocation and enjoying the fruits." },
    { "income": 2000000, "label": "Multi-Millionaire", "description": "Private jet for a quick European city break? Sure, why not." },
    { "income": 5000000, "label": "Ultra Wealthy", "description": "The world is your playground. You might own the company that makes the playground equipment." },
    { "income": 10000000, "label": "Ultra Elite", "description": "Your biggest worry? Which continent for the summer. Philanthropy becomes a significant focus." },
    { "income": 25000000, "label": "Billionaire Class", "description": "Price tags are suggestions. Next stop: influencing global change (or funding space exploration)." }
  ],
  "lifestyleData": {
    "dining": [
      { "min": 0, "items": [
          { "title": "Home Cook Hero (by necessity!)", "desc": "Pasta, rice, beans are staples. Supermarket generic brands are gold. A rare splurge: a $5 pizza from Little Caesars or Domino's, or a local takeaway.", "itemIcon": "bi-cart4", "financialNote": "Savings are aspirational." },
          { "title": "Grocery Ninja", "desc": "$150-200/month (or local equivalent). Couponing isn't just a hobby, it's a survival skill. Eating out is a distant dream.", "itemIcon": "bi-scissors" }
      ]},
      { "min": 2, "items": [
          { "title": "Casual Eats & Local Diners", "desc": "Hitting up a local diner or a casual chain like Applebee's, Chili's (North America), or Nando's (UK/International) a few times a month. You know the happy hour specials.", "itemIcon": "bi-cup-straw"},
          { "title": "Smart Grocery Runs", "desc": "$400/month (or local equivalent) at large supermarket chains (e.g., Kroger, Tesco, Carrefour, Woolworths). Maybe some organic produce if it's on sale.", "itemIcon": "bi-basket3-fill", "financialNote": "Slowly building an emergency fund."}
      ]},
      { "min": 4, "items": [
          { "title": "Foodie Adventures", "desc": "Weekly dinners at popular local restaurants or trendy food halls. Craft beers at a local microbrewery. Exploring different cuisines.", "itemIcon": "bi-emoji-sunglasses-fill"},
          { "title": "Premium Pantry Stocking", "desc": "$600+/month (or local equivalent). Regular trips to Whole Foods Market, Marks & Spencer Foodhall, Waitrose, or local organic markets. You invest in the good olive oil and artisanal bread.", "itemIcon": "bi-shop", "financialNote": "Maxing out that 401k (or equivalent pension plan) feels good." }
      ]},
      { "min": 7, "items": [
          { "title": "Fine Dining Connoisseur", "desc": "Regular reservations at Michelin-starred or equivalent top-rated local restaurants (e.g., those listed in World's 50 Best). Wine pairings are non-negotiable.", "itemIcon": "bi-award"},
          { "title": "Gourmet Home Experience", "desc": "$1500+/month on food & wine. Shopping at specialty food stores (e.g., Eataly, Dean & DeLuca style gourmet shops, local fromageries and butchers). Perhaps a high-end La Cornue, Wolf, or Gaggenau range.", "itemIcon": "bi-gem", "financialNote": "Diversified investments managed by a pro."}
      ]},
      { "min": 10, "items": [
          { "title": "Private Chef & Exclusive Tables", "desc": "Personal chef for special occasions or weekly meal prep. Access to private dining rooms at globally renowned establishments like Noma (Copenhagen), The French Laundry (Yountville), Osteria Francescana (Modena) (by reservation months/years in advance).", "itemIcon": "bi-person-badge", "luxury": true},
          { "title": "Curated Wine Cellar", "desc": "Investing in rare and fine wines (e.g., Bordeaux First Growths, Grand Cru Burgundy, cult Napa Cabernets like Screaming Eagle), possibly with a consultant from Sotheby's or Christie's. Trips to Napa, Tuscany, or Bordeaux for 'research' and vineyard tours.", "itemIcon": "bi-slack", "luxury": true, "financialNote": "Estate planning and philanthropic strategies are key."}
      ]}
    ],
    "housing": [
      { "min": 0, "items": [
          { "title": "Roommate Shuffle", "desc": "Renting a room in an older building in a less central part of town, or a shared flat. Fingers crossed for compatible roommates!", "itemIcon": "bi-person-plus-fill" },
          { "title": "Furniture Finds", "desc": "Mostly thrift store treasures, Facebook Marketplace finds, or generous hand-me-downs. You're a DIY wizard with YouTube tutorials.", "itemIcon": "bi-magic", "financialNote": "Rent eats up a significant portion of income." }
      ]},
      { "min": 2, "items": [
          { "title": "Your Own Cozy Corner", "desc": "Studio or 1BR apartment in a decent, accessible neighborhood. Small, but all yours!", "itemIcon": "bi-key-fill" },
          { "title": "IKEA & Target Style", "desc": "Assembling flat-pack furniture is a rite of passage. That IKEA KALLAX shelf or BILLY bookcase is a global icon for a reason. Maybe some affordable pieces from Target, Kmart, or Wayfair.", "itemIcon": "bi-box-seam", "financialNote": "A down payment seems like a distant mountain." }
      ]},
      { "min": 4, "items": [
          { "title": "Homeownership Horizons", "desc": "Eyeing a modest starter home, apartment, or townhome in a family-friendly suburb or an up-and-coming city neighborhood.", "itemIcon": "bi-house-add-fill" },
          { "title": "Mid-Range Furniture Upgrade", "desc": "Upgrading furniture. Maybe a brand-new couch from a mid-range store like West Elm, CB2, Pottery Barn, John Lewis, or Habitat. Investing in better quality mattresses and linens.", "itemIcon": "bi-display", "financialNote": "Mortgage, property taxes, and possibly HOA/service charges are now real." }
      ]},
      { "min": 7, "items": [
          { "title": "Luxury Living", "desc": "A spacious, well-appointed home in a desirable neighborhood, or a luxury condo/apartment with amenities (gym, pool, concierge) in the city center. Heated bathroom floors, smart home features (e.g., Nest, Philips Hue), and high-end finishes.", "itemIcon": "bi-house-heart-fill" },
          { "title": "Designer Touches & Renovations", "desc": "Working with an interior designer. Custom cabinetry from brands like Poggenpohl, Smallbone, or Boffi. Investing in original art. That dream kitchen with Sub-Zero, Wolf, or Miele appliances is happening.", "itemIcon": "bi-palette2", "financialNote": "Real estate as a significant asset class."}
      ]},
      { "min": 10, "items": [
          { "title": "Multiple Luxury Properties", "desc": "Primary residence in an exclusive enclave (e.g., Beverly Hills, The Bishops Avenue in London, Star Island in Miami, or similar prestigious addresses globally). A ski chalet in Aspen, St. Moritz, Whistler or Courchevel. A beach house in the Hamptons, Malibu, St. Barths, or the Côte d'Azur. Perhaps a country estate or a city pied-à-terre in Paris or New York.", "itemIcon": "bi-houses-fill", "luxury": true},
          { "title": "Custom Architecture & Staff", "desc": "Commissioning a renowned architect (e.g., Zaha Hadid Design, Kengo Kuma, Bjarke Ingels Group) for a bespoke home. Full-time household staff including a house manager, private chef, nannies, housekeepers, and security detail.", "itemIcon": "bi-people-fill", "ultraLuxury": true, "financialNote": "Complex property management and international tax considerations."}
      ]}
    ],
    "transportation": [
      { "min": 0, "items": [
          { "title": "Public Transit Pro", "desc": "You've mastered the local bus, subway/tram, or train system. Walking and a trusty (if rusty) bike are your companions. You know all the off-peak fares.", "itemIcon": "bi-bus-front-fill" },
          { "title": "The 'Character' Car", "desc": "If you own a car, it's an older, high-mileage model (e.g. a 15-year-old Ford Focus or Toyota Yaris) that cost very little and has its own unique quirks. You're a YouTube-certified mechanic for basic repairs.", "itemIcon": "bi-cone", "financialNote": "Gas/petrol and insurance are major budget items." }
      ]},
      { "min": 2, "items": [
          { "title": "Reliable Used Wheels", "desc": "A dependable used Honda Civic, Toyota Corolla, VW Golf/Polo, or perhaps an older Subaru or similar AWD for tougher climates. Focus on fuel efficiency and reliability.", "itemIcon": "bi-car-front" },
          { "title": "Ride-Share Regular", "desc": "Using Uber/Lyft/Bolt/Grab for those nights out when parking is a nightmare, for airport runs, or after a few drinks.", "itemIcon": "bi-phone-fill", "financialNote": "Car payments or savings for a car are a line item, but manageable." }
      ]},
      { "min": 4, "items": [
          { "title": "That New(ish) Car Scent", "desc": "A new, practical car like a Subaru Outback/Forester, Honda CR-V, Toyota RAV4, Mazda CX-5, VW Tiguan, or Nissan Qashqai. Maybe an entry-level EV like a Nissan Leaf or Chevrolet Bolt.", "itemIcon": "bi-stars" },
          { "title": "Worry-Free Maintenance", "desc": "Regular dealer services, comprehensive insurance. That check engine light causes less panic. Perhaps an extended warranty.", "itemIcon": "bi-shield-lock-fill", "financialNote": "Leasing vs. buying is a dinner table debate. Considering total cost of ownership." }
      ]},
      { "min": 7, "items": [
          { "title": "Luxury Commuting", "desc": "Driving a Tesla Model Y/S/3 Performance, BMW X5/5 Series, Audi Q7/A6, Mercedes-Benz GLE/E-Class, Range Rover Sport, or a Porsche Macan/Cayenne.", "itemIcon": "bi-speedometer" },
          { "title": "The Two-Car (or more) Household", "desc": "A practical luxury daily driver plus a 'fun' weekend car – perhaps a Porsche Boxster/Cayman, a Ford Mustang GT, a classic sports car (e.g., a vintage Jaguar E-Type or Alfa Romeo Spider), or a high-performance EV like a Porsche Taycan.", "itemIcon": "bi-ev-station-fill", "luxury": true, "financialNote": "Vehicle depreciation is factored into financial planning."}
      ]},
      { "min": 10, "items": [
          { "title": "Exotic Car Collection", "desc": "Ferraris (e.g., 296 GTB, SF90 Stradale), Lamborghinis (e.g., Huracán, Revuelto), McLarens (e.g., Artura, 720S). Maybe a bespoke Rolls-Royce Phantom/Cullinan or Bentley Continental GT/Bentayga for comfortable cruising. Climate-controlled garage is a must.", "itemIcon": "bi-trophy-fill", "ultraLuxury": true},
          { "title": "Private Driver / Chauffeur", "desc": "Full-time chauffeur for daily transport and errands in a luxury sedan like a Mercedes S-Class/Maybach, BMW 7 Series, Audi A8, or a luxury SUV like a Range Rover Autobiography. Never worry about parking or traffic again.", "itemIcon": "bi-person-vcard", "ultraLuxury": true, "financialNote": "Managing a fleet and staff requires expertise. Security driving courses for chauffeurs."}
      ]}
    ],
    "travel": [
      { "min": 0, "items": [
          { "title": "Staycation Pro", "desc": "Exploring local parks, free museum days, and nearby nature trails. Camping in state/national parks (if entry fees are minimal) or local campsites is the annual big adventure.", "itemIcon": "bi-geo-alt-fill" },
          { "title": "Roadtrip Co-Pilot", "desc": "Chipping in for gas/petrol if a friend with a car is heading to a nearby city, beach, or natural attraction. You bring the snacks and make the playlist!", "itemIcon": "bi-pin-map-fill", "financialNote": "A 'vacation fund' is more like a 'maybe someday' jar for small treats." }
      ]},
      { "min": 2, "items": [
          { "title": "Budget Domestic Explorer", "desc": "Annual flight on a budget airline like Spirit, Ryanair, EasyJet, or Southwest. Weekend trips to nearby cities. Staying in budget hotels (e.g., Ibis, Holiday Inn Express, Travelodge) or well-rated hostels.", "itemIcon": "bi-airplane-engines-fill" },
          { "title": "Regional Escapes", "desc": "Driving to nearby attractions, national parks, or smaller cities for a weekend. Camping is still a favorite and cost-effective option, maybe upgrading to a cabin rental.", "itemIcon": "bi-image-alt", "financialNote": "Saving for trips involves careful planning and hunting for deals."}
      ]},
      { "min": 4, "items": [
          { "title": "International Adventures Begin", "desc": "First trips to popular international destinations like Mexico, Canada, or a well-planned week in a major European city (e.g., Paris, Rome, London, Barcelona, Amsterdam), likely staying in Airbnbs, boutique hotels, or mid-range hotels (e.g., Hilton Garden Inn, Hyatt Place, Courtyard by Marriott).", "itemIcon": "bi-globe-americas"},
          { "title": "Comfortable Domestic Travel", "desc": "Flying major airlines (e.g., Delta, United, American, British Airways, Lufthansa, Emirates - not basic economy!), staying in reputable mid-tier hotels like Hilton, Marriott, Radisson Blu, or InterContinental. Maybe a ski trip, a beach vacation, or exploring national parks in more comfort.", "itemIcon": "bi-suitcase-lg-fill", "financialNote": "Dedicated travel savings account, possibly using travel rewards credit cards." }
      ]},
      { "min": 7, "items": [
          { "title": "Business Class & Luxury Resorts", "desc": "Flying business class internationally (e.g., Emirates A380, Singapore Airlines, Qatar Airways Qsuite, Cathay Pacific). Staying at 5-star resorts and hotels (e.g., Four Seasons, St. Regis, Mandarin Oriental, Aman Resorts, Ritz-Carlton) in destinations like Hawaii, the Caribbean, Maldives, or the Mediterranean. Maybe a luxury cruise line like Seabourn, Silversea, Regent Seven Seas, or Explora Journeys.", "itemIcon": "bi-passport-fill", "luxury": true},
          { "title": "Adventure & Experiential Travel", desc: "Safaris in Africa (e.g. Singita, &Beyond lodges in Botswana or Tanzania), exploring Patagonia, a cultural immersion trip to Japan including ryokans, diving in the Great Barrier Reef or Galapagos. Unique, curated experiences are prioritized, possibly through high-end tour operators like Abercrombie & Kent or bespoke travel designers.", "itemIcon": "bi-compass-fill", "luxury": true, "financialNote": "Travel agent or concierge service for planning complex itineraries."}
      ]},
      { "min": 10, "items": [
          { "title": "First Class & Private Aviation", "desc": "Flying first class suites on premier airlines (e.g., Etihad The Residence, Singapore Suites, Emirates First Class, Air France La Première). Fractional ownership of a private jet (NetJets, Flexjet, VistaJet) or chartering private jets (e.g. Gulfstream G650, Bombardier Global 7500) for convenience and privacy.", "itemIcon": "bi-send-check-fill", "ultraLuxury": true},
          { "title": "World-Circling Itineraries & Unique Stays", desc: "Extended trips to multiple continents, perhaps on a private jet world tour (e.g. Four Seasons Private Jet Experience, TCS World Travel). Owning multiple vacation homes in prime global locations like Lake Como, St. Barts, a private island in the Seychelles, or a vineyard in Provence. Access to exclusive, remote destinations, private yacht charters (e.g. Lurssen, Feadship builds).", "itemIcon": "bi-globe-europe-africa", "ultraLuxury": true, "financialNote": "Global travel logistics, currency management, and security considerations. Possibly a travel manager on staff."}
      ]}
    ],
    "entertainment": [
      { "min": 0, "items": [
          { "title": "Free Fun Seeker", "desc": "Public library for books, movies, and music. Free local concerts in the park, community events. Hiking local trails. Streaming services via a 'borrowed' account, ad-supported tiers (e.g. Spotify Free, YouTube), or free services like Pluto TV.", "itemIcon": "bi-headphones" },
          { "title": "DIY Entertainment", "desc": "Drawing, writing, learning an instrument from YouTube tutorials or free apps like Duolingo for languages. Board games or card games with friends. Imagination and free online resources are your biggest budget items.", "itemIcon": "bi-brush-fill", "financialNote": "Cable TV or multiple paid streaming subscriptions are a forgotten luxury." }
      ]},
      { "min": 2, "items": [
          { "title": "Local Gigs & Movies", "desc": "Catching a band at a local music club or pub (cover charge permitting). A movie at the multiplex (matinee prices or discount days!). A couple of essential streaming services like Netflix (basic plan) or Disney+.", "itemIcon": "bi-ticket-detailed-fill" },
          { "title": "Social Outings", "desc": "Meeting friends for drinks and apps at a casual bar or restaurant during happy hour. Bowling, local amateur sports, or trivia nights.", "itemIcon": "bi-megaphone-fill", "financialNote": "Entertainment budget: $100-$200/month (or local equivalent), carefully managed."}
      ]},
      { "min": 4, "items": [
          { "title": "Major Concerts & Sporting Events", "desc": "Scoring tickets to see major touring artists (e.g. Taylor Swift, Coldplay, Beyoncé) at an arena or stadium (maybe not the best seats, but you're there!). Attending professional sports games. Maybe a season pass for a local ski resort or theme park if applicable.", "itemIcon": "bi-boombox-fill"},
          { "title": "Quality Home Entertainment", "desc": "A good 4K TV (e.g., LG OLED, Samsung QLED) and a soundbar or decent sound system (e.g., Sonos, Bose). A new gaming console (PlayStation 5/Xbox Series X/Nintendo Switch). Subscribing to multiple streaming services (Netflix Premium, Disney+, HBO Max/Max, Apple TV+).", "itemIcon": "bi-controller", "financialNote": "Hobbies (e.g. musical instruments, sports gear, crafting supplies) start getting dedicated budget lines." }
      ]},
      { "min": 7, "items": [
          { "title": "VIP & Season Tickets", "desc": "VIP packages for concerts and festivals (e.g. Coachella, Glastonbury, Lollapalooza with better viewing areas). Season tickets (with good seats, maybe club level) for your favorite professional sports team. Maybe a membership at a private social or sports club (golf, tennis).", "itemIcon": "bi-patch-check-fill", "luxury": true},
          { "title": "High-End Hobbies & Collections", "desc": "Collecting art (from emerging artists to established names via galleries like Gagosian or White Cube, or art fairs like Art Basel), fine wines, rare whiskies, or vintage guitars (e.g. a '59 Gibson Les Paul). Golf memberships at exclusive clubs. Attending prestigious global events like the Monaco Grand Prix, Wimbledon (Centre Court), the Venice Biennale, or major film festivals.", "itemIcon": "bi-easel3-fill", "luxury": true, "financialNote": "Discretionary spending is significant. May involve auction house relationships (Sotheby's, Christie's)."}
      ]},
      { "min": 10, "items": [
          { "title": "Courtside & Backstage Access", "desc": "Courtside seats at NBA games, front row at Paris Fashion Week (e.g. Chanel, Dior shows). Backstage passes to meet your favorite artists. Attending exclusive A-list events like the Oscars (and the Vanity Fair party), Cannes Film Festival (with premiere access and yacht parties), or the Met Gala.", "itemIcon": "bi-star-fill", "ultraLuxury": true},
          { "title": "Funding the Arts / Owning a Team / Unique Experiences", "desc": "Becoming a significant patron or board member of a major museum (e.g. MoMA, Tate Modern, Louvre), opera (e.g. Metropolitan Opera, Royal Opera House, La Scala), or ballet company. Investing in Broadway shows or independent film production. Maybe even part-ownership of a professional sports franchise. Commissioning private concerts or performances.", "itemIcon": "bi-film", "ultraLuxury": true, "financialNote": "Legacy building through cultural contributions and investments. Access to 'money can't buy' (but often does) experiences."}
      ]}
    ],
    "education": [
      { "min": 0, "items": [
          { "title": "Public Library University", "desc": "The local public library is your campus. Free online courses from platforms like Coursera, edX (audit tracks), Khan Academy for skill-building. YouTube is a primary source for tutorials.", "itemIcon": "bi-lightbulb-fill"},
          { "title": "Self-Taught & Resourceful", "desc": "Learning through podcasts, documentaries, and extensive internet research. Mentorship from experienced friends or colleagues if available. Skill-swapping with peers.", "itemIcon": "bi-search-heart", "financialNote": "Formal education costs are prohibitive without significant aid or loans."}
      ]},
      { "min": 2, "items": [
          { "title": "Community College / In-State Public University", "desc": "Attending a local community college for affordable degrees/certificates or transfer programs. In-state tuition at a public state university, often supplemented by student loans and part-time work.", "itemIcon": "bi-mortarboard-fill"},
          { "title": "Trade Schools & Certifications", "desc": "Focusing on practical skills for specific careers through vocational programs, apprenticeships, or online certifications (e.g., Google Career Certificates, CompTIA, Salesforce Trailhead, local trade qualifications).", "itemIcon": "bi-tools", "financialNote": "Managing student loan debt is a priority. Seeking scholarships and grants."}
      ]},
      { "min": 4, "items": [
          { "title": "Choice of Public or Private University", "desc": "Attending a well-regarded private university or a flagship state university (possibly out-of-state) with a combination of savings, scholarships, and manageable loans. Options like an MBA from a reputable state school or a well-ranked online MBA program (e.g. from University of Illinois Urbana-Champaign, Indiana University Kelley Direct).", "itemIcon": "bi-building-fill-check"},
          { "title": "Continuing Education & Workshops", "desc": "Investing in professional development courses, industry conferences (e.g., INBOUND, CES, Web Summit, specific professional association conferences), and specialized workshops to advance career. Online platforms like LinkedIn Learning, MasterClass, Coursera (paid certificates).", "itemIcon": "bi-graph-up-arrow", "financialNote": "Paying down student loans aggressively. Saving for children's education if applicable."}
      ]},
      { "min": 7, "items": [
          { "title": "Elite Universities & Grad School (Funded)", "desc": "Attending Ivy League or other top-tier universities globally (e.g., Stanford, MIT, Oxbridge, ETH Zurich, INSEAD for MBA) for undergrad or graduate programs (MBA from Harvard/Wharton/Stanford GSB, Law, Medicine) potentially without crippling debt, or fully funded through scholarships or family resources.", "itemIcon": "bi-bank2", "luxury": true},
          { "title": "Private Tutors & Specialized Coaching", "desc": "Hiring tutors (e.g. from agencies like Crimson Education, or independent specialists) for children's challenging subjects or entrance exam prep (e.g. SAT/ACT, 11+). Executive coaching (e.g. from firms like BetterUp, or with renowned independent coaches) for career advancement. Language immersion programs abroad or specialized skill development retreats (e.g. coding bootcamps, culinary schools like Le Cordon Bleu for enthusiasts).", "itemIcon": "bi-person-video3", "luxury": true, "financialNote": "Setting up 529 plans (US) or equivalent educational trusts/savings for children's future education."}
      ]},
      { "min": 10, "items": [
          { "title": "Global Education & Bespoke Learning for Family", "desc": "Sending children to elite international boarding schools (e.g., Le Rosey or Institut auf dem Rosenberg in Switzerland, Eton College or Wycombe Abbey in the UK, Phillips Exeter Academy or Choate Rosemary Hall in the US). Custom-designed educational programs and 'world-schooling' experiences with a team of private tutors. Funding post-doctoral research or passion projects.", "itemIcon": "bi-globe2", "ultraLuxury": true},
          { "title": "University Donations & Endowments, Lifelong Learning", "desc": "Significant philanthropic contributions to alma mater or other prestigious institutions, potentially leading to named buildings, professorships, or entire departments. Funding cutting-edge research. Pursuing personal intellectual interests through private scholarly study, attending exclusive lecture series (e.g. Aspen Ideas Festival, TED conference at a high level).", "itemIcon": "bi-capslock-fill", "ultraLuxury": true, "financialNote": "Establishing educational foundations or trusts for generations. Legacy through intellectual and institutional advancement."}
      ]}
    ],
    "services": [
      { "min": 0, "items": [
          { "title": "The Ultimate DIY-er", "desc": "You cut your own hair (or a family member does), clean your own home, do your own laundry, and are a pro at assembling IKEA furniture solo. Basic car maintenance (oil changes, tire rotations) via online guides. Mending clothes.", "itemIcon": "bi-wrench-adjustable-circle-fill"},
          { "title": "Community Support System", "desc": "Relying on friends and family for help with moves, childcare, or pet-sitting. Bartering skills with neighbors (e.g., tech help for gardening expertise). Utilizing free community services.", "itemIcon": "bi-people", "financialNote": "Paid personal services are a rare luxury, reserved for emergencies."}
      ]},
      { "min": 2, "items": [
          { "title": "Basic Maintenance Services", "desc": "Haircuts at budget chains like Great Clips, Supercuts, or a local barber/salon. Maybe a TaskRabbit or similar gig economy worker for help with a heavy lifting job or basic handyman task once a year.", "itemIcon": "bi-scissors"},
          { "title": "Occasional House Cleaner or Meal Kit", "desc": "Treating yourself to a house cleaning service (e.g., Merry Maids, local independent cleaners, or platform-based like Handy) before a big party or a few times a year. Trying out a meal kit delivery service (e.g. HelloFresh, Blue Apron) for convenience.", "itemIcon": "bi-bucket-fill", "financialNote": "Budgeting for small service conveniences, often as a treat."}
      ]},
      { "min": 4, "items": [
          { "title": "Regular Pampering & Assistance", "desc": "Monthly haircuts and styling at a decent mid-range salon (e.g. Toni&Guy, Vidal Sassoon salon for higher end of this, or reputable local salons). Bi-weekly house cleaning. Lawn care/gardening service during summer. Using food delivery services like DoorDash or Uber Eats more regularly. Dog walking services occasionally.", "itemIcon": "bi-person-arms-up"},
          { "title": "Personal Trainer & Wellness Subscriptions", "desc": "Gym membership at a nicer gym (e.g., Equinox, Virgin Active, David Lloyd Clubs, or a good local boutique fitness studio like F45 or Barry's Bootcamp). Maybe a ClassPass subscription for variety. Regular therapeutic massages. Subscriptions to wellness apps like Headspace or Calm.", "itemIcon": "bi-heart-pulse-fill", "financialNote": "Investing in personal well-being and convenience is becoming standard."}
      ]},
      { "min": 7, "items": [
          { "title": "Concierge Lifestyle Services", "desc": "Personal assistant (part-time or full-time, possibly virtual using services like Time etc or a dedicated EA) for errands, scheduling, and travel planning. Premium spa treatments (e.g. facials, body wraps) at luxury hotel spas (e.g. The Peninsula Spa, Guerlain Spa) or high-end day spas. Personal shopper or stylist for wardrobe updates (e.g., Nordstrom stylist, Selfridges personal shopping, or independent stylists).", "itemIcon": "bi-person-rolodex", "luxury": true},
          { "title": "Household Support Staff", "desc": "Full-time or part-time nanny if you have children. Regular professional landscaping and pool maintenance. Dog walker and mobile pet groomer. Possibly a private chef for some meals or meal prep. Tailor for custom clothing or alterations.", "itemIcon": "bi-house-gear-fill", "luxury": true, "financialNote": "Managing payroll and benefits for domestic staff. Using high-end agencies for staff recruitment."}
      ]},
      { "min": 10, "items": [
          { "title": "Full Estate Management & Bespoke Staff", "desc": "Butler, private chef (e.g., a Le Cordon Bleu graduate or Michelin-experienced), full-time skilled housekeeping staff, groundskeepers, personal security detail (possibly ex-special forces with close protection training). A dedicated estate manager or chief of staff oversees all household operations across multiple properties. Chauffeur already covered in transport.", "itemIcon": "bi-shield-shaded", "ultraLuxury": true},
          { "title": "Bespoke Global Concierge & Lifestyle Management", "desc": "Access to world-class, high-end concierge services (e.g., Quintessentially, Ten Lifestyle Group, Knightsbridge Circle, or a private family office with dedicated lifestyle managers). 24/7 support for any request imaginable, from chartering a superyacht, sourcing rare Hermès Birkins or Patek Philippe watches, to organizing exclusive multi-million dollar parties or private island buyouts.", "itemIcon": "bi-headset", "ultraLuxury": true, "financialNote": "Services budget is a significant portion of overall expenses, often involving international contracts and complex logistics. Discretion and NDAs are standard."}
      ]}
    ]
  }
}