{
  "incomeBrackets": [
    {
      "income": 20000,
      "label": "Working Poor",
      "description": "It's a grind. Every dollar is stretched. Instant noodles are practically a currency."
    },
    {
      "income": 30000,
      "label": "Low Income",
      "description": "Budgeting is an art form. A night out for pizza is a rare, celebrated event."
    },
    {
      "income": 50000,
      "label": "Lower Middle Class",
      "description": "Essentials are covered, maybe a concert ticket. Saving is tough but not impossible."
    },
    {
      "income": 75000,
      "label": "Middle Class",
      "description": "Comfortable, but mindful of spending. Starting to build that nest egg and a 401k."
    },
    {
      "income": 100000,
      "label": "Upper Middle Class",
      "description": "Life's pretty good! More treats, less stress. Investments are growing."
    },
    {
      "income": 150000,
      "label": "Affluent",
      "description": "Enjoying the finer things. Weekend getaways and nice dinners are regular occurrences."
    },
    {
      "income": 200000,
      "label": "High Income",
      "description": "Luxury choices become normal. Shopping at upscale department stores without wincing!"
    },
    {
      "income": 300000,
      "label": "Wealthy",
      "description": "Premium experiences are the standard. Your financial advisor is a good friend."
    },
    {
      "income": 500000,
      "label": "Very Wealthy",
      "description": "Elite living. 'Fly commercial or private?' is a genuine dilemma."
    },
    {
      "income": 750000,
      "label": "Ultra High Net Worth",
      "description": "Exclusive access. Your hobbies sound like movie plots."
    },
    {
      "income": 1000000,
      "label": "Millionaire",
      "description": "Congrats, you made it! Now, the fun part: smart allocation and enjoying the fruits."
    },
    {
      "income": 2000000,
      "label": "Multi-Millionaire",
      "description": "Private jet for a quick European city break? Sure, why not."
    },
    {
      "income": 5000000,
      "label": "Ultra Wealthy",
      "description": "The world is your playground. You might own the company that makes the playground equipment."
    },
    {
      "income": 10000000,
      "label": "Ultra Elite",
      "description": "Your biggest worry? Which continent for the summer. Philanthropy becomes a significant focus."
    },
    {
      "income": 25000000,
      "label": "Billionaire Class",
      "description": "Price tags are suggestions. Next stop: influencing global change (or funding space exploration)."
    }
  ],
  "lifestyleData": {
    "dining": [
      {
        "min": 0,
        "items": [
          {
            "title": "Home Cook Hero (by necessity!)",
            "desc": "Pasta, rice, beans are staples. Supermarket generic brands are gold. A rare splurge: a $5 pizza from Little Caesars or Domino's, or a local takeaway.",
            "itemIcon": "bi-cart4",
            "financialNote": "Focus is on day-to-day survival; covering essential bills is the priority. Savings are aspirational, typically for very short-term emergencies if possible. Little to no capacity for formal investment or long-term financial planning."
          },
          {
            "title": "Grocery Ninja",
            "desc": "$150-200/month (or local equivalent). Couponing isn't just a hobby, it's a survival skill. Eating out is a distant dream.",
            "itemIcon": "bi-scissors",
            "financialNote": "Financial mindset is heavily geared towards maximizing every dollar for immediate needs. Debt management for essentials (like medical bills or car repairs) can be a major concern. Access to credit is often limited and expensive."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Casual Eats & Local Diners",
            "desc": "Hitting up a local diner or a casual chain like Applebee's, Chili's (North America), or Nando's (UK/International) a few times a month. You know the happy hour specials.",
            "itemIcon": "bi-cup-straw",
            "financialNote": "Building an emergency fund (aiming for 3-6 months of expenses) is a primary goal. Beginning to contribute to employer-sponsored retirement plans (e.g., 401k, pension) if available, or starting a basic IRA. Initial investments likely in target-date funds or broad market index funds (e.g., S&P 500 - VOO, Total Stock Market - VTI)."
          },
          {
            "title": "Smart Grocery Runs",
            "desc": "$400/month (or local equivalent) at large supermarket chains (e.g., Kroger, Tesco, Carrefour, Woolworths). Maybe some organic produce if it's on sale.",
            "itemIcon": "bi-basket3-fill",
            "financialNote": "Learning about budgeting apps and basic financial literacy is common. Focus on reducing high-interest debt (credit cards, personal loans). Savings goals might include a down payment for a car or future education costs."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "Foodie Adventures",
            "desc": "Weekly dinners at popular local restaurants or trendy food halls. Craft beers at a local microbrewery. Exploring different cuisines.",
            "itemIcon": "bi-emoji-sunglasses-fill",
            "financialNote": "Aiming to max out tax-advantaged retirement accounts (401k, IRA). Building a diversified portfolio in taxable brokerage accounts with low-cost index funds covering US large/small cap and international stocks. Asset allocation becomes a conscious decision. May start contributing to 529 plans for children's education or HSAs for healthcare."
          },
          {
            "title": "Premium Pantry Stocking",
            "desc": "$600+/month (or local equivalent). Regular trips to Whole Foods Market, Marks & Spencer Foodhall, Waitrose, or local organic markets. You invest in the good olive oil and artisanal bread.",
            "itemIcon": "bi-shop",
            "financialNote": "Portfolio grows beyond $50K-$100K. Thinking about longer-term goals like home ownership or significant travel. May explore robo-advisors for automated investment management. Understanding of investment fees and expense ratios becomes important."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "Fine Dining Connoisseur",
            "desc": "Regular reservations at Michelin-starred or equivalent top-rated local restaurants (e.g., those listed in World's 50 Best). Wine pairings are non-negotiable.",
            "itemIcon": "bi-award",
            "financialNote": "Portfolio typically exceeds $500K. Focus shifts to optimizing tax efficiency: strategic asset location (e.g., growth stocks in taxable accounts, bonds/REITs in tax-deferred accounts), tax-loss harvesting. May engage a dedicated financial advisor for comprehensive planning. Considering individual stock investments or more specialized ETFs."
          },
          {
            "title": "Gourmet Home Experience",
            "desc": "$1500+/month on food & wine. Shopping at specialty food stores (e.g., Eataly, Dean & DeLuca style gourmet shops, local fromageries and butchers). Perhaps a high-end La Cornue, Wolf, or Gaggenau range.",
            "itemIcon": "bi-gem",
            "financialNote": "Exploring alternative investments like rental real estate (e.g., a first rental property) to diversify income streams. Understanding of capital gains tax and estate planning basics begins. Portfolio allocation becomes more customized based on risk tolerance and long-term goals beyond just retirement."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "Private Chef & Exclusive Tables",
            "desc": "Personal chef for special occasions or weekly meal prep. Access to private dining rooms at globally renowned establishments like Noma (Copenhagen), The French Laundry (Yountville), Osteria Francescana (Modena) (by reservation months/years in advance).",
            "itemIcon": "bi-person-badge",
            "luxury": true,
            "financialNote": "Portfolio typically $1.5M-$5M+. Managing substantial assets requires vigilance against becoming overly risk-averse despite market volatility. Developing multiple income streams (rental properties, small business investments, angel investing) is common. Sophisticated tax planning, including strategies for charitable giving and wealth transfer (trusts, gifting), becomes critical. May diversify into hedge funds or private equity opportunities."
          },
          {
            "title": "Curated Wine Cellar",
            "desc": "Investing in rare and fine wines (e.g., Bordeaux First Growths, Grand Cru Burgundy, cult Napa Cabernets like Screaming Eagle), possibly with a consultant from Sotheby's or Christie's. Trips to Napa, Tuscany, or Bordeaux for 'research' and vineyard tours.",
            "itemIcon": "bi-slack",
            "luxury": true,
            "financialNote": "For portfolios $5M+, personally managing all income streams may be inefficient. Estate planning, including trust formation (e.g., revocable living trusts, ILITs) and philanthropic strategies (e.g., donor-advised funds, private foundations) are key focuses. May work with a multi-family office or a dedicated team of advisors (CPA, estate attorney, investment manager). Consideration of international investments and global tax implications."
          }
        ]
      }
    ],
    "housing": [
      {
        "min": 0,
        "items": [
          {
            "title": "Roommate Shuffle",
            "desc": "Renting a room in an older building in a less central part of town, or a shared flat. Fingers crossed for compatible roommates!",
            "itemIcon": "bi-person-plus-fill",
            "financialNote": "Rent is a major monthly expense, often taking 30-50%+ of income. Focus on meeting basic needs. Credit score building is difficult but crucial for future housing options. Minimal savings, often depleted by unexpected expenses."
          },
          {
            "title": "Furniture Finds",
            "desc": "Mostly thrift store treasures, Facebook Marketplace finds, or generous hand-me-downs. You're a DIY wizard with YouTube tutorials.",
            "itemIcon": "bi-magic",
            "financialNote": "Financial stability is fragile. Any savings are typically for immediate, tangible needs rather than long-term investments. Access to affordable credit is a significant challenge."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Your Own Cozy Corner",
            "desc": "Studio or 1BR apartment in a decent, accessible neighborhood. Small, but all yours!",
            "itemIcon": "bi-key-fill",
            "financialNote": "Saving for a down payment on a future property seems like a distant mountain but might be a long-term aspiration. Primary financial goal is building a solid emergency fund and consistently contributing to retirement accounts (e.g., 401k to get employer match, Roth IRA)."
          },
          {
            "title": "IKEA & Target Style",
            "desc": "Assembling flat-pack furniture is a rite of passage. That IKEA KALLAX shelf or BILLY bookcase is a global icon for a reason. Maybe some affordable pieces from Target, Kmart, or Wayfair.",
            "itemIcon": "bi-box-seam",
            "financialNote": "Budgeting for rent, utilities, and debt repayment. Starting to invest small amounts regularly into low-cost index funds within retirement accounts. Financial education focuses on compound interest and long-term growth."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "Homeownership Horizons",
            "desc": "Eyeing a modest starter home, apartment, or townhome in a family-friendly suburb or an up-and-coming city neighborhood.",
            "itemIcon": "bi-house-add-fill",
            "financialNote": "Mortgage, property taxes, insurance, and possibly HOA fees become significant new expenses. Actively managing cash flow is important. Focus on increasing retirement contributions and building equity in the home. Portfolio includes diverse index funds across asset classes in both tax-advantaged and taxable accounts."
          },
          {
            "title": "Mid-Range Furniture Upgrade",
            "desc": "Upgrading furniture. Maybe a brand-new couch from a mid-range store like West Elm, CB2, Pottery Barn, John Lewis, or Habitat. Investing in better quality mattresses and linens.",
            "itemIcon": "bi-display",
            "financialNote": "Financial planning includes managing a mortgage alongside other investments. May start to explore slightly more complex investments or refine asset allocation. Emergency fund needs to be robust to cover potential home repairs."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "Luxury Living",
            "desc": "A spacious, well-appointed home in a desirable neighborhood, or a luxury condo/apartment with amenities (gym, pool, concierge) in the city center. Heated bathroom floors, smart home features (e.g., Nest, Philips Hue), and high-end finishes.",
            "itemIcon": "bi-house-heart-fill",
            "financialNote": "Real estate becomes a significant asset class. Tax strategies related to homeownership (mortgage interest deduction, property tax considerations) are relevant. Portfolio is well-diversified, possibly including some individual stock positions or sector-specific ETFs. Wealth management includes tax optimization and early thoughts on estate planning."
          },
          {
            "title": "Designer Touches & Renovations",
            "desc": "Working with an interior designer. Custom cabinetry from brands like Poggenpohl, Smallbone, or Boffi. Investing in original art. That dream kitchen with Sub-Zero, Wolf, or Miele appliances is happening.",
            "itemIcon": "bi-palette2",
            "financialNote": "Considering leverage (e.g., HELOC) for further investments or large expenses strategically. Financial advisor likely involved in comprehensive wealth planning, including investment management, tax planning, and insurance needs. Investment in appreciating assets like art might begin."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "Multiple Luxury Properties",
            "desc": "Primary residence in an exclusive enclave. A ski chalet, a beach house, perhaps a country estate or a city pied-à-terre. These properties are often in different countries.",
            "itemIcon": "bi-houses-fill",
            "luxury": true,
            "financialNote": "Complex property management, international tax considerations, and currency exposure become important. Estate planning is crucial for transferring multiple high-value assets. Portfolio is highly diversified, including alternative investments like private equity, hedge funds, and collectibles. Philanthropic goals often formalized."
          },
          {
            "title": "Custom Architecture & Staff",
            "desc": "Commissioning a renowned architect for a bespoke home. Full-time household staff including a house manager, private chef, nannies, housekeepers, and security detail.",
            "itemIcon": "bi-people-fill",
            "ultraLuxury": true,
            "financialNote": "Significant portion of wealth may be tied to real estate and illiquid assets. Requires sophisticated cash flow management and potentially a family office to manage finances, investments, legal affairs, and household operations. Asset protection strategies are paramount."
          }
        ]
      }
    ],
    "transportation": [
      {
        "min": 0,
        "items": [
          {
            "title": "Public Transit Pro",
            "desc": "You've mastered the local bus, subway/tram, or train system. Walking and a trusty (if rusty) bike are your companions. You know all the off-peak fares.",
            "itemIcon": "bi-bus-front-fill",
            "financialNote": "Transportation costs are minimized out of necessity. No car payments, insurance, or significant maintenance. Any savings are prioritized for more critical needs. Investments are not feasible."
          },
          {
            "title": "The 'Character' Car",
            "desc": "If you own a car, it's an older, high-mileage model that cost very little. Gas/petrol, insurance, and unexpected repairs are major budget items that can derail finances.",
            "itemIcon": "bi-cone",
            "financialNote": "Car ownership is a significant financial burden. Focus on keeping it running affordably. Difficulty building savings due to unpredictable car expenses. No capacity for investment."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Reliable Used Wheels",
            "desc": "A dependable used Honda Civic, Toyota Corolla, VW Golf/Polo. Focus on fuel efficiency and reliability.",
            "itemIcon": "bi-car-front",
            "financialNote": "Car payments or savings for a car are a manageable line item. Building an emergency fund and contributing to retirement (e.g., 401k, IRA with index funds like VOO/VTI) are parallel financial goals."
          },
          {
            "title": "Ride-Share Regular",
            "desc": "Using Uber/Lyft/Bolt/Grab for nights out, airport runs, or after a few drinks.",
            "itemIcon": "bi-phone-fill",
            "financialNote": "Transportation costs are variable but budgeted. Allows for continued focus on core savings and investment goals like retirement accounts and emergency funds. Understanding of total cost of car ownership vs. alternatives."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "That New(ish) Car Scent",
            "desc": "A new, practical car like a Subaru Outback/Forester, Honda CR-V, Toyota RAV4, Mazda CX-5, VW Tiguan, or Nissan Qashqai. Maybe an entry-level EV.",
            "itemIcon": "bi-stars",
            "financialNote": "Managing car loan while maxing out retirement accounts (401k, IRA) and contributing to taxable brokerage accounts. Portfolio diversified with US/international index funds. Considering total cost of ownership and depreciation."
          },
          {
            "title": "Worry-Free Maintenance",
            "desc": "Regular dealer services, comprehensive insurance. That check engine light causes less panic. Perhaps an extended warranty.",
            "itemIcon": "bi-shield-lock-fill",
            "financialNote": "Leasing vs. buying becomes a strategic financial decision, weighing cash flow, depreciation, and long-term cost. Investments continue to grow in diversified index funds."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "Luxury Commuting",
            "desc": "Driving a Tesla Model Y/S/3 Performance, BMW X5/5 Series, Audi Q7/A6, Mercedes-Benz GLE/E-Class, Range Rover Sport, or a Porsche Macan/Cayenne.",
            "itemIcon": "bi-speedometer",
            "financialNote": "Vehicle depreciation is a known factor in overall net worth calculations. Portfolio is substantial, with tax efficiency (asset location, tax-loss harvesting) being a key concern. May work with a financial advisor for holistic wealth management, including optimizing large purchases."
          },
          {
            "title": "The Two-Car (or more) Household",
            "desc": "A practical luxury daily driver plus a 'fun' weekend car – perhaps a Porsche Boxster/Cayman, a Ford Mustang GT, or a classic sports car.",
            "itemIcon": "bi-ev-station-fill",
            "luxury": true,
            "financialNote": "Multiple vehicle expenses are managed within a larger discretionary budget. Investment strategy includes diverse assets, possibly some direct real estate or more active stock management. Tax planning is more complex."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "Exotic Car Collection",
            "desc": "Ferraris, Lamborghinis, McLarens. Maybe a bespoke Rolls-Royce or Bentley. Climate-controlled garage is a must.",
            "itemIcon": "bi-trophy-fill",
            "ultraLuxury": true,
            "financialNote": "Cars may be treated as collectible assets, though often depreciating. Wealth management involves managing a diverse portfolio of traditional and alternative investments (private equity, hedge funds). Advanced estate planning and asset protection strategies are in place."
          },
          {
            "title": "Private Driver / Chauffeur",
            "desc": "Full-time chauffeur for daily transport in a luxury sedan or SUV. Never worry about parking or traffic again.",
            "itemIcon": "bi-person-vcard",
            "ultraLuxury": true,
            "financialNote": "Managing household staff payroll and expenses. Financial decisions are often made with a team of advisors (family office, private banker, CPA). Focus on wealth preservation, intergenerational wealth transfer, and philanthropy."
          }
        ]
      }
    ],
    "travel": [
      {
        "min": 0,
        "items": [
          {
            "title": "Staycation Pro",
            "desc": "Exploring local parks, free museum days, and nearby nature trails. Camping in state/national parks or local campsites is the annual big adventure.",
            "itemIcon": "bi-geo-alt-fill",
            "financialNote": "Travel budget is virtually non-existent. Focus on free or extremely low-cost local activities. Savings are for emergencies, not leisure. No investment capacity."
          },
          {
            "title": "Roadtrip Co-Pilot",
            "desc": "Chipping in for gas/petrol if a friend with a car is heading to a nearby city, beach, or natural attraction. You bring the snacks and make the playlist!",
            "itemIcon": "bi-pin-map-fill",
            "financialNote": "Leisure travel is a rare treat, funded by careful short-term saving if at all. Primary financial concerns are meeting essential living expenses."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Budget Domestic Explorer",
            "desc": "Annual flight on a budget airline like Spirit, Ryanair, EasyJet, or Southwest. Weekend trips to nearby cities. Staying in budget hotels or well-rated hostels.",
            "itemIcon": "bi-airplane-engines-fill",
            "financialNote": "Travel is budgeted carefully, often saved for over months. Core financial focus remains on building an emergency fund and making initial contributions to retirement accounts (401k, IRA) with simple index funds."
          },
          {
            "title": "Regional Escapes",
            "desc": "Driving to nearby attractions, national parks, or smaller cities for a weekend. Camping is still a favorite and cost-effective option, maybe upgrading to a cabin rental.",
            "itemIcon": "bi-image-alt",
            "financialNote": "Balancing small travel goals with consistent saving and investing for long-term security. Learning to use travel rewards or points from credit cards might begin."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "International Adventures Begin",
            "desc": "First trips to popular international destinations like Mexico, Canada, or a well-planned week in a major European city, likely staying in Airbnbs, boutique hotels, or mid-range hotels.",
            "itemIcon": "bi-globe-americas",
            "financialNote": "Travel becomes a regular budget item. Retirement accounts (401k/IRA) are being maxed out or close to it. Taxable investment accounts are growing with a diversified portfolio of index funds (US, international, possibly some bonds)."
          },
          {
            "title": "Comfortable Domestic Travel",
            "desc": "Flying major airlines, staying in reputable mid-tier hotels like Hilton, Marriott. Maybe a ski trip, a beach vacation, or exploring national parks in more comfort.",
            "itemIcon": "bi-suitcase-lg-fill",
            "financialNote": "Financial planning incorporates travel goals alongside long-term wealth accumulation. Asset allocation in investment portfolio is reviewed periodically. Using travel rewards credit cards strategically is common."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "Business Class & Luxury Resorts",
            "desc": "Flying business class internationally. Staying at 5-star resorts and hotels. Maybe a luxury cruise line.",
            "itemIcon": "bi-passport-fill",
            "luxury": true,
            "financialNote": "Discretionary spending on travel is significant. Investment portfolio typically exceeds $500K-$1M, managed for growth and tax efficiency (asset location, tax-loss harvesting). Financial advisor helps align travel spending with long-term wealth preservation and growth goals."
          },
          {
            "title": "Adventure & Experiential Travel",
            "desc": "Safaris in Africa, exploring Patagonia, cultural immersion in Japan. Unique, curated experiences are prioritized, possibly through high-end tour operators.",
            "itemIcon": "bi-compass-fill",
            "luxury": true,
            "financialNote": "Wealth allows for unique experiences. Financial plan includes managing cash flow for large travel expenditures while ensuring diverse investment portfolio continues to grow. May involve managing foreign currency for travel or property abroad."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "First Class & Private Aviation",
            "desc": "Flying first class suites or using fractional ownership/chartering private jets.",
            "itemIcon": "bi-send-check-fill",
            "ultraLuxury": true,
            "financialNote": "Travel decisions are unconstrained by cost. Focus is on convenience, privacy, and experience. Wealth management involves a team of professionals handling complex investments (private equity, hedge funds), international tax law, estate planning (trusts, foundations), and often philanthropic activities."
          },
          {
            "title": "World-Circling Itineraries & Unique Stays",
            "desc": "Extended trips to multiple continents, private jet world tours, owning multiple vacation homes globally, private yacht charters.",
            "itemIcon": "bi-globe-europe-africa",
            "ultraLuxury": true,
            "financialNote": "Management of a global asset portfolio. Sophisticated strategies for currency risk, geopolitical risk, and cross-border taxation. Intergenerational wealth transfer and legacy planning are primary concerns. A family office may oversee all financial, legal, and personal affairs."
          }
        ]
      }
    ],
    "entertainment": [
      {
        "min": 0,
        "items": [
          {
            "title": "Free Fun Seeker",
            "desc": "Public library, free local concerts, hiking. Streaming via 'borrowed' accounts or ad-supported tiers.",
            "itemIcon": "bi-headphones",
            "financialNote": "Entertainment is strictly limited to free or near-free options. No budget for paid entertainment. Financial focus is solely on essential needs. No savings or investments."
          },
          {
            "title": "DIY Entertainment",
            "desc": "Drawing, writing, learning from YouTube. Board games with friends. Imagination is key.",
            "itemIcon": "bi-brush-fill",
            "financialNote": "Personal finance revolves around making ends meet. Any 'extra' money goes to necessities or paying down urgent debt. Long-term financial planning is a luxury."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Local Gigs & Movies",
            "desc": "Catching a local band, movies at matinee prices. A couple of basic streaming services.",
            "itemIcon": "bi-ticket-detailed-fill",
            "financialNote": "Small, planned entertainment expenses. Core financial strategy: building an emergency fund, starting retirement savings (401k/IRA) with diversified low-cost index funds (e.g. VOO, VTI), and managing any consumer debt."
          },
          {
            "title": "Social Outings",
            "desc": "Meeting friends for happy hour. Bowling, local amateur sports, trivia nights.",
            "itemIcon": "bi-megaphone-fill",
            "financialNote": "Entertainment is budgeted but secondary to savings and investment goals. Financial literacy includes understanding basic investment principles and the power of compounding in retirement accounts."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "Major Concerts & Sporting Events",
            "desc": "Tickets to see major artists or pro sports. Maybe a local ski pass.",
            "itemIcon": "bi-boombox-fill",
            "financialNote": "Entertainment budget allows for higher-cost experiences. Retirement accounts (401k/IRA) are being consistently funded, aiming for max contributions. Taxable brokerage accounts are growing, holding a diversified mix of US and international index funds."
          },
          {
            "title": "Quality Home Entertainment",
            "desc": "Good 4K TV, sound system (Sonos, Bose), new gaming console. Multiple streaming subscriptions.",
            "itemIcon": "bi-controller",
            "financialNote": "Financial planning integrates discretionary spending with robust investment strategy. Asset allocation is reviewed, possibly considering long-term care or college savings (529 plans) more seriously."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "VIP & Season Tickets",
            "desc": "VIP packages for concerts/festivals. Season tickets for pro sports. Private social/sports club memberships.",
            "itemIcon": "bi-patch-check-fill",
            "luxury": true,
            "financialNote": "Significant discretionary spending on entertainment. Investment portfolio is substantial and professionally managed or self-managed with a focus on tax efficiency (asset location, tax-loss harvesting). May include direct real estate or alternative investments."
          },
          {
            "title": "High-End Hobbies & Collections",
            "desc": "Collecting art, fine wines, vintage guitars. Golf memberships at exclusive clubs. Attending prestigious global events.",
            "itemIcon": "bi-easel3-fill",
            "luxury": true,
            "financialNote": "Hobbies may become alternative asset classes (art, wine). Financial advisor helps balance lifestyle spending with wealth growth, tax optimization, and estate planning. Portfolio diversification is key."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "Courtside & Backstage Access",
            "desc": "Courtside seats, front row at fashion week, backstage passes. Attending A-list events like Oscars, Cannes, Met Gala.",
            "itemIcon": "bi-star-fill",
            "ultraLuxury": true,
            "financialNote": "Entertainment and networking are intertwined. Complex financial picture managed by a team (family office/private bank), focusing on wealth preservation, bespoke investment opportunities (private equity, venture capital), philanthropic endeavors, and complex trust/estate structures."
          },
          {
            "title": "Funding the Arts / Owning a Team / Unique Experiences",
            "desc": "Significant patron of major cultural institutions, investing in Broadway/film, part-ownership of sports franchise. Commissioning private concerts.",
            "itemIcon": "bi-film",
            "ultraLuxury": true,
            "financialNote": "Legacy building through cultural and business investments. Financial strategy involves managing highly diversified global portfolios, dealing with illiquid assets, and executing sophisticated philanthropic and intergenerational wealth transfer plans."
          }
        ]
      }
    ],
    "education": [
      {
        "min": 0,
        "items": [
          {
            "title": "Public Library University",
            "desc": "Local library, free online courses (Coursera audit, Khan Academy). YouTube tutorials.",
            "itemIcon": "bi-lightbulb-fill",
            "financialNote": "Education is pursued through free resources due to financial constraints. No capacity for paid courses or degrees without significant aid. Focus is on immediate job skills if possible."
          },
          {
            "title": "Self-Taught & Resourceful",
            "desc": "Learning via podcasts, documentaries, internet research. Mentorship if available. Skill-swapping.",
            "itemIcon": "bi-search-heart",
            "financialNote": "Financial situation dictates reliance on free educational materials. Formal education costs are prohibitive. Any savings are for dire emergencies, not skill development."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Community College / In-State Public University",
            "desc": "Affordable local degrees/certificates or state university with loans/part-time work.",
            "itemIcon": "bi-mortarboard-fill",
            "financialNote": "Managing student loan debt is a key financial concern. Balancing education costs with starting emergency fund and initial retirement contributions (e.g. 401k with employer match, basic IRA with VOO/VTI)."
          },
          {
            "title": "Trade Schools & Certifications",
            "desc": "Practical skills via vocational programs, apprenticeships, online certs (Google, CompTIA).",
            "itemIcon": "bi-tools",
            "financialNote": "Investing in skills for better earning potential. Financial planning involves debt management (student loans) and consistent, albeit small, investments for the long term in diversified index funds."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "Choice of Public or Private University",
            "desc": "Well-regarded private or flagship state university with savings/scholarships/manageable loans. MBA from state school or online.",
            "itemIcon": "bi-building-fill-check",
            "financialNote": "Paying down student loans aggressively while maxing out retirement accounts (401k, IRA). Building taxable investment portfolio with diverse index funds. Starting 529 plans for children's education."
          },
          {
            "title": "Continuing Education & Workshops",
            "desc": "Investing in professional development courses, industry conferences, specialized workshops. LinkedIn Learning, MasterClass.",
            "itemIcon": "bi-graph-up-arrow",
            "financialNote": "Education is an investment in human capital. Financial plan balances current education expenses with long-term wealth accumulation through diversified investments and tax-advantaged accounts."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "Elite Universities & Grad School (Funded)",
            "desc": "Attending Ivy League or top-tier global universities (Stanford, MIT, Oxbridge, INSEAD) for undergrad/grad, potentially without crippling debt.",
            "itemIcon": "bi-bank2",
            "luxury": true,
            "financialNote": "Education costs are manageable within overall wealth. Investment portfolio typically >$500k, managed for growth and tax efficiency (asset location, tax-loss harvesting). Focus on funding children's elite education fully, possibly with 529 plans or trusts. Financial advisor assists with long-term financial planning."
          },
          {
            "title": "Private Tutors & Specialized Coaching",
            "desc": "Hiring tutors for children (SAT/ACT prep), executive coaching, language immersion abroad, specialized skill retreats.",
            "itemIcon": "bi-person-video3",
            "luxury": true,
            "financialNote": "Significant investment in personal and family development. Financial plan includes sophisticated investment strategies, tax planning, and early-stage estate planning. May involve setting up educational trusts."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "Global Education & Bespoke Learning for Family",
            "desc": "Children attend elite international boarding schools (Le Rosey, Eton). Custom educational programs, 'world-schooling' with private tutors.",
            "itemIcon": "bi-globe2",
            "ultraLuxury": true,
            "financialNote": "Education is a means of providing global opportunities and intellectual enrichment, unconstrained by cost. Wealth managed by family office or team of advisors, focusing on intergenerational wealth transfer, philanthropic endowments to educational institutions, and complex trust structures."
          },
          {
            "title": "University Donations & Endowments, Lifelong Learning",
            "desc": "Significant philanthropic contributions to alma mater/prestigious institutions (named buildings/programs). Funding research. Pursuing personal intellectual interests via private scholarly study, exclusive lecture series.",
            "itemIcon": "bi-capslock-fill",
            "ultraLuxury": true,
            "financialNote": "Legacy building through educational philanthropy. Financial strategies involve managing large endowments, foundations, and ensuring long-term growth of assets dedicated to educational causes. Complex international tax and legal considerations."
          }
        ]
      }
    ],
    "services": [
      {
        "min": 0,
        "items": [
          {
            "title": "The Ultimate DIY-er",
            "desc": "Cutting own hair, cleaning own home, DIY repairs. Mending clothes.",
            "itemIcon": "bi-wrench-adjustable-circle-fill",
            "financialNote": "All services are self-performed to save money. No budget for paid services. Focus on meeting essential needs. No savings or investments."
          },
          {
            "title": "Community Support System",
            "desc": "Relying on friends/family for moves, childcare, pet-sitting. Bartering skills. Utilizing free community services.",
            "itemIcon": "bi-people",
            "financialNote": "Financial situation necessitates leveraging community and personal networks for support instead of paid services. Any 'extra' money goes to critical needs."
          }
        ]
      },
      {
        "min": 2,
        "items": [
          {
            "title": "Basic Maintenance Services",
            "desc": "Budget haircuts (Great Clips). Occasional TaskRabbit for heavy lifting or basic handyman task.",
            "itemIcon": "bi-scissors",
            "financialNote": "Very limited use of paid services, usually for essential maintenance. Primary financial strategy: building emergency fund, starting retirement savings (401k/IRA with simple index funds like VOO/VTI), managing debt."
          },
          {
            "title": "Occasional House Cleaner or Meal Kit",
            "desc": "House cleaning as a rare treat. Trying a meal kit delivery service (HelloFresh, Blue Apron) for convenience.",
            "itemIcon": "bi-bucket-fill",
            "financialNote": "Services are a budgeted treat, not a regular expense. Focus on long-term financial goals like consistent investing in low-cost, diversified funds and debt reduction."
          }
        ]
      },
      {
        "min": 4,
        "items": [
          {
            "title": "Regular Pampering & Assistance",
            "desc": "Monthly mid-range salon haircuts. Bi-weekly house cleaning. Lawn care. Regular food delivery (DoorDash, Uber Eats). Occasional dog walker.",
            "itemIcon": "bi-person-arms-up",
            "financialNote": "Services for convenience and time-saving become regular budget items. Retirement accounts (401k/IRA) are consistently funded, aiming for max. Taxable investments grow with diversified index funds. Cash flow management is key."
          },
          {
            "title": "Personal Trainer & Wellness Subscriptions",
            "desc": "Nicer gym membership (Equinox, Virgin Active), boutique fitness (F45). ClassPass. Regular massages. Wellness apps (Headspace, Calm).",
            "itemIcon": "bi-heart-pulse-fill",
            "financialNote": "Investing in personal well-being is standard. Financial plan balances these expenses with robust savings and investment strategy, including maxing tax-advantaged accounts and growing taxable portfolio."
          }
        ]
      },
      {
        "min": 7,
        "items": [
          {
            "title": "Concierge Lifestyle Services",
            "desc": "Personal assistant (part/full-time, virtual). Premium spa treatments. Personal shopper/stylist.",
            "itemIcon": "bi-person-rolodex",
            "luxury": true,
            "financialNote": "Outsourcing tasks to save time and improve quality of life. Investment portfolio typically >$500k-$1M, focused on growth and tax efficiency (asset location, tax-loss harvesting). Financial advisor often helps integrate lifestyle service costs into comprehensive wealth plan."
          },
          {
            "title": "Household Support Staff",
            "desc": "Full/part-time nanny. Regular professional landscaping, pool maintenance. Dog walker, mobile pet groomer. Private chef for some meals.",
            "itemIcon": "bi-house-gear-fill",
            "luxury": true,
            "financialNote": "Managing payroll for domestic staff. Financial planning involves sophisticated investment management, tax optimization, and potentially early estate planning considerations. Portfolio likely includes real estate and other alternatives."
          }
        ]
      },
      {
        "min": 10,
        "items": [
          {
            "title": "Full Estate Management & Bespoke Staff",
            "desc": "Butler, private chef, full-time skilled housekeeping, groundskeepers, personal security. Estate manager/chief of staff oversees operations.",
            "itemIcon": "bi-shield-shaded",
            "ultraLuxury": true,
            "financialNote": "Significant operational expenses for household management. Wealth managed by family office or team of advisors, focusing on preserving and growing substantial assets across global markets, complex trust and estate planning, and often significant philanthropic activities."
          },
          {
            "title": "Bespoke Global Concierge & Lifestyle Management",
            "desc": "Access to high-end concierge services (Quintessentially, Ten Lifestyle Group) for any request: yacht charters, sourcing rare items, exclusive event access.",
            "itemIcon": "bi-headset",
            "ultraLuxury": true,
            "financialNote": "Lifestyle services are integral to managing a complex, global life. Financial strategy involves managing vast, diversified portfolios, often with illiquid and alternative assets, intricate international tax and legal structures, and ensuring intergenerational wealth transfer and legacy goals are met."
          }
        ]
      }
    ]
  }
}
