{
  "traditionName": "Orthodox",
  "serviceOrder": [
    {
      "id": "candle_lighting",
      "name_en": "Candle Lighting",
      "name_he": "הַדְלָקַת נֵרוֹת",
      "summary": "Marks the start of Shabbat, primarily a home ritual performed before sunset.",
      "details": {
        "background": "While central to Shabbat observance, candle lighting is traditionally performed in the home just before Shabbat begins, not typically part of the synagogue service itself, though the blessing might be referenced.",
        "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר שֶׁל שַׁבָּת.",
        "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu l'hadlik ner shel Shabbat.",
        "full_text_en_translate": "Blessed are You, LORD our God, King of the universe, Who has sanctified us with His commandments and commanded us to kindle the light of Shabbat.",
        "notes": "Primarily a home observance before services commence. Typically performed by women 18 minutes before sunset, followed by men's acceptance of Shabbat in synagogue."
      }
    },
    {
      "id": "kabbalat_shabbat_psalms",
      "name_en": "Kabbalat Shabbat Psalms",
      "name_he": "מִזְמוֹרֵי קַבָּלַת שַׁבָּת",
      "summary": "The traditional six Psalms (95-99, 29) welcoming Shabbat.",
      "details": {
        "background": "The standard, full sequence of six psalms, reflecting the six days of creation, is recited or chanted according to the community's nusach (musical tradition).",
        "full_text_he": "(Psalms 95, 96, 97, 98, 99, 29)",
        "notes": "Full recitation is standard practice. Some communities add 'Mizmor L'Todah' (Psalm 100) when erev Shabbat coincides with Rosh Chodesh."
      }
    },
    {
      "id": "lecha_dodi",
      "name_en": "Lecha Dodi",
      "name_he": "לְכָה דוֹדִי",
      "summary": "The 16th-century mystical poem greeting Shabbat as a Bride/Queen.",
      "details": {
        "background": "Recited or sung in its entirety. The custom of rising and turning toward the door (or the back of the synagogue) for the final stanza ('Bo'i Kallah') is widespread.",
        "full_text_he": "לְכָה דוֹדִי לִקְרַאת כַּלָּה, פְּנֵי שַׁבָּת נְקַבְּלָה...",
        "full_text_en_translit": "Lecha Dodi likrat kallah, p'nei Shabbat n'kab'lah...",
        "full_text_en_translate": "Come, my Beloved, to greet the Bride; let us welcome the presence of Shabbat...",
        "notes": "Verse count varies between Sephardic (8 stanzas) and Ashkenazi (9 stanzas) traditions."
      }
    },
    {
      "id": "psalm_92_93",
      "name_en": "Psalm 92 & 93",
      "name_he": "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת",
      "summary": "Psalm for the Sabbath Day, often followed by Psalm 93.",
      "details": {
        "background": "Recitation of Psalm 92 ('Mizmor Shir L'Yom HaShabbat') and often Psalm 93 ('Adonai Malach') concludes the Kabbalat Shabbat section.",
        "full_text_he": "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת: טוֹב לְהוֹדוֹת לַיהוָה וּלְזַמֵּר לְשִׁמְךָ עֶלְיוֹן...",
        "notes": "Psalm 93 is sometimes omitted in Nusach Ashkenaz when erev Shabbat falls on Rosh Chodesh."
      }
    },
    {
      "id": "mourners_kaddish_interim",
      "name_en": "Mourner's Kaddish (optional)",
      "name_he": "קַדִּישׁ יָתוֹם",
      "summary": "Some communities recite Kaddish Yatom after Kabbalat Shabbat, before Ma'ariv.",
      "details": {
        "background": "Placement varies by custom; some Ashkenazi communities have mourners recite Kaddish here.",
        "notes": "Not universal practice at this point. Sephardim typically delay Kaddish until service conclusion."
      }
    },
    {
      "id": "barchu",
      "name_en": "Call to Prayer (Bar'chu)",
      "name_he": "בָּרְכוּ",
      "summary": "Formal call initiating the Ma'ariv (Evening) service.",
      "details": {
        "background": "Standard liturgical call, requiring a Minyan (10 adult males).",
        "full_text_he": "(Leader:) בָּרְכוּ אֶת יְיָ הַמְּבֹרָךְ.\n(Cong:) בָּרוּךְ יְיָ הַמְּבֹרָךְ לְעוֹלָם וָעֶד.",
        "full_text_en_translit": "(Leader:) Bor'chu et Adonai ha'm'vorach.\n(Cong:) Baruch Adonai ha'm'vorach l'olam va'ed.",
        "full_text_en_translate": "(Leader:) Bless the LORD who is to be blessed.\n(Cong:) Blessed is the LORD who is to be blessed forever and ever.",
        "notes": "Recited according to traditional Halakha. Marks transition to formal prayer service."
      }
    },
    {
      "id": "shema_blessings_before",
      "name_en": "Blessings Before Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "The two standard blessings: Ma'ariv Aravim (creation/time) and Ahavat Olam (revelation/love).",
      "details": {
        "background": "Recited with the full, traditional Hebrew text. Some communities add 'Hamapil' blessing for sleep protection before Shema.",
        "full_text_he": "[Full traditional Hebrew texts for Ma'ariv Aravim and Ahavat Olam]",
        "notes": "Primary language is Hebrew. Sephardim include additional biblical verses in Ahavat Olam."
      }
    },
    {
      "id": "shema",
      "name_en": "Shema",
      "name_he": "שְׁמַע",
      "summary": "The complete, three-paragraph Shema.",
      "details": {
        "background": "Recited according to Halakha, including covering the eyes for the first verse and reciting the full traditional text.",
        "full_text_he": "שְׁמַע יִשְׂרָאֵל יְיָ אֱלֹהֵינוּ יְיָ אֶחָד...",
        "full_text_en_translit": "Sh'ma Yisrael Adonai Eloheinu Adonai Echad...",
        "full_text_en_translate": "Hear, O Israel: The LORD our God, the LORD is one...",
        "notes": "Full Hebrew text is standard. Final verse 'Emet...' sometimes whispered in certain traditions."
      }
    },
    {
      "id": "shema_blessings_after",
      "name_en": "Blessings After Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "The two standard blessings: Emet V'Emunah (redemption) and Hashkiveinu (protection).",
      "details": {
        "background": "Recited with the full, traditional Hebrew text. Hashkiveinu includes special insertions for Shabbat.",
        "full_text_he": "[Full traditional Hebrew texts for Emet V'Emunah and Hashkiveinu]",
        "notes": "Primary language is Hebrew. Some communities stand during Emet V'Emunah."
      }
    },
    {
      "id": "veshamru",
      "name_en": "V'shamru",
      "name_he": "וְשָׁמְרוּ",
      "summary": "Biblical passage (Exodus 31:16-17) about observing Shabbat, recited before Amidah.",
      "details": {
        "background": "A traditional addition before the Shabbat Amidah, emphasizing the covenantal nature of Shabbat observance.",
        "full_text_he": "וְשָׁמְרוּ בְנֵי יִשְׂרָאֵל אֶת הַשַּׁבָּת...",
        "notes": "Standard in most Orthodox rites. Often sung joyfully with congregational participation."
      }
    },
    {
      "id": "half_kaddish",
      "name_en": "Half-Kaddish",
      "name_he": "חֲצִי קַדִּישׁ",
      "summary": "An abbreviated Kaddish marking the transition to the Amidah.",
      "details": {
        "background": "Recited by the prayer leader to punctuate liturgical sections. Requires a Minyan.",
        "notes": "Serves as liturgical 'pause' before silent Amidah. No physical gestures or responses beyond Amen."
      }
    },
    {
      "id": "amidah",
      "name_en": "Amidah (Shemoneh Esrei)",
      "name_he": "עֲמִידָה (שְׁמוֹנֶה עֶשְׂרֵה)",
      "summary": "Central standing prayer (7 blessings for Shabbat), recited silently by the congregation.",
      "details": {
        "background": "Recited individually and silently first, with full concentration (Kavanah). Follows the traditional text precisely, including only the Patriarchs (Avot) in the first blessing. Leader's repetition is usually omitted on Friday night.",
        "full_text_he": "[Standard 7 blessings: Avot, Gevurot, Kedushat Hashem, Kedushat Hayom, Avodah, Hoda'ah, Sim Shalom]",
        "notes": "Silent recitation is the primary fulfillment. No leader's repetition typically on Friday night. Some Hasidic communities include extra supplications."
      }
    },
    {
      "id": "vayechulu",
      "name_en": "Vayechulu",
      "name_he": "וַיְכֻלּוּ",
      "summary": "Congregational recitation of Genesis 2:1-3 after the silent Amidah.",
      "details": {
        "background": "Recalls the completion of Creation and God's rest, reinforcing the theme of Shabbat.",
        "notes": "Often followed by a brief summary blessing (Magen Avot). Congregation may rise for this recitation."
      }
    },
    {
      "id": "full_kaddish",
      "name_en": "Full Kaddish (Kaddish Shalem)",
      "name_he": "קַדִּישׁ שָׁלֵם",
      "summary": "Recited by the prayer leader after the Amidah section.",
      "details": {
        "background": "Includes an additional line praying for acceptance of prayers ('Titkabal...'). Marks the conclusion of this major service section.",
        "notes": "Serves as formal closure before Aleinu. No additional customs associated with this recitation."
      }
    },
    {
      "id": "aleinu",
      "name_en": "Aleinu",
      "name_he": "עָלֵינוּ",
      "summary": "Concluding prayer.",
      "details": {
        "background": "Standard conclusion, recited with traditional text. Some communities add 'Alenu L'Shabe'ach' as extended version.",
        "full_text_he": "עָלֵינוּ לְשַׁבֵּחַ...",
        "full_text_en_translit": "Aleinu l'shabei'ach...",
        "full_text_en_translate": "It is our duty to praise...",
        "notes": "Traditionally recited while facing the Ark. Final verse 'Ki Levado...' may be emphasized with standing."
      }
    },
    {
      "id": "kaddish",
      "name_en": "Mourner's Kaddish",
      "name_he": "קַדִּישׁ יָתוֹם",
      "summary": "Prayer of praise recited by mourners.",
      "details": {
        "background": "Recited by mourners at the conclusion of the service if a Minyan is present.",
        "full_text_he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא...",
        "full_text_en_translit": "Yitgadal v'yitkadash sh'mei raba...",
        "full_text_en_translate": "Magnified and sanctified may God's great Name be...",
        "notes": "Final 'Amen' may be prolonged in some communities. Marks formal service conclusion."
      }
    },
    {
      "id": "closing_hymn",
      "name_en": "Closing Hymn",
      "name_he": "שִׁיר סִיּוּם",
      "summary": "Often concludes with Adon Olam or Yigdal.",
      "details": {
        "background": "Traditional hymns affirming God's eternity and providence are commonly sung. Some communities add zemirot (table songs) here.",
        "full_text_he": "(E.g., Adon Olam - אֲדוֹן עוֹלָם)",
        "notes": "Kiddush is typically recited at home before the meal, not usually part of the synagogue service conclusion. Melodies vary by community tradition."
      }
    }
  ]
}
