{
  "traditionName": "Reform",
  "serviceOrder": [
    {
      "id": "candle_lighting",
      "name_en": "Candle Lighting",
      "name_he": "הַדְלָקַת נֵרוֹת",
      "summary": "Often integrated into the start of the service, marking the transition into Shabbat with light and blessing.",
      "details": {
        "background": "A symbolic and often participatory beginning to the Shabbat service. The blessing is standard, emphasizing the mitzvah of bringing light into Shabbat.",
        "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר שֶׁל שַׁבָּת.",
        "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu l'hadlik ner shel Shabbat.",
        "full_text_en_translate": "Blessed are You, LORD our God, Sovereign of the universe, Who sanctifies us with mitzvot and commands us to kindle the light of Shabbat.",
        "notes": "May involve congregational participation or honors."
      }
    },
    {
      "id": "kabbalat_shabbat",
      "name_en": "Welcoming Shabbat",
      "name_he": "קַבָּלַת שַׁבָּת",
      "summary": "A selection of readings, songs, and potentially Lecha Dodi to joyfully greet Shabbat.",
      "details": {
        "background": "Reform services often abbreviate the traditional six Psalms. The focus is on creating a welcoming, spiritual atmosphere using a mix of traditional elements (like Lecha Dodi) and contemporary readings, poetry, or music reflecting Shabbat themes.",
        "full_text_he": "(Lecha Dodi Sample) לְכָה דוֹדִי לִקְרַאת כַּלָּה...",
        "full_text_en_translit": "(Lecha Dodi Sample) Lecha Dodi likrat kallah...",
        "full_text_en_translate": "(Lecha Dodi Sample) Come, my Beloved, to greet the Bride...",
        "notes": "Highly variable content. May include fewer traditional Psalms, more English readings."
      }
    },
    {
      "id": "barchu",
      "name_en": "Call to Prayer (Bar'chu)",
      "name_he": "בָּרְכוּ",
      "summary": "The formal invitation for the community to join in praising God, marking the start of the Ma'ariv section.",
      "details": {
        "background": "A standard liturgical element maintained across movements, requiring a Minyan (quorum, defined inclusively in Reform Judaism) for public recitation. Congregation responds affirming God's blessing.",
        "full_text_he": "(Leader:) בָּרְכוּ אֶת יְיָ הַמְּבֹרָךְ.\n(Cong:) בָּרוּךְ יְיָ הַמְּבֹרָךְ לְעוֹלָם וָעֶד.",
        "full_text_en_translit": "(Leader:) Bor'chu et Adonai ha'm'vorach.\n(Cong:) Baruch Adonai ha'm'vorach l'olam va'ed.",
        "full_text_en_translate": "(Leader:) Praise the LORD to whom praise is due!\n(Cong:) Praised be the LORD to whom praise is due, forever and ever.",
        "notes": ""
      }
    },
    {
      "id": "shema_blessings_before",
      "name_en": "Blessings Before Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Prayers praising God for creation (light/darkness cycles) and revelation (love/Torah).",
      "details": {
        "background": "Reform liturgy retains the themes of these two blessings but often uses adapted Hebrew and/or significant English translations and interpretations (e.g., focusing on God's presence in nature and the gift of wisdom/teaching).",
        "full_text_he": "(Themes: Ma'ariv Aravim - יְיָ הַמַּעֲרִיב עֲרָבִים; Ahavat Olam - אַהֲבַת עוֹלָם)",
        "full_text_en_translit": "(Themes: Ma'ariv Aravim; Ahavat Olam)",
        "full_text_en_translate": "(Themes: Who brings on evening; Everlasting Love)",
        "notes": "Texts often significantly modified or translated."
      }
    },
    {
        "id": "shema",
        "name_en": "Shema",
        "name_he": "שְׁמַע",
        "summary": "The core affirmation of God's oneness, often including the first paragraph (V'ahavta).",
        "details": {
            "background": "Central to all Jewish prayer. Reform practice emphasizes the core declaration (Shema Yisrael...) and the V'ahavta (You shall love...). Subsequent paragraphs may be read in English, summarized, or omitted.",
            "full_text_he": "שְׁמַע יִשְׂרָאֵל, יְיָ אֱלֹהֵינוּ, יְיָ אֶחָד.\n(Quietly:) בָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד.\n(V'ahavta:) וְאָהַבְתָּ...",
            "full_text_en_translit": "Sh'ma Yisrael, Adonai Eloheinu, Adonai Echad.\n(Quietly:) Baruch shem k'vod malchuto l'olam va'ed.\n(V'ahavta:) V'ahavta...",
            "full_text_en_translate": "Hear, O Israel: the LORD is our God, the LORD is One.\n(Quietly:) Blessed is the Name of God's glorious kingdom forever and ever.\n(V'ahavta:) You shall love...",
            "notes": "Focus often on the first paragraph (V'ahavta)."
        }
    },
    {
      "id": "shema_blessings_after",
      "name_en": "Blessings After Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Prayers affirming God's redemption (Emet V'Emunah theme) and seeking protection (Hashkiveinu theme).",
      "details": {
        "background": "The themes of redemption and divine protection are maintained, but texts are often adapted, shortened, or rendered creatively in English, reflecting on historical liberation and praying for peace and security.",
        "full_text_he": "(Themes: Emet V'Emunah - אֱמֶת וֶאֱמוּנָה; Hashkiveinu - הַשְׁכִּיבֵנוּ)",
        "full_text_en_translit": "(Themes: Emet V'Emunah; Hashkiveinu)",
        "full_text_en_translate": "(Themes: Truth and Faithfulness/Redemption; Help us lie down in peace)",
        "notes": "Often includes creative liturgical adaptations in English."
      }
    },
    {
        "id": "amidah",
        "name_en": "Amidah / Tefillah",
        "name_he": "עֲמִידָה / תְּפִלָּה",
        "summary": "The Standing Prayer, focusing on Shabbat's sanctity. Often recited congregationally in Hebrew and/or English.",
        "details": {
            "background": "Reform Amidah retains the 7-blessing structure (3 opening, 1 central Shabbat theme, 3 closing) but frequently uses contemporary language, gender-inclusive God-language, and thematic interpretations rather than literal translations of the full traditional text. Emphasis is on communal recitation and understanding.",
            "full_text_he": "(Themes: Avot/Imahot - אָבוֹת/אִמָהוֹת, G'vurot - גְּבוּרוֹת, Kedushat Hashem - קְדֻשַּׁת הַשֵּׁם, Kedushat Hayom - קְדֻשַּׁת הַיּוֹם, Avodah - עֲבוֹדָה, Hoda'ah - הוֹדָאָה, Shalom - שָׁלוֹם)",
            "full_text_en_translit": "(Themes: Ancestors/Matriarchs, God's Might, God's Holiness, Sanctity of the Day, Service, Gratitude, Peace)",
            "full_text_en_translate": "[Texts vary widely, focusing on Shabbat themes of rest, peace, creation, covenant, hope. Often incorporates English readings and responsive participation.]",
            "notes": "Silent prayer less common; communal recitation standard. Egalitarian language (including Matriarchs) typical."
        }
    },
    {
        "id": "silent_prayer_sermon",
        "name_en": "Silent Prayer / Sermon / Reading",
        "name_he": "תְּפִלָּה שֶׁקֶטָה / דְרָשָׁה",
        "summary": "A time for personal reflection, or often incorporates a sermon (D'var Torah) or topical reading.",
        "details": {
            "background": "While traditional services include silent Amidah, Reform often replaces or supplements this with a sermon, teaching, communal reading, or a shorter period for personal kavanah (intention).",
            "notes": "Sequence flexible, sermon might occur earlier or later."
        }
    },
    {
      "id": "aleinu",
      "name_en": "Aleinu",
      "name_he": "עָלֵינוּ",
      "summary": "Concluding prayer praising God and expressing hope for a perfected world (Tikkun Olam).",
      "details": {
        "background": "Commonly included, often with contemporary English interpretations focusing on universal responsibility and the partnership with God in repairing the world.",
        "full_text_he": "עָלֵינוּ לְשַׁבֵּחַ...",
        "full_text_en_translit": "Aleinu l'shabei'ach...",
        "full_text_en_translate": "It is our duty to praise...",
        "notes": "Second paragraph's language about idolatry sometimes modified."
      }
    },
    {
      "id": "kaddish",
      "name_en": "Mourner's Kaddish",
      "name_he": "קַדִּישׁ יָתוֹם",
      "summary": "Prayer of praise recited by mourners.",
      "details": {
        "background": "Recited near the end of the service if mourners are present and a Minyan exists. The Aramaic text is standard.",
        "full_text_he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא...",
        "full_text_en_translit": "Yitgadal v'yitkadash sh'mei raba...",
        "full_text_en_translate": "Magnified and sanctified may God's great Name be...",
        "notes": ""
      }
    },
    {
      "id": "closing_song_kiddush",
      "name_en": "Closing Song / Kiddush",
      "name_he": "שִׁיר סִיּוּם / קִדּוּשׁ",
      "summary": "Service often concludes with a hymn, blessing, or communal Kiddush.",
      "details": {
        "background": "Reform services often end with a familiar hymn (e.g., Adon Olam, Ein Keloheinu) or a benediction. Kiddush (blessing over wine) is frequently performed congregationally after the service concludes, leading into an Oneg Shabbat (social gathering).",
        "notes": "High degree of local custom and musical choices influence the closing."
      }
    }
  ]
}