{
  "traditionName": "Reform",
  "serviceOrder": [
    {
      "id": "candle_lighting",
      "name_en": "Candle Lighting",
      "name_he": "הַדְלָקַת נֵרוֹת",
      "summary": "Often integrated into the start of the service, marking the transition into Shabbat with light and blessing.",
      "details": {
        "background": "A symbolic and often participatory beginning to the Shabbat service. The blessing is standard, emphasizing the mitzvah of bringing light into Shabbat.",
        "full_text_he": "בָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר שֶׁל שַׁבָּת.",
        "full_text_en_translit": "Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu l'hadlik ner shel Shabbat.",
        "full_text_en_translate": "Blessed are You, LORD our God, Sovereign of the universe, Who sanctifies us with mitzvot and commands us to kindle the light of Shabbat.",
        "notes": "May involve congregational participation or honors."
      }
    },
    {
      "id": "kabbalat_shabbat",
      "name_en": "Welcoming Shabbat",
      "name_he": "קַבָּלַת שַׁבָּת",
      "summary": "A selection of readings, songs, and potentially Lecha Dodi to joyfully greet Shabbat.",
      "details": {
        "background": "Reform services often abbreviate the traditional six Psalms. The focus is on creating a welcoming, spiritual atmosphere using a mix of traditional elements (like Lecha Dodi) and contemporary readings, poetry, or music reflecting Shabbat themes.",
        "full_text_he": "לְכָה דוֹדִי לִקְרַאת כַּלָּה, פְּנֵי שַׁבָּת נְקַבְּלָה.\n\n(Sample Stanza)\nשָׁמוֹר וְזָכוֹר בְּדִבּוּר אֶחָד,\nהִשְׁמִיעָנוּ אֵל הַמְּיֻחָד.\nיְיָ אֶחָד וּשְׁמוֹ אֶחָד,\nלְשֵׁם וּלְתִפְאֶרֶת וְלִתְהִלָּה.\n\n(Final Stanza - Turning towards entrance)\nבּוֹאִי בְשָׁלוֹם עֲטֶרֶת בַּעְלָהּ,\nגַּם בְּשִׂמְחָה וּבְצָהֳלָה.\nתּוֹךְ אֱמוּנֵי עַם סְגֻלָּה,\nבּוֹאִי כַלָּה, בּוֹאִי כַלָּה.",
        "full_text_en_translit": "Lecha Dodi likrat kallah, p'nei Shabbat n'kab'lah.\n\n(Sample Stanza)\nShamor v'zachor b'dibur echad,\nHishmi'anu El ha'm'yuchad.\nAdonai echad u'shmo echad,\nL'Shem ul'tiferet v'lithilah.\n\n(Final Stanza - Turning towards entrance)\nBo'i v'shalom ateret ba'alah,\nGam b'simcha u'v'tzoholah.\nToch emunei am s'gulah,\nBo'i kallah, bo'i kallah.",
        "full_text_en_translate": "Come, my Beloved, to greet the Bride; let us welcome the presence of Shabbat.\n\n(Sample Stanza)\n\"Keep\" and \"Remember\" in a single utterance,\nThe Unique God let us hear.\nThe LORD is One and His Name is One,\nFor renown, for splendor, and for praise.\n\n(Final Stanza - Turning towards entrance)\nEnter in peace, O crown of your Husband,\nEnter in gladness and jubilation.\nAmong the faithful of the treasured people,\nEnter O Bride, enter O Bride!",
        "notes": "Highly variable content. May include fewer traditional Psalms, more English readings. Often Psalm 92 is omitted or replaced."
      }
    },
    {
      "id": "barchu",
      "name_en": "Call to Prayer (Bar'chu)",
      "name_he": "בָּרְכוּ",
      "summary": "The formal invitation for the community to join in praising God, marking the start of the Ma'ariv section.",
      "details": {
        "background": "A standard liturgical element maintained across movements, requiring a Minyan (quorum, defined inclusively in Reform Judaism) for public recitation. Congregation responds affirming God's blessing.",
        "full_text_he": "(Leader:) בָּרְכוּ אֶת יְיָ הַמְּבֹרָךְ.\n(Cong:) בָּרוּךְ יְיָ הַמְּבֹרָךְ לְעוֹלָם וָעֶד.",
        "full_text_en_translit": "(Leader:) Bor'chu et Adonai ha'm'vorach.\n(Cong:) Baruch Adonai ha'm'vorach l'olam va'ed.",
        "full_text_en_translate": "(Leader:) Praise the LORD to whom praise is due!\n(Cong:) Praised be the LORD to whom praise is due, forever and ever.",
        "notes": ""
      }
    },
    {
      "id": "shema_blessings_before",
      "name_en": "Blessings Before Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Prayers praising God for creation (light/darkness cycles) and revelation (love/Torah).",
      "details": {
        "background": "Reform liturgy retains the themes of these two blessings but often uses adapted Hebrew and/or significant English translations and interpretations (e.g., focusing on God's presence in nature and the gift of wisdom/teaching).",
        "full_text_he": "(Theme 1: Ma'ariv Aravim)\nבָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר בִּדְבָרוֹ מַעֲרִיב עֲרָבִים בְּחָכְמָה, פּוֹתֵחַ שְׁעָרִים בִּתְבוּנָה... הַמַּעֲרִיב עֲרָבִים.\n\n(Theme 2: Ahavat Olam)\nאַהֲבַת עוֹלָם בֵּית יִשְׂרָאֵל עַמְּךָ אָהָבְתָּ, תּוֹרָה וּמִצְוֹת חֻקִּים וּמִשְׁפָּטִים אוֹתָנוּ לִמַּדְתָּ... הַבּוֹחֵר בְּעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה.",
        "full_text_en_translit": "(Theme 1: Ma'ariv Aravim)\nBaruch atah Adonai Eloheinu Melech ha'olam, asher bid'varo ma'ariv aravim b'chochmah, potei'ach sh'arim bit'vunah... Hama'ariv aravim.\n\n(Theme 2: Ahavat Olam)\nAhavat olam beit Yisrael am'cha ahavta, Torah u'mitzvot chukim u'mishpatim otanu limad'ta... Habocher b'amo Yisrael b'ahavah.",
        "full_text_en_translate": "(Theme 1: Praise to You, Adonai our God, Sovereign of the universe: Your word brings the evening dusk. You open the gates of dawn with wisdom... Source of evening shadows.)\n\n(Theme 2: With everlasting love You love Your people Israel. Torah and mitzvot, laws and precepts You taught us... Source of love for the people Israel.)\n[Note: English translations in Reform prayer books vary widely and often use creative, non-literal renderings.]",
        "notes": "Texts often significantly modified, shortened, or primarily recited in English with thematic Hebrew phrases."
      }
    },
    {
        "id": "shema",
        "name_en": "Shema",
        "name_he": "שְׁמַע",
        "summary": "The core affirmation of God's oneness, often including the first paragraph (V'ahavta).",
        "details": {
            "background": "Central to all Jewish prayer. Reform practice emphasizes the core declaration (Shema Yisrael...) and the V'ahavta (You shall love...). Subsequent paragraphs may be read in English, summarized, or omitted.",
            "full_text_he": "שְׁמַע יִשְׂרָאֵל, יְיָ אֱלֹהֵינוּ, יְיָ אֶחָד.\n(Quietly:) בָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד.\n\n(V'ahavta)\nוְאָהַבְתָּ אֵת יְיָ אֱלֹהֶיךָ בְּכָל לְבָבְךָ וּבְכָל נַפְשְׁךָ וּבְכָל מְאֹדֶךָ. וְהָיוּ הַדְּבָרִים הָאֵלֶּה אֲשֶׁר אָנֹכִי מְצַוְּךָ הַיּוֹם עַל לְבָבֶךָ. וְשִׁנַּנְתָּם לְבָנֶיךָ וְדִבַּרְתָּ בָּם בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ. וּקְשַׁרְתָּם לְאוֹת עַל יָדֶךָ וְהָיוּ לְטֹטָפֹת בֵּין עֵינֶיךָ. וּכְתַבְתָּם עַל מְזֻזוֹת בֵּיתֶךָ וּבִשְׁעָרֶיךָ.",
            "full_text_en_translit": "Sh'ma Yisrael, Adonai Eloheinu, Adonai Echad.\n(Quietly:) Baruch shem k'vod malchuto l'olam va'ed.\n\n(V'ahavta)\nV'ahavta et Adonai Eloheicha b'chol l'vav'cha u'v'chol naf'sh'cha u'v'chol m'odecha. V'hayu had'varim ha'eileh asher anochi m'tzav'cha hayom al l'vavecha. V'shinantam l'vaneicha v'dibarta bam b'shivt'cha b'veitecha u'v'lecht'cha vaderech u'v'shochb'cha u'v'kumecha. U'k'shartam l'ot al yadecha v'hayu l'totafot bein einecha. U'chtavtam al m'zuzot beitecha u'vish'areicha.",
            "full_text_en_translate": "Hear, O Israel: the LORD is our God, the LORD is One.\n(Quietly:) Blessed is the Name of God's glorious kingdom forever and ever.\n\n(V'ahavta)\nYou shall love the LORD your God with all your heart, with all your soul, and with all your might. And these words which I command you today shall be upon your heart. You shall teach them diligently to your children, and you shall speak of them when you sit in your house, when you walk by the way, when you lie down, and when you rise up. You shall bind them as a sign upon your hand, and they shall be for frontlets between your eyes. And you shall write them on the doorposts of your house and upon your gates. (Deuteronomy 6:5-9)",
            "notes": "Focus often on the first paragraph (V'ahavta). Deut 11 & Num 15 paragraphs often omitted or read in English/thematically."
        }
    },
    {
      "id": "shema_blessings_after",
      "name_en": "Blessings After Shema",
      "name_he": "בִּרְכוֹת קְרִיאַת שְׁמַע",
      "summary": "Prayers affirming God's redemption (Emet V'Emunah theme) and seeking protection (Hashkiveinu theme).",
      "details": {
        "background": "The themes of redemption and divine protection are maintained, but texts are often adapted, shortened, or rendered creatively in English, reflecting on historical liberation and praying for peace and security.",
        "full_text_he": "(Theme 1: Ge'ulah/Redemption - based on Emet V'Emunah)\nאֱמֶת וֶאֱמוּנָה כָּל זֹאת... מִמִּצְרַיִם גְּאַלְתָּנוּ יְיָ אֱלֹהֵינוּ... גָּאַל יִשְׂרָאֵל.\n\n(Theme 2: Hashkiveinu)\nהַשְׁכִּיבֵנוּ יְיָ אֱלֹהֵינוּ לְשָׁלוֹם וְהַעֲמִידֵנוּ מַלְכֵּנוּ לְחַיִּים... וּפְרֹשׂ עָלֵינוּ סֻכַּת שְׁלוֹמֶךָ... הַפּוֹרֵשׂ סֻכַּת שָׁלוֹם עָלֵינוּ וְעַל כָּל עַמּוֹ יִשְׂרָאֵל וְעַל יְרוּשָׁלָיִם.",
        "full_text_en_translit": "(Theme 1: Ge'ulah/Redemption)\nEmet ve'emunah kol zot... MiMitzrayim g'altanu Adonai Eloheinu... Ga'al Yisrael.\n\n(Theme 2: Hashkiveinu)\nHashkiveinu Adonai Eloheinu l'shalom v'ha'amideinu Malkeinu l'chayim... Ufros aleinu sukkat sh'lomecha... Haporeis sukkat shalom aleinu v'al kol amo Yisrael v'al Yerushalayim.",
        "full_text_en_translate": "(Theme 1: True and enduring is this for us... From Egypt You redeemed us, Adonai our God... Redeemer of Israel.)\n\n(Theme 2: Grant, O God, that we lie down in peace, and raise us up, our Sovereign, to life... Spread over us the shelter of Your peace... Who spreads the shelter of peace over us, over all Your people Israel, and over Jerusalem.)\n[Note: English translations and Hebrew adaptations vary widely in Reform prayer books.]",
        "notes": "Often includes creative liturgical adaptations in English focusing on freedom, peace, and security."
      }
    },
    {
        "id": "amidah",
        "name_en": "Amidah / Tefillah",
        "name_he": "עֲמִידָה / תְּפִלָּה",
        "summary": "The Standing Prayer, focusing on Shabbat's sanctity. Often recited congregationally in Hebrew and/or English.",
        "details": {
            "background": "Reform Amidah retains the 7-blessing structure (3 opening, 1 central Shabbat theme, 3 closing) but frequently uses contemporary language, gender-inclusive God-language, and thematic interpretations rather than literal translations of the full traditional text. Emphasis is on communal recitation and understanding.",
            "full_text_he": "(Opening Themes)\n1. אָבוֹת וְאִמָהוֹת (Avot v'Imahot - Ancestors)\n2. גְּבוּרוֹת (G'vurot - God's Might/Life)\n3. קְדֻשַּׁת הַשֵּׁם (Kedushat Hashem - God's Holiness)\n\n(Central Theme)\n4. קְדֻשַּׁת הַיּוֹם (Kedushat Hayom - Sanctity of Shabbat: Creation, Rest, Covenant)\n\n(Closing Themes)\n5. עֲבוֹדָה (Avodah - Service/Worship - often reinterpreted)\n6. הוֹדָאָה (Hoda'ah - Gratitude - often uses Modim Anachnu)\n7. שָׁלוֹם (Shalom - Peace)",
            "full_text_en_translit": "(Opening Themes)\n1. Avot v'Imahot\n2. G'vurot\n3. Kedushat Hashem\n\n(Central Theme)\n4. Kedushat Hayom\n\n(Closing Themes)\n5. Avodah\n6. Hoda'ah\n7. Shalom",
            "full_text_en_translate": "[Reform texts offer diverse interpretations and contemporary language for each blessing's theme, often including responsive readings and English reflections. Focus is on concepts like God's presence in history, power in nature/life, holiness, Shabbat as a gift of rest and renewal, gratitude for life's blessings, and prayers for peace.]",
            "notes": "Silent prayer less common; communal recitation standard. Egalitarian language (including Matriarchs) typical. Texts vary significantly between different Reform prayer books (e.g., Mishkan T'filah)."
        }
    },
    {
        "id": "silent_prayer_sermon",
        "name_en": "Silent Prayer / Sermon / Reading",
        "name_he": "תְּפִלָּה שֶׁקֶטָה / דְרָשָׁה",
        "summary": "A time for personal reflection, or often incorporates a sermon (D'var Torah) or topical reading.",
        "details": {
            "background": "While traditional services include silent Amidah, Reform often replaces or supplements this with a sermon, teaching, communal reading, or a shorter period for personal kavanah (intention).",
            "notes": "Sequence flexible, sermon might occur earlier or later."
        }
    },
     {
        "id": "healing_prayer_optional",
        "name_en": "Mi Sheberach (Healing Prayer - Optional)",
        "name_he": "מִי שֶׁבֵּרַךְ",
        "summary": "Often included, a prayer for physical and spiritual healing for those in need.",
        "details": {
            "background": "Many Reform congregations include a Mi Sheberach prayer, often using the popular setting by Debbie Friedman or other contemporary melodies. Names may be read aloud or held silently.",
            "full_text_he": "מִי שֶׁבֵּרַךְ אֲבוֹתֵינוּ... הוּא יְבָרֵךְ אֶת הַחוֹלִים...",
            "full_text_en_translit": "Mi sheberach avoteinu... Hu y'vareich et hacholim...",
            "full_text_en_translate": "May the One who blessed our ancestors... bless and heal those who are ill...",
            "notes": "Placement varies; sometimes earlier, sometimes here."
        }
    },
    {
      "id": "aleinu",
      "name_en": "Aleinu",
      "name_he": "עָלֵינוּ",
      "summary": "Concluding prayer praising God and expressing hope for a perfected world (Tikkun Olam).",
      "details": {
        "background": "Commonly included, often with contemporary English interpretations focusing on universal responsibility and the partnership with God in repairing the world.",
        "full_text_he": "עָלֵינוּ לְשַׁבֵּחַ לַאֲדוֹן הַכֹּל, לָתֵת גְּדֻלָּה לְיוֹצֵר בְּרֵאשִׁית, שֶׁלֹּא עָשָׂנוּ כְּגוֹיֵי הָאֲרָצוֹת, וְלֹא שָׂמָנוּ כְּמִשְׁפְּחוֹת הָאֲדָמָה. שֶׁלֹּא שָׂם חֶלְקֵנוּ כָּהֶם, וְגוֹרָלֵנוּ כְּכָל הֲמוֹנָם. וַאֲנַחְנוּ כּוֹרְעִים וּמִשְׁתַּחֲוִים וּמוֹדִים, לִפְנֵי מֶלֶךְ מַלְכֵי הַמְּלָכִים, הַקָּדוֹשׁ בָּרוּךְ הוּא.",
        "full_text_en_translit": "Aleinu l'shabei'ach la'adon hakol, lateit g'dulah l'yotzer b'reishit, shelo asanu k'goyei ha'aratzot, v'lo samanu k'mishp'chot ha'adamah. Shelo sam chelkeinu kahem, v'goraleinu k'chol hamonam. Va'anachnu kor'im u'mishtachavim u'modim, lifnei Melech malchei ham'lachim, HaKadosh Baruch Hu.",
        "full_text_en_translate": "It is our duty to praise the Sovereign of all, to acclaim the Creator of all beginnings. God has not made us like the nations of the world, nor set us like the families of the earth. God has not assigned us a portion like theirs, nor a destiny like that of all their multitudes. And so we bend the knee, bowing low, and give thanks before the supreme Sovereign, the Holy One of Blessing.",
        "notes": "Second paragraph often adapted or interpreted thematically."
      }
    },
    {
      "id": "kaddish",
      "name_en": "Mourner's Kaddish",
      "name_he": "קַדִּישׁ יָתוֹם",
      "summary": "Prayer of praise recited by mourners.",
      "details": {
        "background": "Recited near the end of the service if mourners are present and a Minyan (quorum defined inclusively) exists. The Aramaic text is standard.",
        "full_text_he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. (קהל: אָמֵן)\nבְּעָלְמָא דִּי בְרָא כִרְעוּתֵהּ וְיַמְלִיךְ מַלְכוּתֵהּ בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן.\n(קהל: אָמֵן. יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא)\nיְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא.\nיִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרוֹמַם וְיִתְנַשֵּׂא וְיִתְהַדָּר וְיִתְעַלֶּה וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא בְּרִיךְ הוּא. (קהל: אָמֵן)\nלְעֵלָּא מִן כָּל בִּרְכָתָא וְשִׁירָתָא תֻּשְׁבְּחָתָא וְנֶחֱמָתָא דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן. (קהל: אָמֵן)\nיְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא וְחַיִּים עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל, וְאִמְרוּ אָמֵן. (קהל: אָמֵן)\nעֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו הוּא יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל, וְאִמְרוּ אָמֵן. (קהל: אָמֵן)",
        "full_text_en_translit": "Yitgadal v'yitkadash sh'mei raba. (Cong: Amen)\nB'alma di v'ra chir'utei, v'yamlich malchutei b'chayeichon u'v'yomeichon u'v'chayei d'chol beit Yisrael, ba'agala u'vizman kariv, v'imru Amen.\n(Cong: Amen. Y'hei sh'mei raba m'varach l'alam u'l'almei almaya)\nY'hei sh'mei raba m'varach l'alam u'l'almei almaya.\nYitbarach v'yishtabach v'yitpa'ar v'yitromam v'yitnasei, v'yit'hadar v'yit'aleh v'yit'halal sh'mei d'kudsha b'rich hu. (Cong: Amen)\nL'eila min kol birchata v'shirata tushb'chata v'nechemata da'amiran b'alma, v'imru Amen. (Cong: Amen)\nY'hei sh'lama raba min sh'maya v'chayim aleinu v'al kol Yisrael, v'imru Amen. (Cong: Amen)\nOseh shalom bimromav, hu ya'aseh shalom aleinu v'al kol Yisrael, v'imru Amen. (Cong: Amen)",
        "full_text_en_translate": "Magnified and sanctified may God's great Name be. (Cong: Amen)\nIn the world created according to plan, may God's sovereignty be established in your lifetime and in your days, and in the lifetime of the entire house of Israel, speedily and soon; and say, Amen.\n(Cong: Amen. May God's great Name be blessed forever and to all eternity.)\nMay God's great Name be blessed forever and to all eternity.\nBlessed and praised, glorified and exalted and uplifted, honored and adored and lauded may be the Name of the Holy One, blessed be God. (Cong: Amen)\nBeyond all blessings and hymns, praises and consolations which are uttered in the world; and say, Amen. (Cong: Amen)\nMay there be abundant peace from heaven, and life for us and for all Israel; and say, Amen. (Cong: Amen)\nMay the One who makes peace in the high heavens make peace for us and for all Israel; and say, Amen. (Cong: Amen)",
        "notes": ""
      }
    },
    {
      "id": "closing_song_kiddush",
      "name_en": "Closing Song / Kiddush",
      "name_he": "שִׁיר סִיּוּם / קִדּוּשׁ",
      "summary": "Service often concludes with a hymn, blessing, or communal Kiddush.",
      "details": {
        "background": "Reform services often end with a familiar hymn (e.g., Adon Olam, Ein Keloheinu) or a benediction. Kiddush (blessing over wine) is frequently performed congregationally after the service concludes, leading into an Oneg Shabbat (social gathering).",
        "full_text_he": "(Kiddush Blessing over Wine)\nבָּרוּךְ אַתָּה יְיָ אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הַגָּפֶן.\n\n(Adon Olam - First Verse)\nאֲדוֹן עוֹלָם אֲשֶׁר מָלַךְ, בְּטֶרֶם כָּל יְצִיר נִבְרָא.",
        "full_text_en_translit": "(Kiddush Blessing over Wine)\nBaruch atah Adonai Eloheinu Melech ha'olam, borei p'ri hagafen.\n\n(Adon Olam - First Verse)\nAdon olam asher malach, b'terem kol y'tzir nivra.",
        "full_text_en_translate": "(Kiddush Blessing over Wine)\nBlessed are You, LORD our God, Sovereign of the universe, Creator of the fruit of the vine.\n\n(Adon Olam - First Verse)\nEternal Lord, who reigned supreme, Before all creation was drawn.",
        "notes": "High degree of local custom and musical choices influence the closing."
      }
    }
  ]
}